Notes.org
#+TITLE: Digital Forensics and Cybercrime
#+OPTIONS: toc:t todo:nil date:nil \n:t H:5 tasks:done html-style:nil num:nil tags:t
#+EXPORT_FILE_NAME: index
#+LATEX_HEADER: \usepackage[margin=0.9in]{geometry} \usepackage{parskip}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/dfc-notes.css" />
#+MACRO: under \underline{$1}
* NO Incontro con Luigi Perri (17/03/2021) :noexport:
** Prove tipiche e prove atipiche
 Prove tipiche: prove raccolte con i metodi usuali - intercettazioni (che non possono avvenire in luoghi di privata dimora, a meno che non si stia svolgendo l'attività criminale in quel momento) etc.
 Prove atipiche: può essere frutto di un mezzo di ricerca tipico con qualche funzionalità in più (vedi trojan), o addirittura essere completamente slegato dai mezzi di ricerca ordinari. Queste prove vanno sempre valutate nel caso concreto.
** Il captatore informatico (o trojan di stato)
"captatore informatico" è un termine coniato dalla corte di cassazione per identificare strumenti informatici identificativi.
Rappresentano una vera e propria panacea:
+ non mettono a rischio gli operatori, che non devono muoversi sotto copertura per piazzare cimici etc
+ riesce a coniugare in un unico strumento una molteplicità di strumenti investigativi:
  + intercettazione di audio
  + intercettazione video
  + spingere il dispositivo a comportamenti anomali
  + effettuare una perquisizione dei dati

*** Definizioni
cassazione a nazioni unite del 2016: "capta tutto il traffico dati, attiva il microfono *ovunque egli si trovi*, può attivare telecamera e altre cose, intercetta ciò che viene digitato sulla tastiera etc."
A questo potere bisogna oppore un contropotere (sotto forma di garanzie) per cui non ci sia un abuso di tale strumento

Per definizione, l'attività d'intercettazione ha come presupposto che essa sia fatta senza che la vittima ne sia a conoscenza.

Il pubblico ministero in Italia deve essere garantista: se trova elementi a discolpa dell'imputato, deve proteggerlo.

*** Problemi
- La pervasività dello strumento rende difficile una collocazione delle prove tra le prove tipiche.
  (vedi cassazione del 14 ottoble 2009)
- come sapere quando intercettare? dato che non possiamo intercettare in privata dimora, potremmo non beccare mai il crimine
  - nuova cassazione: si può basare l'inizio dell'intercettazione sulle abitudini della persona.

*** Requisiti di un captatore 
- L'attivazione di un microfono deve avvenire tramite un comando remoto, non solo con l'inserimento del captatore informatico.
- la registrazione audio può essere attivata solo da un operatore della polizia giudiziaria, con verbale
- L'attivazione del dispositivo è sempre ammessa in particolari delitti (solitamenti in casi con pene elevate)
- L'attivazione del dispositiva deve essere usata come extrema ratio.
- La trasmissione delle registrazioni deve essere effettuata solo verso i server della procura.
- Siano usati solo programmi informatici conformi a requisiti tecnici stabiliti con uno specifico decreto ministeriale (non ancora emanato sadly)
- In casi estremi, l'uso dello strumento può essere usato prima dell'ok del giudice
- Non possono essere in alcun modo rese pubbliche le intercettazioni a cui prendono parte elementi esterni all'indagine.

*** Limiti all'utilizzabilità
Sempre permesso per reati gravi contro la persona (tratta di esseri umani o riduzione in schiavitù) o reati con pena oltre i 5 anni di reclusione.
Permesso nei luoghi privati solo se si è sicuri si tratti dei luoghi in cui avviene il crimine

Nota che la prova informatica, per quanto possa sembrare la "prova regina", deve sempre essere sostenuta da altri metodi investigativi per non interpretare in modo sbagliato le prove.

*** Installazione
Dal punto di vista informatico, si è visto di tutto.
Dal punto di vista giuridico, il codice prevede le prestazioni obbligatorie: gli operatori di comunicazione devono permettere agli operatori giuridici di agevolare l'intercettazione (=> anche l'installazione).
Il decreto ministeriale ancora da definire dovrebbe specificare anche questo aspetto.

*** Il caso Exodus 
Spyware.
Raccoglie informazioni sulla scheda e, in un secondo momento, ottiene il controlo del dispositivo.
Il codice è stato sottratto e sono state realizzare delle app "clone".

Il garante si è spresso sulla preoccupazione riguardo i rischi di perdere il controllo di questi strumenti:
Invitava a valutare l'opportunità di includere nel decreto legislativo (sempre quello non ancora fatto) l'indicazione dei luoghi e del tempo della captazione.
Riguardo i requisiti tecnici il garante ha detto: va specificato i moduli del sistema di intercettazione, non bisognerebbe utilizzare software che abbassano il livello di sicurezza dei dispositivi (per evitare altri attacchi da terzi e per evitare che sia rilevata dall'utente la presenza del trojan), i canali di trasferimento dei dati dovrebbero essere il più sicuri possibile.
