index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-13 dom 01:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Digital Forensics and Cybercrime</title>
<meta name="author" content="Tancredi Covioli" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/dfc-notes.css" />
</head>
<body>
<div id="content">
<h1 class="title">Digital Forensics and Cybercrime</h1>
