Notes.org
** Threat dimensions
:PROPERTIES:
:NOTER_PAGE: 3
:END:
Threats can be
- *Generic* or *Targeted*:
  + Generic threats are threats in which we incur for simply being connected to the internet.
  + Targeted threats are threats that exploit known informations about us.
- Financially or non *financially motivated*:
  + Financially motivated threats are easy to understand.
  + Non financially motivated threats can be difficult to understand
- *Internal* or *External*:
  + Internal threats are put up by some internal figure of the organization itself.
  + External threats are put up by external figures (like criminals and other organizations).

** Gartner quadrant of threats
:PROPERTIES:
:NOTER_PAGE: 4
:END:
A table showing some example of the threat categories listed above, with their relative possible financiary motivation level.
** Internal threats
:PROPERTIES:
:NOTER_PAGE: 5
:END:
Internal threats can be countered by contracts and _separation of duties_.
They can be of various kind:
- Malicious insiders (personal gain)
- Inside agents (other organizations)
- Emotional employees (revenge)
- Reckless employees (self conciousness)
- Third party users (other organization's users)
** How to manage a cyber attack
:PROPERTIES:
:NOTER_PAGE: 8
:END:
In cyberspace, private companies defend their own piece of infrastructure by themselves.
When we talk about public or semi-public agencies (see ENI, VODAFONE etc.), what should they do in case of a big scale cyber-attack? Is the jurisdiction of the attack on them or on the nation?

The NATO wrote an entire manual (the Tallin Manual) on the policy they think applies to confilcts in cyberspace.
** Financially oriented attacks
:PROPERTIES:
:NOTER_PAGE: 9
:END:
The monetization of the attacks can be either direct or indirect.
- Direct monetization: credit card / bank account fraud; ransomware; fake AVs.
- Indirect monetization: information gathering; abuse computing resources for other attacks; rent or sell botnets.

The discriminant between the two is whether the money comes directly from the victim or from the use of their computer.
** Cybercrime
:PROPERTIES:
:NOTER_PAGE: 24
:END:
Cybercrime has its own ecosystem, whit producers, enablers (that don't produce the exploits but keep them relevant) and clients
*** Identity theft
:PROPERTIES:
:NOTER_PAGE: 22
:END:
Identities are stolen because they can be abused.
American SSN is sometimes abused for authentication purposes.
*** DONE Selling kits
Various kinds of kits are sold in the cybercrime ecosystem:
Botnets, exploitation kits, viruses..

These are then used for other kinds of crimes.

Also, the selling of stolen VISA accounts is common for money laundering and scamming (e.g: the scam of buying plane tickets and sell them to poor people before the real owner of the card blocks the payment).
* DONE Abuses of cryptocurrency and forensics
:PROPERTIES:
:NOTER_DOCUMENT: slides/02. Abuses of cryptocurrency and forensics.pdf
:NOTER_PAGE: 39
:END:

** Some informations
:PROPERTIES:
:NOTER_PAGE: 4
:END:
*** Bitcoin wallet
- Manage and store keys of you bitcoin addresses
- Creates and signs transactions (receive/send BTC)
- Track the balance

*** Bitcoin address
:PROPERTIES:
:NOTER_PAGE: 5
:END:
String used to receive payments.
You usually want to use more addresses to make people unable to track your movements.

*** Bitcoin mining
:PROPERTIES:
:NOTER_PAGE: 9
:END:
"Miners" compete to solve a complex problem by bruteforce: find the next block of transactions with as much leading zeroes as possible.
The one that resolves it first gets a reward (constantly decreasing).

*** Forks
:PROPERTIES:
:NOTER_PAGE: 12
:END:
When two miners find the same solution at approximately the same time, each block becomes the new head of the blockchain for a network: the blockchain splits.
That's what is called a fork.
When other 6/7 blocks are found, we see which chain they continue and we consider that the "real" chain.

** Pseudo Anonimity
:PROPERTIES:
:NOTER_PAGE: 19
:END:
An identity can have an arbitrary number of addresses, which can be used to split a transaction into multiple ones and make the derivation of the real owner difficult.

But all the transaction data is available, so if you take enough care you can track the flow of a transaction and infer some things:
- most of the times, all the inputs of a transaction are the same user.
- New addresses are usually shadow addresses, made explicitly to cover the traces.

*** How to protect Pseudo Anonimity
The "flow tracking" described above is made difficult by malicious sites by mixing together multiple transactions from different clients. (See Silk Road, as an example).
* DONE Introduction to Digital Forensics
:PROPERTIES:
:NOTER_DOCUMENT: slides/05. Introduction to Digital Forensics.pdf
:NOTER_PAGE: 8
:END:
Forensics: the application of scientific analysis methods to reconstruct evidence.

Digital Forensics: the application of scientific analysis methods to computer systems/digital data/networks to reconstruct evidence.

** Witnesses vs experts
*Witnesses* testify about _what they personally know_. They cannot testify about something they heard from others.
*Experts* can _testify with their scientifical analysis_ even if they where not present.

Experts are witnesses with knowledge, skill, experience or education that can form an opinion.

** Daubert Standard (How to be an Expert Witness)
:PROPERTIES:
:NOTER_PAGE: 3
:END:
The *Daubert Standard* is a _rule of evidence_ regarding the _admissibility of expert witness_ testimonies in the U.S.

In the states where the standard is applied, an expert must:
- have its specialized knowledge be helpful to the trier to understand the evidence
- have his/her testimony rely on sufficient facts/data
- have his/her testimony be *scientifically valid*:
  + Must be the product of reliable principles and methods
  + Such principles and methods must have been reliably applied

