index.html
<div id="outline-container-org751dc5c" class="outline-3">
<h3 id="org751dc5c">Threat dimensions</h3>
<div class="outline-text-3" id="text-org751dc5c">
<p>
Threats can be<br />
</p>
<ul class="org-ul">
<li><b>Generic</b> or <b>Targeted</b>:<br />
<ul class="org-ul">
<li>Generic threats are threats in which we incur for simply being connected to the internet.<br /></li>
<li>Targeted threats are threats that exploit known informations about us.<br /></li>
</ul></li>
<li>Financially or non <b>financially motivated</b>:<br />
<ul class="org-ul">
<li>Financially motivated threats are easy to understand.<br /></li>
<li>Non financially motivated threats can be difficult to understand<br /></li>
</ul></li>
<li><b>Internal</b> or <b>External</b>:<br />
<ul class="org-ul">
<li>Internal threats are put up by some internal figure of the organization itself.<br /></li>
<li>External threats are put up by external figures (like criminals and other organizations).<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org90d2380" class="outline-3">
<h3 id="org90d2380">Gartner quadrant of threats</h3>
<div class="outline-text-3" id="text-org90d2380">
<p>
A table showing some example of the threat categories listed above, with their relative possible financiary motivation level.<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">generic</th>
<th scope="col" class="org-left">targeted</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>internal</b></td>
<td class="org-left">disgruntled employees (no $)</td>
<td class="org-left">dishonest employee ($$$)</td>
</tr>

<tr>
<td class="org-left"><b>external</b></td>
<td class="org-left">criminals ($$$)</td>
<td class="org-left">a variety of attackers ($)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7b81141" class="outline-3">
<h3 id="org7b81141">Internal threats</h3>
<div class="outline-text-3" id="text-org7b81141">
<p>
Internal threats can be countered by contracts and <span class="underline">separation of duties</span>.<br />
They can be of various kind:<br />
</p>
<ul class="org-ul">
<li>Malicious insiders (personal gain)<br /></li>
<li>Inside agents (other organizations)<br /></li>
<li>Emotional employees (revenge)<br /></li>
<li>Reckless employees (self conciousness)<br /></li>
<li>Third party users (other organization&rsquo;s users)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org438f771" class="outline-3">
<h3 id="org438f771">How to manage a cyber attack</h3>
<div class="outline-text-3" id="text-org438f771">
<p>
In cyberspace, private companies defend their own piece of infrastructure by themselves.<br />
When we talk about public or semi-public agencies (see ENI, VODAFONE etc.), what should they do in case of a big scale cyber-attack? Is the jurisdiction of the attack on them or on the nation?<br />
</p>

<p>
The NATO wrote an entire manual (the Tallin Manual) on the policy they think applies to confilcts in cyberspace.<br />
</p>
</div>
</div>
<div id="outline-container-orga982048" class="outline-3">
<h3 id="orga982048">Financially oriented attacks</h3>
<div class="outline-text-3" id="text-orga982048">
<p>
The monetization of the attacks can be either direct or indirect.<br />
</p>
<ul class="org-ul">
<li>Direct monetization: credit card / bank account fraud; ransomware; fake AVs.<br /></li>
<li>Indirect monetization: information gathering; abuse computing resources for other attacks; rent or sell botnets.<br /></li>
</ul>

<p>
The discriminant between the two is whether the money comes directly from the victim or from the use of their computer.<br />
</p>
</div>
</div>
<div id="outline-container-org7288164" class="outline-3">
<h3 id="org7288164">Cybercrime</h3>
<div class="outline-text-3" id="text-org7288164">
<p>
Cybercrime has its own ecosystem, whit producers, enablers (that don&rsquo;t produce the exploits but keep them relevant) and clients<br />
</p>
</div>
<div id="outline-container-org66f466c" class="outline-4">
<h4 id="org66f466c">Identity theft</h4>
<div class="outline-text-4" id="text-org66f466c">
<p>
Identities are stolen because they can be abused.<br />
American SSN is sometimes abused for authentication purposes.<br />
</p>
</div>
</div>
<div id="outline-container-org9d3ec38" class="outline-4">
<h4 id="org9d3ec38">Selling kits</h4>
<div class="outline-text-4" id="text-org9d3ec38">
<p>
Various kinds of kits are sold in the cybercrime ecosystem:<br />
Botnets, exploitation kits, viruses..<br />
</p>

<p>
These are then used for other kinds of crimes.<br />
</p>

<p>
Also, the selling of stolen VISA accounts is common for money laundering and scamming (e.g: the scam of buying plane tickets and sell them to poor people before the real owner of the card blocks the payment).<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a7d11a" class="outline-2">
<h2 id="org3a7d11a">Abuses of cryptocurrency and forensics</h2>
<div class="outline-text-2" id="text-org3a7d11a">
</div>

<div id="outline-container-orgc7b7a48" class="outline-3">
<h3 id="orgc7b7a48">Some informations</h3>
<div class="outline-text-3" id="text-orgc7b7a48">
</div>
<div id="outline-container-orgb8111b4" class="outline-4">
<h4 id="orgb8111b4">Bitcoin wallet</h4>
<div class="outline-text-4" id="text-orgb8111b4">
<ul class="org-ul">
<li>Manage and store keys of you bitcoin addresses<br /></li>
<li>Creates and signs transactions (receive/send BTC)<br /></li>
<li>Track the balance<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8e1cf39" class="outline-4">
<h4 id="org8e1cf39">Bitcoin address</h4>
<div class="outline-text-4" id="text-org8e1cf39">
<p>
String used to receive payments.<br />
You usually want to use more addresses to make people unable to track your movements.<br />
</p>
</div>
</div>

<div id="outline-container-orge372a91" class="outline-4">
<h4 id="orge372a91">Bitcoin mining</h4>
<div class="outline-text-4" id="text-orge372a91">
<p>
&ldquo;Miners&rdquo; compete to solve a complex problem by bruteforce: find the next block of transactions with as much leading zeroes as possible.<br />
The one that resolves it first gets a reward (constantly decreasing).<br />
</p>
</div>
</div>

<div id="outline-container-org0586fbc" class="outline-4">
<h4 id="org0586fbc">Forks</h4>
<div class="outline-text-4" id="text-org0586fbc">
<p>
When two miners find the same solution at approximately the same time, each block becomes the new head of the blockchain for a network: the blockchain splits.<br />
That&rsquo;s what is called a fork.<br />
When other 6/7 blocks are found, we see which chain they continue and we consider that the &ldquo;real&rdquo; chain.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgd17cacc" class="outline-3">
<h3 id="orgd17cacc">Pseudo Anonimity</h3>
<div class="outline-text-3" id="text-orgd17cacc">
<p>
An identity can have an arbitrary number of addresses, which can be used to split a transaction into multiple ones and make the derivation of the real owner difficult.<br />
</p>

<p>
But all the transaction data is available, so if you take enough care you can track the flow of a transaction and infer some things:<br />
</p>
<ul class="org-ul">
<li>most of the times, all the inputs of a transaction are the same user.<br /></li>
<li>New addresses are usually shadow addresses, made explicitly to cover the traces.<br /></li>
</ul>
</div>

<div id="outline-container-org2707bc0" class="outline-4">
<h4 id="org2707bc0">How to protect Pseudo Anonimity</h4>
<div class="outline-text-4" id="text-org2707bc0">
<p>
The &ldquo;flow tracking&rdquo; described above is made difficult by malicious sites by mixing together multiple transactions from different clients. (See Silk Road, as an example).<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org818bf71" class="outline-2">
<h2 id="org818bf71">Introduction to Digital Forensics</h2>
<div class="outline-text-2" id="text-org818bf71">
<p>
Forensics: the application of scientific analysis methods to reconstruct evidence.<br />
</p>

<p>
Digital Forensics: the application of scientific analysis methods to computer systems/digital data/networks to reconstruct evidence.<br />
</p>
</div>

<div id="outline-container-orgb29b603" class="outline-3">
<h3 id="orgb29b603">Witnesses vs experts</h3>
<div class="outline-text-3" id="text-orgb29b603">
<p>
<b>Witnesses</b> testify about <span class="underline">what they personally know</span>. They cannot testify about something they heard from others.<br />
<b>Experts</b> can <span class="underline">testify with their scientifical analysis</span> even if they where not present.<br />
</p>

<p>
Experts are witnesses with knowledge, skill, experience or education that can form an opinion.<br />
</p>
</div>
</div>

<div id="outline-container-orgce2c8c2" class="outline-3">
<h3 id="orgce2c8c2">Daubert Standard (How to be an Expert Witness)</h3>
<div class="outline-text-3" id="text-orgce2c8c2">
<p>
The <b>Daubert Standard</b> is a <span class="underline">rule of evidence</span> regarding the <span class="underline">admissibility of expert witness</span> testimonies in the U.S.<br />
</p>

<p>
In the states where the standard is applied, an expert must:<br />
</p>
<ul class="org-ul">
<li>have its specialized knowledge be helpful to the trier to understand the evidence<br /></li>
<li>have his/her testimony rely on sufficient facts/data<br /></li>
<li>have his/her testimony be <b>scientifically valid</b>:<br />
<ul class="org-ul">
<li>Must be the product of reliable principles and methods<br /></li>
<li>Such principles and methods must have been reliably applied<br /></li>
</ul></li>
</ul>
</div>
