Notes.org
*** Scientific Method
:PROPERTIES:
:NOTER_PAGE: 5
:END:
For a method to be scientific, it must be:
- *Repeatable*
  If the experiment cannot be repeated (e.g: blood drop analysis) it must be detailed enough to be understood fully.
- *Falsifiable*
  If the experiment cannot be confuted, it is not scientific (e.g: statistics cannot be considered scientific)

*** Scientific Test for Daubert
:PROPERTIES:
:NOTER_PAGE: 6
:END:
Factors to consider (not all of these must be simultaneously valid for the method to be considered scientific):
- Wheter the theory or the technique is accepted in the scientific community.
- Wheter it has been subjected to peer review.
- Wheter it has been tested (or can be).
- Wheter the rate of error is acceptable.
- Wheter the research was independent of the litigation[fn:4].

*** Four phases of investigation
:PROPERTIES:
:NOTER_PAGE: 8
:END:

The four phases of an investigation are:
1. The *acquisition* of the sources
2. The *identification* of the evidences
3. The *evaluation* of the evidences
4. The *presentation* of the evidences

* DONE Acquisition
:PROPERTIES:
:NOTER_DOCUMENT: slides/06. Acquisition.pdf
:NOTER_PAGE: 17
:END:
** Acquisition in Italy
:PROPERTIES:
:NOTER_PAGE: 2
:END:
In Italy, it is not requested to provide a report on how the acquisition was made, so the methods now presented will be overkill.

** Brittleness of digital evidence
All digital evidence, if modified, is not *tamper evident*, which means it can be modified without the modification being noticeable afterwards.
There are, though, some procedure to ensure that digital evidence becomes tamper evident.
*** Hashes
:PROPERTIES:
:NOTER_PAGE: 4
:END:
In court it is asked to prove that evidence hasn't been modified, and hashes allow you to validate that.
Its *absence does not mean that the has been modified*.

Remember that we create the hash so that we can create a record of how the evidence looks to be used later. This means that it *must be preserved in another location than the evidence* to ensure it has not been tampered with.

They are not a dogma, and their absence won't be a huge obstacle for the "jury" to surpass.
But they are useful to debunk any accusation of counterfation.

** Typical hw/sw for acquisition
- Hardware:
  + Write blocker
  + external disks (simple copy through a live usb)
  + removable HD enclosures
- Operating system:
  + Live linux distribution image

** Bitstream images
:PROPERTIES:
:NOTER_PAGE: 6
:END:
Usually, by "copying and pasting" we lose some important informations.

We can, instead, make a "bit by bit" clone _of the original media_.

Of this image I want to make a hash, to ensure it's not tampered.

** Acquisition procedure
:PROPERTIES:
:NOTER_PAGE: 7
:END:

- If possible, *disconnect the media*
  + Connect it to an analysis station, with a *write blocker* possibly (not a necessity, you can just confugure correctly your software).
  + compute the hash of the source
  + make a clone of the source and check its hash
- When media _disconnection is not possible_ (soldered memory / raid devices / other constraints)
  + *live boot the system* with a linux distribution (possibly one targeted to forensic analysis)
    - only available if the target is off, though.
      When turning off the target, _pull the plug_. Don't let it have a system shutdown.
  + if the _target is powered on and cannot be turned off_, make sure first to take all the data available in the system, and *work in volatility order*:
    - *disconnect the machine from the network*, if the network is not necessary.
      Done to avoid additional modifications.
    - dump the memory (In linux, there are /dev/mem and /dev/kmem that you may use to acquire the memory of the machine while on).
    - save runtime informations (network, processes etc)
    - make the disk acquisition
- When we think we caught the intruder, we might want to make the analysis "live":
  + check the logs (only usable if they are on a different machine than the one attacked)
  + check the network traffic (now or never)

The noerror and sync options of dd are used to not make dd stop in case of errors in the device.

The recomputation of the hash of the source and the acquisition image is made to ensure they are the same and that the source has not been modified (by comparing it with the first hash made of the device).

We often use *multiple hashing algorithms* to compute the hash for the same image.
The reason is that someone else who has analized before (or will analyze) the drive might have used a different hashing algorithm.

*** The time problem
Computing the copy of a 1TB hdd/usb key might take some time depending on the interface used by the hdd itself or by the write blocker.
It might take several ours to compute an hash and make a copy of the source.

To avoid the time waste, some softwares may automate part of the procedure by computing the source hash while copyng.

*** The size problem
In large scale investigations (or when multiple investigations are held in parallel), the sizes of the drives might make storing their clones and transfering them a real burden.
Using external media devices is a no-go, since it slows down operations by a lot if you don't use the correct interfaces (USB).

NASs and SANs are used all the times for this specific reason.

*** The encryption problem
In Italy, it might not be required for the persecuted to provide the passcode to decrypt the evidence for the analysis, since it can be seen as *testifying against oneself*.

** Forensics Duplicators
:PROPERTIES:
:NOTER_PAGE: 12
:END:
These perform the hashes and copy the hard drive into one of the others, printing a receipt with all the informations of the process.

* DONE Identification
:PROPERTIES:
:NOTER_DOCUMENT: slides/07. Identification.pdf
:NOTER_PAGE: 22
:END:

** Setup
:PROPERTIES:
:NOTER_PAGE: 2
:END:
The easyest operating system to work on when making forensic analisys is Linux, since it has/can:
- extensive native file system support
- native support for swapping drives
- mounting of disk images as drives

On a linux guest we might keep some windows vms to use soe additional tools.

