index.html

<div id="outline-container-org9f289ff" class="outline-4">
<h4 id="org9f289ff">Scientific Method</h4>
<div class="outline-text-4" id="text-org9f289ff">
<p>
For a method to be scientific, it must be:<br />
</p>
<ul class="org-ul">
<li><b>Repeatable</b><br />
If the experiment cannot be repeated (e.g: blood drop analysis) it must be detailed enough to be understood fully.<br /></li>
<li><b>Falsifiable</b><br />
If the experiment cannot be confuted, it is not scientific (e.g: statistics cannot be considered scientific)<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org97a4cd8" class="outline-4">
<h4 id="org97a4cd8">Scientific Test for Daubert</h4>
<div class="outline-text-4" id="text-org97a4cd8">
<p>
Factors to consider (not all of these must be simultaneously valid for the method to be considered scientific):<br />
</p>
<ul class="org-ul">
<li>Wheter the theory or the technique is accepted in the scientific community.<br /></li>
<li>Wheter it has been subjected to peer review.<br /></li>
<li>Wheter it has been tested (or can be).<br /></li>
<li>Wheter the rate of error is acceptable.<br /></li>
<li>Wheter the research was independent of the litigation<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org7a7f412" class="outline-4">
<h4 id="org7a7f412">Four phases of investigation</h4>
<div class="outline-text-4" id="text-org7a7f412">
<p>
The four phases of an investigation are:<br />
</p>
<ol class="org-ol">
<li>The <b>acquisition</b> of the sources<br /></li>
<li>The <b>identification</b> of the evidences<br /></li>
<li>The <b>evaluation</b> of the evidences<br /></li>
<li>The <b>presentation</b> of the evidences<br /></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgea1855f" class="outline-2">
<h2 id="orgea1855f">Acquisition</h2>
<div class="outline-text-2" id="text-orgea1855f">
</div>
<div id="outline-container-org3bcd78b" class="outline-3">
<h3 id="org3bcd78b">Acquisition in Italy</h3>
<div class="outline-text-3" id="text-org3bcd78b">
<p>
In Italy, it is not requested to provide a report on how the acquisition was made, so the methods now presented will be overkill.<br />
</p>
</div>
</div>

<div id="outline-container-org25766e1" class="outline-3">
<h3 id="org25766e1">Brittleness of digital evidence</h3>
<div class="outline-text-3" id="text-org25766e1">
<p>
All digital evidence, if modified, is not <b>tamper evident</b>, which means it can be modified without the modification being noticeable afterwards.<br />
There are, though, some procedure to ensure that digital evidence becomes tamper evident.<br />
</p>
</div>
<div id="outline-container-orgebffe78" class="outline-4">
<h4 id="orgebffe78">Hashes</h4>
<div class="outline-text-4" id="text-orgebffe78">
<p>
In court it is asked to prove that evidence hasn&rsquo;t been modified, and hashes allow you to validate that.<br />
Its <b>absence does not mean that the has been modified</b>.<br />
</p>

<p>
Remember that we create the hash so that we can create a record of how the evidence looks to be used later. This means that it <b>must be preserved in another location than the evidence</b> to ensure it has not been tampered with.<br />
</p>

<p>
They are not a dogma, and their absence won&rsquo;t be a huge obstacle for the &ldquo;jury&rdquo; to surpass.<br />
But they are useful to debunk any accusation of counterfation.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org0278c36" class="outline-3">
<h3 id="org0278c36">Typical hw/sw for acquisition</h3>
<div class="outline-text-3" id="text-org0278c36">
<ul class="org-ul">
<li>Hardware:<br />
<ul class="org-ul">
<li>Write blocker<br /></li>
<li>external disks (simple copy through a live usb)<br /></li>
<li>removable HD enclosures<br /></li>
</ul></li>
<li>Operating system:<br />
<ul class="org-ul">
<li>Live linux distribution image<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4808a8f" class="outline-3">
<h3 id="org4808a8f">Bitstream images</h3>
<div class="outline-text-3" id="text-org4808a8f">
<p>
Usually, by &ldquo;copying and pasting&rdquo; we lose some important informations.<br />
</p>

<p>
We can, instead, make a &ldquo;bit by bit&rdquo; clone <span class="underline">of the original media</span>.<br />
</p>

<p>
Of this image I want to make a hash, to ensure it&rsquo;s not tampered.<br />
</p>
</div>
</div>

<div id="outline-container-org1ac3862" class="outline-3">
<h3 id="org1ac3862">Acquisition procedure</h3>
<div class="outline-text-3" id="text-org1ac3862">
<ul class="org-ul">
<li>If possible, <b>disconnect the media</b><br />
<ul class="org-ul">
<li>Connect it to an analysis station, with a <b>write blocker</b> possibly (not a necessity, you can just confugure correctly your software).<br /></li>
<li>compute the hash of the source<br /></li>
<li>make a clone of the source and check its hash<br /></li>
</ul></li>
<li>When media <span class="underline">disconnection is not possible</span> (soldered memory / raid devices / other constraints)<br />
<ul class="org-ul">
<li><b>live boot the system</b> with a linux distribution (possibly one targeted to forensic analysis)<br />
<ul class="org-ul">
<li>only available if the target is off, though.<br />
When turning off the target, <span class="underline">pull the plug</span>. Don&rsquo;t let it have a system shutdown.<br /></li>
</ul></li>
<li>if the <span class="underline">target is powered on and cannot be turned off</span>, make sure first to take all the data available in the system, and <b>work in volatility order</b>:<br />
<ul class="org-ul">
<li><b>disconnect the machine from the network</b>, if the network is not necessary.<br />
Done to avoid additional modifications.<br /></li>
<li>dump the memory (In linux, there are /dev/mem and /dev/kmem that you may use to acquire the memory of the machine while on).<br /></li>
<li>save runtime informations (network, processes etc)<br /></li>
<li>make the disk acquisition<br /></li>
</ul></li>
</ul></li>
<li>When we think we caught the intruder, we might want to make the analysis &ldquo;live&rdquo;:<br />
<ul class="org-ul">
<li>check the logs (only usable if they are on a different machine than the one attacked)<br /></li>
<li>check the network traffic (now or never)<br /></li>
</ul></li>
</ul>

<p>
The noerror and sync options of dd are used to not make dd stop in case of errors in the device.<br />
</p>

<p>
The recomputation of the hash of the source and the acquisition image is made to ensure they are the same and that the source has not been modified (by comparing it with the first hash made of the device).<br />
</p>

<p>
We often use <b>multiple hashing algorithms</b> to compute the hash for the same image.<br />
The reason is that someone else who has analized before (or will analyze) the drive might have used a different hashing algorithm.<br />
</p>
</div>

<div id="outline-container-orgd92e065" class="outline-4">
<h4 id="orgd92e065">The time problem</h4>
<div class="outline-text-4" id="text-orgd92e065">
<p>
Computing the copy of a 1TB hdd/usb key might take some time depending on the interface used by the hdd itself or by the write blocker.<br />
It might take several ours to compute an hash and make a copy of the source.<br />
</p>

<p>
To avoid the time waste, some softwares may automate part of the procedure by computing the source hash while copyng.<br />
</p>
</div>
</div>

<div id="outline-container-org443f379" class="outline-4">
<h4 id="org443f379">The size problem</h4>
<div class="outline-text-4" id="text-org443f379">
<p>
In large scale investigations (or when multiple investigations are held in parallel), the sizes of the drives might make storing their clones and transfering them a real burden.<br />
Using external media devices is a no-go, since it slows down operations by a lot if you don&rsquo;t use the correct interfaces (USB).<br />
</p>

<p>
NASs and SANs are used all the times for this specific reason.<br />
</p>
</div>
</div>

<div id="outline-container-org8220a8e" class="outline-4">
<h4 id="org8220a8e">The encryption problem</h4>
<div class="outline-text-4" id="text-org8220a8e">
<p>
In Italy, it might not be required for the persecuted to provide the passcode to decrypt the evidence for the analysis, since it can be seen as <b>testifying against oneself</b>.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org1a61924" class="outline-3">
<h3 id="org1a61924">Forensics Duplicators</h3>
<div class="outline-text-3" id="text-org1a61924">
<p>
These perform the hashes and copy the hard drive into one of the others, printing a receipt with all the informations of the process.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org168150a" class="outline-2">
<h2 id="org168150a">Identification</h2>
<div class="outline-text-2" id="text-org168150a">
</div>

<div id="outline-container-orgabf48ba" class="outline-3">
<h3 id="orgabf48ba">Setup</h3>
<div class="outline-text-3" id="text-orgabf48ba">
<p>
The easyest operating system to work on when making forensic analisys is Linux, since it has/can:<br />
</p>
<ul class="org-ul">
<li>extensive native file system support<br /></li>
<li>native support for swapping drives<br /></li>
<li>mounting of disk images as drives<br /></li>
</ul>

<p>
On a linux guest we might keep some windows vms to use soe additional tools.<br />
</p>
</div>
