Notes.org
*** Why not windows
:PROPERTIES:
:NOTER_PAGE: 3
:END:

Windows tampers with drives and *modifies evidence*.
It doesn't support many file systems.

Remember: Some tools are windows only, and as such you cannot use linux for your entire job.
When using these tools inside a vm, be sure that the disk drive is not writable (this is a last resort, you should first try to work on a copy or on a write blocked drive).

Be wary of proprietary and non free software.

*** Repeatibility
:PROPERTIES:
:NOTER_PAGE: 4
:END:

Since any other expert must be able to perform the same experiment, you should *avoid proprietary/paid forensic solutions*.

Moreover, if a machine is subject to a job without fully understanding (or having access to) how the job innerly works, you cannot say that its output represents truly repeatable evidence, since the expert should be (in theory) able to *perform the same analysis by hand*.

**** Law enforcement tools
:PROPERTIES:
:NOTER_PAGE: 4
:END:
Adversarial Investigation tools that *must be left hidden* to the public in order to avoid other people (e.g. criminals) finding ways to circumvent them.

They are /not really fit/ for the job, since to make an analysis scientific the tool shall be used and undestood by other experts.

*** What analysis encompasses
:PROPERTIES:
:NOTER_PAGE: 5
:END:
We will focus on tasks that only happen in forensics, but be careful: forensic analysis encompasses everything you have studied.

** Data Recovery
:PROPERTIES:
:NOTER_PAGE: 6
:END:
One of the most typical tasks of computer forensics

*** Disk Geometry
:PROPERTIES:
:NOTER_PAGE: 10
:END:
The data is read from the tracks on the platters.
The minimum part of the track that can be read is a *Sector*.
The minimum block that can be allocated for a file is a *Cluster*.
A cilinder is the set of tracks that are on the same position (on different platters) on the drive.

When a file is not exactly a multiple of clusters, the operating systems allocates the clusters anyway.

The area that is left between the file end and the end of the last cluster is called "slack space".
This chunk of data contains the *remains of previously deleted stuff*.

If this data is text or otherwise an easily recognizable file format, you can reconstruct (at least a minimal part of) a file.
Zip files, most of images and audio etc. are probably not reconstructable this way, since they rely on headers and other file sections.

But we could check if a file we are seeking for matches with the part in the slack space, to have a partial confirmation.

*** Retrieve data from the File System
:PROPERTIES:
:NOTER_PAGE: 8
:END:

The file system is the equivalent of the index of a series of folders and files.
In each *inode* you have a table of (direct | indirect) pointers to the data blocks that compose the file.

On file deletion, the file system entry is marked as free.
After some time, the file system entry (not the data itself) is freed and, after some more time, the data block might be overwritten.

If we want to access the deleted files, we either:
- *if the file entry was not deleted*: un-mark the file entry in the inode for deletion
- *if the file entry deletion has already taken place*: ignore the inode and look for the block.

*** Carving
:PROPERTIES:
:NOTER_PAGE: 12
:END:
Another method to retrieve data is the carving method, which consists in:
1. Scan the drive as a single bit stream
2. *locate MIME types* of interesting file types
3. consider anything in between as a candidate file.

As the steps above show, carving *doesn't use informations from the file system*.

The problem comes when encryption and/or compression are taken into consideration, where file types cannot be recognized anymore.

*** Free-as-in-beer software tools for data recovery :noexport:
:PROPERTIES:
:NOTER_PAGE: 13
:END:
Sleuthkit is the core (with a cli), Autopsy is the gui.
Autopsy will be used also in [[*Tool analysis: Autopsy][mobile forensics]] to inspect mobile phone images.

** Antiforensic Techniques
:PROPERTIES:
:NOTER_PAGE: 14
:END:
Aimed at circumventing the forensic analyst.
They are called transient when they just deviate the analysis, definitive when they destroy/tamper the evidence.

The *most vunerable phases* are aquisition and identification.

*Transient antiforensics* techniques interfere mostly with identification, but can be detected and reverted/stopped from happening (most of the times).
*Definitive antiforensics* techniques can sometimes be detected, too, but cannot be reverted.
*** Timeline tampering
:PROPERTIES:
:NOTER_PAGE: 17
:END:
A technique that consists in modifying the timestamp of files on the disk to make them appear not correlated one another.
It's a *definitive antiforensics* technique, since the old timestamp is not available anymore.

*** Countering file recovery
:PROPERTIES:
:NOTER_PAGE: 18
:END:
File recovery uses data remnants on the disk, so:
- secure deletion of files
- encryption
- virtual machines
Are all available methods to avoid data to be recovered.
It is a *definitive antiforensics* technique since it destroys (or negates the creation of) the evidence.

The "residual of magnetization" is a file recovery method studied during the 90es.
A 0 written where there was a 0 has a magnetization level slightly different than a 0 written where there was written a 1.
This was never shown to be practical, but it was a reasonable assumption with the technology from the 90es; Nowadays (due to the high density of the bits) it is unusable.

*** Fileless attacks
:PROPERTIES:
:NOTER_PAGE: 19
:END:
No traces are left on the disk at all.
Metasploit has this feature: it injects in memory a DLL.
Thus all traces are lost after the machine is turned off (and turning off is one of the main steps to analyze data.)

*** Filesystem insertion and subversion technologies
:PROPERTIES:
:NOTER_PAGE: 20
:END:
We place the data _where there's no reason to look for it_.
The partition table, for example, has 32KB assigned but, in real use, it occupies 1KB at most.

- Inodes for bad blocks are created by the system to not use them.
  If we manage to pass a good block as a bad one, we get some free real estate.
- You can use directory inodes to, instead, point to data blocks
- We can put data in metadata structures ignored by forensic tools (this method is weak to carving)

It is a *transient antiforensic* technique, since the evidence is hidden and not destroyed.

*** Log tampering
:PROPERTIES:
:NOTER_PAGE: 21
:END:
If an attacker has access to the log files, it can tamper them to insert fake log entries or malicious code (this last option is only useful if they are automatically analyzed).

It is a *transient antiforensics* technique, since the real evidence has not been modified.

