index.html

<div id="outline-container-org56c9f71" class="outline-4">
<h4 id="org56c9f71">Why not windows</h4>
<div class="outline-text-4" id="text-org56c9f71">
<p>
Windows tampers with drives and <b>modifies evidence</b>.<br />
It doesn&rsquo;t support many file systems.<br />
</p>

<p>
Remember: Some tools are windows only, and as such you cannot use linux for your entire job.<br />
When using these tools inside a vm, be sure that the disk drive is not writable (this is a last resort, you should first try to work on a copy or on a write blocked drive).<br />
</p>

<p>
Be wary of proprietary and non free software.<br />
</p>
</div>
</div>

<div id="outline-container-org55587b4" class="outline-4">
<h4 id="org55587b4">Repeatibility</h4>
<div class="outline-text-4" id="text-org55587b4">
<p>
Since any other expert must be able to perform the same experiment, you should <b>avoid proprietary/paid forensic solutions</b>.<br />
</p>

<p>
Moreover, if a machine is subject to a job without fully understanding (or having access to) how the job innerly works, you cannot say that its output represents truly repeatable evidence, since the expert should be (in theory) able to <b>perform the same analysis by hand</b>.<br />
</p>
</div>

<div id="outline-container-org724f159" class="outline-5">
<h5 id="org724f159">Law enforcement tools</h5>
<div class="outline-text-5" id="text-org724f159">
<p>
Adversarial Investigation tools that <b>must be left hidden</b> to the public in order to avoid other people (e.g. criminals) finding ways to circumvent them.<br />
</p>

<p>
They are <i>not really fit</i> for the job, since to make an analysis scientific the tool shall be used and undestood by other experts.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org4df3e9b" class="outline-4">
<h4 id="org4df3e9b">What analysis encompasses</h4>
<div class="outline-text-4" id="text-org4df3e9b">
<p>
We will focus on tasks that only happen in forensics, but be careful: forensic analysis encompasses everything you have studied.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgbb455d0" class="outline-3">
<h3 id="orgbb455d0">Data Recovery</h3>
<div class="outline-text-3" id="text-orgbb455d0">
<p>
One of the most typical tasks of computer forensics<br />
</p>
</div>

<div id="outline-container-orgc452687" class="outline-4">
<h4 id="orgc452687">Disk Geometry</h4>
<div class="outline-text-4" id="text-orgc452687">
<p>
The data is read from the tracks on the platters.<br />
The minimum part of the track that can be read is a <b>Sector</b>.<br />
The minimum block that can be allocated for a file is a <b>Cluster</b>.<br />
A cilinder is the set of tracks that are on the same position (on different platters) on the drive.<br />
</p>

<p>
When a file is not exactly a multiple of clusters, the operating systems allocates the clusters anyway.<br />
</p>

<p>
The area that is left between the file end and the end of the last cluster is called &ldquo;slack space&rdquo;.<br />
This chunk of data contains the <b>remains of previously deleted stuff</b>.<br />
</p>

<p>
If this data is text or otherwise an easily recognizable file format, you can reconstruct (at least a minimal part of) a file.<br />
Zip files, most of images and audio etc. are probably not reconstructable this way, since they rely on headers and other file sections.<br />
</p>

<p>
But we could check if a file we are seeking for matches with the part in the slack space, to have a partial confirmation.<br />
</p>
</div>
</div>

<div id="outline-container-org8503d5b" class="outline-4">
<h4 id="org8503d5b">Retrieve data from the File System</h4>
<div class="outline-text-4" id="text-org8503d5b">
<p>
The file system is the equivalent of the index of a series of folders and files.<br />
In each <b>inode</b> you have a table of (direct | indirect) pointers to the data blocks that compose the file.<br />
</p>

<p>
On file deletion, the file system entry is marked as free.<br />
After some time, the file system entry (not the data itself) is freed and, after some more time, the data block might be overwritten.<br />
</p>

<p>
If we want to access the deleted files, we either:<br />
</p>
<ul class="org-ul">
<li><b>if the file entry was not deleted</b>: un-mark the file entry in the inode for deletion<br /></li>
<li><b>if the file entry deletion has already taken place</b>: ignore the inode and look for the block.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgc679368" class="outline-4">
<h4 id="orgc679368">Carving</h4>
<div class="outline-text-4" id="text-orgc679368">
<p>
Another method to retrieve data is the carving method, which consists in:<br />
</p>
<ol class="org-ol">
<li>Scan the drive as a single bit stream<br /></li>
<li><b>locate MIME types</b> of interesting file types<br /></li>
<li>consider anything in between as a candidate file.<br /></li>
</ol>

<p>
As the steps above show, carving <b>doesn&rsquo;t use informations from the file system</b>.<br />
</p>

<p>
The problem comes when encryption and/or compression are taken into consideration, where file types cannot be recognized anymore.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga5132e2" class="outline-3">
<h3 id="orga5132e2">Antiforensic Techniques</h3>
<div class="outline-text-3" id="text-orga5132e2">
<p>
Aimed at circumventing the forensic analyst.<br />
They are called transient when they just deviate the analysis, definitive when they destroy/tamper the evidence.<br />
</p>

<p>
The <b>most vunerable phases</b> are aquisition and identification.<br />
</p>

<p>
<b>Transient antiforensics</b> techniques interfere mostly with identification, but can be detected and reverted/stopped from happening (most of the times).<br />
<b>Definitive antiforensics</b> techniques can sometimes be detected, too, but cannot be reverted.<br />
</p>
</div>
<div id="outline-container-org3bfb7f8" class="outline-4">
<h4 id="org3bfb7f8">Timeline tampering</h4>
<div class="outline-text-4" id="text-org3bfb7f8">
<p>
A technique that consists in modifying the timestamp of files on the disk to make them appear not correlated one another.<br />
It&rsquo;s a <b>definitive antiforensics</b> technique, since the old timestamp is not available anymore.<br />
</p>
</div>
</div>

<div id="outline-container-org8e7e8a8" class="outline-4">
<h4 id="org8e7e8a8">Countering file recovery</h4>
<div class="outline-text-4" id="text-org8e7e8a8">
<p>
File recovery uses data remnants on the disk, so:<br />
</p>
<ul class="org-ul">
<li>secure deletion of files<br /></li>
<li>encryption<br /></li>
<li>virtual machines<br /></li>
</ul>
<p>
Are all available methods to avoid data to be recovered.<br />
It is a <b>definitive antiforensics</b> technique since it destroys (or negates the creation of) the evidence.<br />
</p>

<p>
The &ldquo;residual of magnetization&rdquo; is a file recovery method studied during the 90es.<br />
A 0 written where there was a 0 has a magnetization level slightly different than a 0 written where there was written a 1.<br />
This was never shown to be practical, but it was a reasonable assumption with the technology from the 90es; Nowadays (due to the high density of the bits) it is unusable.<br />
</p>
</div>
</div>

<div id="outline-container-org567abb8" class="outline-4">
<h4 id="org567abb8">Fileless attacks</h4>
<div class="outline-text-4" id="text-org567abb8">
<p>
No traces are left on the disk at all.<br />
Metasploit has this feature: it injects in memory a DLL.<br />
Thus all traces are lost after the machine is turned off (and turning off is one of the main steps to analyze data.)<br />
</p>
</div>
</div>

<div id="outline-container-org720ee76" class="outline-4">
<h4 id="org720ee76">Filesystem insertion and subversion technologies</h4>
<div class="outline-text-4" id="text-org720ee76">
<p>
We place the data <span class="underline">where there&rsquo;s no reason to look for it</span>.<br />
The partition table, for example, has 32KB assigned but, in real use, it occupies 1KB at most.<br />
</p>

<ul class="org-ul">
<li>Inodes for bad blocks are created by the system to not use them.<br />
If we manage to pass a good block as a bad one, we get some free real estate.<br /></li>
<li>You can use directory inodes to, instead, point to data blocks<br /></li>
<li>We can put data in metadata structures ignored by forensic tools (this method is weak to carving)<br /></li>
</ul>

<p>
It is a <b>transient antiforensic</b> technique, since the evidence is hidden and not destroyed.<br />
</p>
</div>
</div>

<div id="outline-container-org5865ce1" class="outline-4">
<h4 id="org5865ce1">Log tampering</h4>
<div class="outline-text-4" id="text-org5865ce1">
<p>
If an attacker has access to the log files, it can tamper them to insert fake log entries or malicious code (this last option is only useful if they are automatically analyzed).<br />
</p>

<p>
It is a <b>transient antiforensics</b> technique, since the real evidence has not been modified.<br />
</p>
</div>
</div>
