Notes.org
*** Patition table tampering
:PROPERTIES:
:NOTER_PAGE: 22
:END:
- If a partition is not correctly aligned, the OS (Windows) might still use it, while forensic tools might miss them.
- Normally, there is only one extendend partition per disk. Windows and Linux can manage multiple extended partitions, but forensic analysis tools might not support them.
- A high number of logical partitions in an extended one might bring the tool to crash.
  The case was with NCase, 15 years ago. It supported at most 26 partitions (one for each letter of the alphabet).

This, too, is a *transient antiforensics* technique, since the data that composes the evidence is not altered.

* DONE SSD forensics
:PROPERTIES:
:NOTER_DOCUMENT: slides/08. SSD-forensics.pdf
:NOTER_PAGE: 46
:END:
SSDs are based on NAND based flash memory, widely used in mobile devices.
** FTL
:PROPERTIES:
:NOTER_PAGE: 5
:END:
In order to write on nand, you need to blank the block completely.
FTL (flash translation layer) chips are devices used to optimize the access to the SSD
Functionalities:
- Caching
  Avoid blanking a block with one single bit flipped
- Trimming
  When the drive is idle, start trimming (clearing) blocks. It depends on the operating system to tell which blocks to trim.
- Garbage Collection
  An advanced form of trimming not dependent on the OS
- Data compression
  Avoid writing multiple blocks when possible
- Bad block handling
  When a cell is about to fail, the ssd should stop using it
- Wear leveling
  When we have a cell that has been written many times, we try to move on it static data.

Since the FTL decides how to compress and obfuscate data and shuffles it (for wear leveling, even when the OS isn't running), it is the only one with the knowledge of the mapping between the logical structure of the data seen by the OS and the physical layout.

The FTL cannot be disabled via software. You can read the chips with external tools (extremely difficult), risking the destruction of the drive.

The FTL, moreover, is not standard: It is the main difference between different vendors (chips are usually the same) and, as such, they are intellectual property that they try to protect.

** Tests
A set of tests was developed to assess the impacts of FTL on the use of black-box tools.
*** Trimming
:PROPERTIES:
:NOTER_PAGE: 20
:END:
Trim activates after a second of the drive being IDLE, and it is very aggressive.
After ten second from the erase of the drive, it will be completely empties (looking through the FTL).

*** Garbage Collection
:PROPERTIES:
:NOTER_PAGE: 23
:END:
We didn't find Garbage collection of the drives.

*** Erasing patterns
:PROPERTIES:
:NOTER_PAGE: 26
:END:
Certain SSD controllers exhibit unexpected trimming patterns.

*** Compression
:PROPERTIES:
:NOTER_PAGE: 29
:END:
Files with High entropy (that cannot be compressed) will take more time to be written

*** Wear Leveling
:PROPERTIES:
:NOTER_PAGE: 32
:END:
We thought that wear leveling, since it would make shadow copies of the files, could help the forensic analysis. It does not.

*** Reults on file recoverability
:PROPERTIES:
:NOTER_PAGE: 35
:END:
Very detrimental. If TRIM is active, it's quite difficult to recover any file.

** Conclusions
:PROPERTIES:
:NOTER_PAGE: 40
:END:
For forensics analysts, SSD are a pain in the arse.
We can say that SSDs have an "intrinsic" secure deletion system.
* DONE Evaluation and presentation
:PROPERTIES:
:NOTER_DOCUMENT: slides/09. Evaluation and presentation.pdf
:NOTER_PAGE: 18
:END:
These phases are tightly coupled with experience and are difficult to teach generally.

** Evaluation phase
:PROPERTIES:
:NOTER_PAGE: 2
:END:
Consists in *matching the evidence elements with the required legal elements to support/negate a legal theory*.

The experts and the lawyer sit down and share their expertise, trying to match the requirements to negate or confirm an allegation.

The judge will analyze what can be said now, what cannot be said and what are the other possible experiments to find something new.
But sometimes, showing a feasible experiment to the jury can be detrimental to our own cause; There is a *risk* associated with each experiment we make.

Very often, expert witnesses work on the results of other experts (not on the evidence itself).

*** The relationship with lawyers, customers and prosecutor/police
:PROPERTIES:
:NOTER_PAGE: 4
:END:
The important thing to remember is that: "unless you are a police officer, you are not a policeman". It's *not your duty to punish* someone.
Unless you are a lawyer, it's *not your duty to protect* people either (even though lawyers and customers pay your bills).
You may be asked by the lawyer to omit a finding though (as long as it's not the same as lying).

You should never compromise the trust of the customer in their lawyer.

The process truth is not the same as historical truth: The law may not support incriminating someone that may be guilty historically.

It is super important to stick to facts and science, we're *not fighting for justice*, and your thoughts must not be shaped by it.

In Italy, a super-partes kind of experts are available: the judge experts, requested by the judge to review the evidence.

*** Analyzing the documents
:PROPERTIES:
:NOTER_PAGE: 7
:END:
You always need to analyze what can be said and /what can not/, possibly specifying *what further experiments would be needed* to say more.

This last analysis must be perfomed to be prepared on what experiments the counterpart will perform and what will be the repercussions if out part asks to make such experiments.

It's also very important to *review previous documents and evidences*, to look for technical/factual errors, suggestive writing and opinions treated as facts.

** Presentation phase
During the presentatiion phase, all experts must testify with objective facts (without interpretation or twisting) but they are not required to be completely non-sided to the matter (so they might want to avoid certain tests etc.)
But be wary, since omission of truth is persecutable in Italy *experts cannot*, when asked, *claim professional secrecy*.

After each analysis, the expert is asked a series of question called "quesito peritale". One of the question is "riferisca quant'altro può essere utile ai fini di giustizia".
This implies that, should you find another crime evidence during your analysis, you are forced to say so.

