index.html

<div id="outline-container-orgb3c12fe" class="outline-4">
<h4 id="orgb3c12fe">Patition table tampering</h4>
<div class="outline-text-4" id="text-orgb3c12fe">
<ul class="org-ul">
<li>If a partition is not correctly aligned, the OS (Windows) might still use it, while forensic tools might miss them.<br /></li>
<li>Normally, there is only one extendend partition per disk. Windows and Linux can manage multiple extended partitions, but forensic analysis tools might not support them.<br /></li>
<li>A high number of logical partitions in an extended one might bring the tool to crash.<br />
The case was with NCase, 15 years ago. It supported at most 26 partitions (one for each letter of the alphabet).<br /></li>
</ul>

<p>
This, too, is a <b>transient antiforensics</b> technique, since the data that composes the evidence is not altered.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7c2a8dd" class="outline-2">
<h2 id="org7c2a8dd">SSD forensics</h2>
<div class="outline-text-2" id="text-org7c2a8dd">
<p>
SSDs are based on NAND based flash memory, widely used in mobile devices.<br />
</p>
</div>
<div id="outline-container-org74f3235" class="outline-3">
<h3 id="org74f3235">FTL</h3>
<div class="outline-text-3" id="text-org74f3235">
<p>
In order to write on nand, you need to blank the block completely.<br />
FTL (flash translation layer) chips are devices used to optimize the access to the SSD<br />
Functionalities:<br />
</p>
<ul class="org-ul">
<li>Caching<br />
Avoid blanking a block with one single bit flipped<br /></li>
<li>Trimming<br />
When the drive is idle, start trimming (clearing) blocks. It depends on the operating system to tell which blocks to trim.<br /></li>
<li>Garbage Collection<br />
An advanced form of trimming not dependent on the OS<br /></li>
<li>Data compression<br />
Avoid writing multiple blocks when possible<br /></li>
<li>Bad block handling<br />
When a cell is about to fail, the ssd should stop using it<br /></li>
<li>Wear leveling<br />
When we have a cell that has been written many times, we try to move on it static data.<br /></li>
</ul>

<p>
Since the FTL decides how to compress and obfuscate data and shuffles it (for wear leveling, even when the OS isn&rsquo;t running), it is the only one with the knowledge of the mapping between the logical structure of the data seen by the OS and the physical layout.<br />
</p>

<p>
The FTL cannot be disabled via software. You can read the chips with external tools (extremely difficult), risking the destruction of the drive.<br />
</p>

<p>
The FTL, moreover, is not standard: It is the main difference between different vendors (chips are usually the same) and, as such, they are intellectual property that they try to protect.<br />
</p>
</div>
</div>

<div id="outline-container-org4c2d085" class="outline-3">
<h3 id="org4c2d085">Tests</h3>
<div class="outline-text-3" id="text-org4c2d085">
<p>
A set of tests was developed to assess the impacts of FTL on the use of black-box tools.<br />
</p>
</div>
<div id="outline-container-org39822ac" class="outline-4">
<h4 id="org39822ac">Trimming</h4>
<div class="outline-text-4" id="text-org39822ac">
<p>
Trim activates after a second of the drive being IDLE, and it is very aggressive.<br />
After ten second from the erase of the drive, it will be completely empties (looking through the FTL).<br />
</p>
</div>
</div>

<div id="outline-container-org0a122db" class="outline-4">
<h4 id="org0a122db">Garbage Collection</h4>
<div class="outline-text-4" id="text-org0a122db">
<p>
We didn&rsquo;t find Garbage collection of the drives.<br />
</p>
</div>
</div>

<div id="outline-container-org7028e59" class="outline-4">
<h4 id="org7028e59">Erasing patterns</h4>
<div class="outline-text-4" id="text-org7028e59">
<p>
Certain SSD controllers exhibit unexpected trimming patterns.<br />
</p>
</div>
</div>

<div id="outline-container-org2ef77d5" class="outline-4">
<h4 id="org2ef77d5">Compression</h4>
<div class="outline-text-4" id="text-org2ef77d5">
<p>
Files with High entropy (that cannot be compressed) will take more time to be written<br />
</p>
</div>
</div>

<div id="outline-container-org803e84e" class="outline-4">
<h4 id="org803e84e">Wear Leveling</h4>
<div class="outline-text-4" id="text-org803e84e">
<p>
We thought that wear leveling, since it would make shadow copies of the files, could help the forensic analysis. It does not.<br />
</p>
</div>
</div>

<div id="outline-container-org366dda9" class="outline-4">
<h4 id="org366dda9">Reults on file recoverability</h4>
<div class="outline-text-4" id="text-org366dda9">
<p>
Very detrimental. If TRIM is active, it&rsquo;s quite difficult to recover any file.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org9cbe367" class="outline-3">
<h3 id="org9cbe367">Conclusions</h3>
<div class="outline-text-3" id="text-org9cbe367">
<p>
For forensics analysts, SSD are a pain in the arse.<br />
We can say that SSDs have an &ldquo;intrinsic&rdquo; secure deletion system.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orge507dbc" class="outline-2">
<h2 id="orge507dbc">Evaluation and presentation</h2>
<div class="outline-text-2" id="text-orge507dbc">
<p>
These phases are tightly coupled with experience and are difficult to teach generally.<br />
</p>
</div>

<div id="outline-container-org76c74d0" class="outline-3">
<h3 id="org76c74d0">Evaluation phase</h3>
<div class="outline-text-3" id="text-org76c74d0">
<p>
Consists in <b>matching the evidence elements with the required legal elements to support/negate a legal theory</b>.<br />
</p>

<p>
The experts and the lawyer sit down and share their expertise, trying to match the requirements to negate or confirm an allegation.<br />
</p>

<p>
The judge will analyze what can be said now, what cannot be said and what are the other possible experiments to find something new.<br />
But sometimes, showing a feasible experiment to the jury can be detrimental to our own cause; There is a <b>risk</b> associated with each experiment we make.<br />
</p>

<p>
Very often, expert witnesses work on the results of other experts (not on the evidence itself).<br />
</p>
</div>

<div id="outline-container-org3f5b9f4" class="outline-4">
<h4 id="org3f5b9f4">The relationship with lawyers, customers and prosecutor/police</h4>
<div class="outline-text-4" id="text-org3f5b9f4">
<p>
The important thing to remember is that: &ldquo;unless you are a police officer, you are not a policeman&rdquo;. It&rsquo;s <b>not your duty to punish</b> someone.<br />
Unless you are a lawyer, it&rsquo;s <b>not your duty to protect</b> people either (even though lawyers and customers pay your bills).<br />
You may be asked by the lawyer to omit a finding though (as long as it&rsquo;s not the same as lying).<br />
</p>

<p>
You should never compromise the trust of the customer in their lawyer.<br />
</p>

<p>
The process truth is not the same as historical truth: The law may not support incriminating someone that may be guilty historically.<br />
</p>

<p>
It is super important to stick to facts and science, we&rsquo;re <b>not fighting for justice</b>, and your thoughts must not be shaped by it.<br />
</p>

<p>
In Italy, a super-partes kind of experts are available: the judge experts, requested by the judge to review the evidence.<br />
</p>
</div>
</div>

<div id="outline-container-org3b933f0" class="outline-4">
<h4 id="org3b933f0">Analyzing the documents</h4>
<div class="outline-text-4" id="text-org3b933f0">
<p>
You always need to analyze what can be said and <i>what can not</i>, possibly specifying <b>what further experiments would be needed</b> to say more.<br />
</p>

<p>
This last analysis must be perfomed to be prepared on what experiments the counterpart will perform and what will be the repercussions if out part asks to make such experiments.<br />
</p>

<p>
It&rsquo;s also very important to <b>review previous documents and evidences</b>, to look for technical/factual errors, suggestive writing and opinions treated as facts.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org645a622" class="outline-3">
<h3 id="org645a622">Presentation phase</h3>
<div class="outline-text-3" id="text-org645a622">
<p>
During the presentatiion phase, all experts must testify with objective facts (without interpretation or twisting) but they are not required to be completely non-sided to the matter (so they might want to avoid certain tests etc.)<br />
But be wary, since omission of truth is persecutable in Italy <b>experts cannot</b>, when asked, <b>claim professional secrecy</b>.<br />
</p>

<p>
After each analysis, the expert is asked a series of question called &ldquo;quesito peritale&rdquo;. One of the question is &ldquo;riferisca quant&rsquo;altro pu essere utile ai fini di giustizia&rdquo;.<br />
This implies that, should you find another crime evidence during your analysis, you are forced to say so.<br />
</p>
</div>
