Notes.org
*** Typical errors found in reports and analyses and presentation errors
:PROPERTIES:
:NOTER_PAGE: 8
:END:
If the theory is that "a supernatural/incredibly powerful being did something" and that cannot be confuted, it is a "trojan defense".
(You can never exclude a trojan virus that deletes itself put the files on my computer, but it is not *falsifiable* so not *scientific*)
We can provide additional explanations and alternative theories to these.

Many court cases drag over a long time, so having a good written report (presentation) can be lifesaving to gather back the informations.
The report you signed is the only thing you can bring with you in a court.

**** What to look for
- *Acquisition errors*
  + missing links in the chain of custody
  + missing/mismatched serial numbers
  + errors during hashing/cloning procedures (missing write lockers)
- *Analysis errors*
  + steps where the hash is not verified
  + use of proprietary programs
  + technical mistakes.
- *Presentation errors*
  + the presentation is biased
  + counter examples for an assumption can be found
  + alternative theories not explored

In Italy it is _not enough to demonstrate that an analysis was not conducted under complete observance of the chain of custody_, but if you can raise questions and _show that other results are feasible_ with the same set of informations and another analysis method, you can bring the jury to your side.
That's why, during the presentation phase, you must be meticolous and list all possible counter examples.

On the other side, if you cannot dispute the facts that the opposition is saying about your client, you can dispute their presentation.

*** What to do when your client is in the wrong
You can avoid to present the informations about your client that aren't on your favor.
But if the prosecutor asks, you must respond (unless you "didn't touch" the topic in your analysis)

*** Writing your report
:PROPERTIES:
:NOTER_PAGE: 10
:END:
You want to explain the situation in a simple way, but not a simplistic way.
The judge won't like to be treated like a child, but he will want to understand everything (so all the technical terminology will have to be explained).
You will also have to explain why certain things are relevant.

*** Structure of a report
:PROPERTIES:
:NOTER_PAGE: 11
:END:
Always explain the reasons behind an analysis and its results.

Try to write "obstacles" in the way to get your client sentenced:
- "the opposition did this"
- "By doing this, they actually ruled out this"
- "Even ignoring this, the evidence could be explained better with this"

Always write in the introduction what is your very conclusion.

The conclusion is, most of the times, the only things the judge considers.
Give a fast write up of what was written in the report, then use a strong ending phrase.
*Stay factual*.

** Testimony as a witness
:PROPERTIES:
:NOTER_PAGE: 16
:END:
In many jurisdiction, the expert may be called as a witness or may only just have to submit a report.
In Italy, if you are working in a criminal procedure, you must be called as a witness.

In Italy, you are asked to know you duty as a witness: answer truthfully and not hide anything you know.

** Direct and cross examination
:PROPERTIES:
:NOTER_PAGE: 17
:END:
- *Direct examination*
  you are /first/ called by your side and proceed to a friendly direct examination.
  In this examination you must:
  + be as helpful as possible
  + be as clear as possible (make sure you explain everything to the judge)
  + check previous records of the jusdge to prepare for possible questions

- *Cross examination*
  you are called by the opposing side to testify. This is usually much more difficult than its direct counterpart.
  In this examination you want to:
  + be court if you can, and if you can not be very complex and difficult to understand (you can take you time talking by looking at your report)
  + If a question is positive for your side, be extremely clear and helpful
  + Don't get personal on the things they say and don't get angry

In civil court, witnesses are expected to provide answers to questions that were listed to the judge, in the form of "is it true that..".

