index.html

<div id="outline-container-org19d7ac8" class="outline-4">
<h4 id="org19d7ac8">Typical errors found in reports and analyses and presentation errors</h4>
<div class="outline-text-4" id="text-org19d7ac8">
<p>
If the theory is that &ldquo;a supernatural/incredibly powerful being did something&rdquo; and that cannot be confuted, it is a &ldquo;trojan defense&rdquo;.<br />
(You can never exclude a trojan virus that deletes itself put the files on my computer, but it is not <b>falsifiable</b> so not <b>scientific</b>)<br />
We can provide additional explanations and alternative theories to these.<br />
</p>

<p>
Many court cases drag over a long time, so having a good written report (presentation) can be lifesaving to gather back the informations.<br />
The report you signed is the only thing you can bring with you in a court.<br />
</p>
</div>

<div id="outline-container-org62cf166" class="outline-5">
<h5 id="org62cf166">What to look for</h5>
<div class="outline-text-5" id="text-org62cf166">
<ul class="org-ul">
<li><b>Acquisition errors</b><br />
<ul class="org-ul">
<li>missing links in the chain of custody<br /></li>
<li>missing/mismatched serial numbers<br /></li>
<li>errors during hashing/cloning procedures (missing write lockers)<br /></li>
</ul></li>
<li><b>Analysis errors</b><br />
<ul class="org-ul">
<li>steps where the hash is not verified<br /></li>
<li>use of proprietary programs<br /></li>
<li>technical mistakes.<br /></li>
</ul></li>
<li><b>Presentation errors</b><br />
<ul class="org-ul">
<li>the presentation is biased<br /></li>
<li>counter examples for an assumption can be found<br /></li>
<li>alternative theories not explored<br /></li>
</ul></li>
</ul>

<p>
In Italy it is <span class="underline">not enough to demonstrate that an analysis was not conducted under complete observance of the chain of custody</span>, but if you can raise questions and <span class="underline">show that other results are feasible</span> with the same set of informations and another analysis method, you can bring the jury to your side.<br />
That&rsquo;s why, during the presentation phase, you must be meticolous and list all possible counter examples.<br />
</p>

<p>
On the other side, if you cannot dispute the facts that the opposition is saying about your client, you can dispute their presentation.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3e73b7" class="outline-4">
<h4 id="orgd3e73b7">What to do when your client is in the wrong</h4>
<div class="outline-text-4" id="text-orgd3e73b7">
<p>
You can avoid to present the informations about your client that aren&rsquo;t on your favor.<br />
But if the prosecutor asks, you must respond (unless you &ldquo;didn&rsquo;t touch&rdquo; the topic in your analysis)<br />
</p>
</div>
</div>

<div id="outline-container-org226cc29" class="outline-4">
<h4 id="org226cc29">Writing your report</h4>
<div class="outline-text-4" id="text-org226cc29">
<p>
You want to explain the situation in a simple way, but not a simplistic way.<br />
The judge won&rsquo;t like to be treated like a child, but he will want to understand everything (so all the technical terminology will have to be explained).<br />
You will also have to explain why certain things are relevant.<br />
</p>
</div>
</div>

<div id="outline-container-orged80e29" class="outline-4">
<h4 id="orged80e29">Structure of a report</h4>
<div class="outline-text-4" id="text-orged80e29">
<p>
Always explain the reasons behind an analysis and its results.<br />
</p>

<p>
Try to write &ldquo;obstacles&rdquo; in the way to get your client sentenced:<br />
</p>
<ul class="org-ul">
<li>&ldquo;the opposition did this&rdquo;<br /></li>
<li>&ldquo;By doing this, they actually ruled out this&rdquo;<br /></li>
<li>&ldquo;Even ignoring this, the evidence could be explained better with this&rdquo;<br /></li>
</ul>

<p>
Always write in the introduction what is your very conclusion.<br />
</p>

<p>
The conclusion is, most of the times, the only things the judge considers.<br />
Give a fast write up of what was written in the report, then use a strong ending phrase.<br />
<b>Stay factual</b>.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org5ba6af5" class="outline-3">
<h3 id="org5ba6af5">Testimony as a witness</h3>
<div class="outline-text-3" id="text-org5ba6af5">
<p>
In many jurisdiction, the expert may be called as a witness or may only just have to submit a report.<br />
In Italy, if you are working in a criminal procedure, you must be called as a witness.<br />
</p>

<p>
In Italy, you are asked to know you duty as a witness: answer truthfully and not hide anything you know.<br />
</p>
</div>
</div>

<div id="outline-container-org6ecac7f" class="outline-3">
<h3 id="org6ecac7f">Direct and cross examination</h3>
<div class="outline-text-3" id="text-org6ecac7f">
<ul class="org-ul">
<li><b>Direct examination</b><br />
you are <i>first</i> called by your side and proceed to a friendly direct examination.<br />
In this examination you must:<br />
<ul class="org-ul">
<li>be as helpful as possible<br /></li>
<li>be as clear as possible (make sure you explain everything to the judge)<br /></li>
<li>check previous records of the jusdge to prepare for possible questions<br /></li>
</ul></li>

<li><b>Cross examination</b><br />
you are called by the opposing side to testify. This is usually much more difficult than its direct counterpart.<br />
In this examination you want to:<br />
<ul class="org-ul">
<li>be court if you can, and if you can not be very complex and difficult to understand (you can take you time talking by looking at your report)<br /></li>
<li>If a question is positive for your side, be extremely clear and helpful<br /></li>
<li>Don&rsquo;t get personal on the things they say and don&rsquo;t get angry<br /></li>
</ul></li>
</ul>

<p>
In civil court, witnesses are expected to provide answers to questions that were listed to the judge, in the form of &ldquo;is it true that..&rdquo;.<br />
</p>
</div>
</div>
</div>
