Notes.org
*** Fraud detection and Fraud prevention
_Fraud detection_ mechanisms recognize fraudolent activities after they have happened (ex-post approach)
They usually provide the analyst with an index risk of fraud, depending on the past transaction (behavior) of the user

_Fraud prevention_ mechanisms avoid or reduce the frauds that will happen (ex-ante approach)

They are *complementary* and *not independent*: if a fraud adapts to a detection mechanism, it will also impact prevention mechanisms and vice-versa.

**** Example of fraud prevention: Strong customer authentication
Two authentication methods are required to make a payment in the European Economic Area.

But each security measure impacts the cost and usability of a system and, for this reason, in this case payments below 30 euros or low risk transactions in general are exempted.
*** Strategies for Fraud detection and prevention
**** Expert-based approach
This approach to fraud analysis is built on the domain knowledge of the fraud analyst.
It involves *manual investigation* of a suspicious case to understand the fraud mechanism.

It may find *new fraud mechanisms*.

They are usually implemented with if-then-else rules engine.
For example: If the amount of claim is above the threshold or if there is a severe accident but no police report etc, then flag it as suspicious.

***** Rule based engines
Rudimental (but quite functional) fraud detection systems, but expensive to build.

They *must be kept secret* from fraudsters, which can learn the rules and circumvent them.
Moreover, new /fraud patterns are not automatically signaled/: you must first make new rules for them.

**** Automated fraud detection systems
An automated system for detecting fraud requires less human involvement and could lead to a more efficient system, *based on data analysis*.
_Expert knowledge remains, in any case, crucial to build the system_.

***** Data driven fraud detection
Based on machine learning.
It is *precise*, due to the increased detection power w.r.t. classic approaches and the massive amount of informations available from previous frauds.
It is *efficient*, because it costs much less to automate the analysis than expert-based fraud detection systems.

*** Fraud management
When a fraud is detected, it must be
 - *corrected*, by providing a compensation for example. Note that you can be required to look at the past to be sure it didn't happen before.
 - *prevented* from happening again.

 A fraud becomes easier to detect the more time has passed, due to copycats using the same fraud over and over.

** Frauds as a dynamic phenomenon
Frauds remain hard and complex to detect.

A fraudster may think about sending fraudolent transactions that may try to *shift the model of fraud detection systems* of an institution.
Unsupervised learning technique must be still monitored by experts.
** Techniques to detect a fraud automatically
New techniques able to _adapt to new frauds_ are needed.
They can either be
- *Unsupervised learning* (or descriptive) analytics techniques
- *Supervised learning* (or predictive) analytics techniques

*** Unsupervised learning analytics techniques
They do *not require labeled observations*. They learn from past observations by *detecting anomalies*.
They can detect novel fraud patterns.

**** Telecommunication example
I can see a fraud is in act if I see /multiple short calls/, /during night hours/ and /with little time between one another/.
But note that there can be multiple false negatives.

**** Limitations
Unsupervised learning techniques are *prone to deception* by camouflage-like fraud strategies.
They need to be complemented by other tools.

*** Supervised learning techniques
Learn from *labeled* historical observations, where the fraud was exposed.
They can find known alarms that fraudsters cannot hide.

**** Limitations
- Low detection power against new fraud types
- Need a labeled set to learn from

** Developing a fraud detection system
1. Start with an Expert-based rule engine
2. use a unsupervised learning system
3. use a supervised learning system once you have build your labeled history
The exact order of adoption depends from case to case.

** Social Network Analysis
Extends the abilities of fraud detection systems by detecting _characteristics of frauds between linked entities_.

** Fraud management cycle
you have to put together the following steps:
1. fraud *detection* : applying detection models on new observations
2. fraud *investigation* : human expert investigates on a flagged fraud
3. fraud *confirmation* : determining the kind (label) of fraud
4. fraud *prevention* : preventing frauds to be committed in the future by marking them as frauds faster and faster.
5. Finally, you need to put an *automated detection algorithm* to create and update the detection model with the confirmed frauds.

*** Regular update of the model
The *frequency* of update of your model depends on:
- the _volatility_ of the fraud behavior
- the _detection power_ of the model
- amount of _similar confirmed case available_
- the _rate of new cases_ being confirmed
- the _required effort_ to retain the model

**** Reinforcement learning
Instead of waiting for a window to update the model, continuously update it as soon as new data is available.
*** Example: Credit card fraud
*Outlier detection* is made by analyzing clusters of common transaction based on position and time.
If a transaction happens outside of a group (it's an outlier), they might be a fraud.

Users are analyzed in the same way at a system level, based on their age and income.
An outlier might be a fraudster or a victim.

** Fraud analytical process
How to develop a *fraud analysis model*.

The process is split in three main parts:
- preprocessing (the most important and time consuming)
  The performance of your model will strictly depend on this step.
- analytics
- post processing

