index.html

<div id="outline-container-orge9f3d5b" class="outline-4">
<h4 id="orge9f3d5b">Fraud detection and Fraud prevention</h4>
<div class="outline-text-4" id="text-orge9f3d5b">
<p>
<span class="underline">Fraud detection</span> mechanisms recognize fraudolent activities after they have happened (ex-post approach)<br />
They usually provide the analyst with an index risk of fraud, depending on the past transaction (behavior) of the user<br />
</p>

<p>
<span class="underline">Fraud prevention</span> mechanisms avoid or reduce the frauds that will happen (ex-ante approach)<br />
</p>

<p>
They are <b>complementary</b> and <b>not independent</b>: if a fraud adapts to a detection mechanism, it will also impact prevention mechanisms and vice-versa.<br />
</p>
</div>

<div id="outline-container-org94ecb1d" class="outline-5">
<h5 id="org94ecb1d">Example of fraud prevention: Strong customer authentication</h5>
<div class="outline-text-5" id="text-org94ecb1d">
<p>
Two authentication methods are required to make a payment in the European Economic Area.<br />
</p>

<p>
But each security measure impacts the cost and usability of a system and, for this reason, in this case payments below 30 euros or low risk transactions in general are exempted.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgb6df3e7" class="outline-4">
<h4 id="orgb6df3e7">Strategies for Fraud detection and prevention</h4>
<div class="outline-text-4" id="text-orgb6df3e7">
</div>
<div id="outline-container-org583254d" class="outline-5">
<h5 id="org583254d">Expert-based approach</h5>
<div class="outline-text-5" id="text-org583254d">
<p>
This approach to fraud analysis is built on the domain knowledge of the fraud analyst.<br />
It involves <b>manual investigation</b> of a suspicious case to understand the fraud mechanism.<br />
</p>

<p>
It may find <b>new fraud mechanisms</b>.<br />
</p>

<p>
They are usually implemented with if-then-else rules engine.<br />
For example: If the amount of claim is above the threshold or if there is a severe accident but no police report etc, then flag it as suspicious.<br />
</p>
</div>

<div id="outline-container-org6f60473" class="outline-6">
<h6 id="org6f60473">Rule based engines</h6>
<div class="outline-text-6" id="text-org6f60473">
<p>
Rudimental (but quite functional) fraud detection systems, but expensive to build.<br />
</p>

<p>
They <b>must be kept secret</b> from fraudsters, which can learn the rules and circumvent them.<br />
Moreover, new <i>fraud patterns are not automatically signaled</i>: you must first make new rules for them.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga726af6" class="outline-5">
<h5 id="orga726af6">Automated fraud detection systems</h5>
<div class="outline-text-5" id="text-orga726af6">
<p>
An automated system consists in a software implementing a mathematical model to recognize frauds. This approach requires less human involvement and could lead to a more efficient system.<br />
<span class="underline">Expert knowledge remains, in any case, crucial to build the system</span>.<br />
</p>
</div>

<div id="outline-container-orgdccf0b0" class="outline-6">
<h6 id="orgdccf0b0">Data driven fraud detection</h6>
<div class="outline-text-6" id="text-orgdccf0b0">
<p>
Based on machine learning.<br />
It is <b>precise</b>, due to the increased detection power w.r.t. classic approaches and the massive amount of informations available from previous frauds.<br />
It is <b>efficient</b>, because it costs much less to automate the analysis than expert-based fraud detection systems.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3732757" class="outline-4">
<h4 id="org3732757">Fraud management</h4>
<div class="outline-text-4" id="text-org3732757">
<p>
When a fraud is detected, it must be<br />
</p>
<ul class="org-ul">
<li><b>corrected</b>, by providing a compensation for example. Note that you can be required to look at the past to be sure it didn&rsquo;t happen before.<br /></li>
<li><b>prevented</b> from happening again.<br /></li>
</ul>

<p>
A fraud becomes easier to detect the more time has passed, due to copycats using the same fraud over and over.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgc215768" class="outline-3">
<h3 id="orgc215768">Techniques to detect a fraud automatically</h3>
<div class="outline-text-3" id="text-orgc215768">
<p>
New techniques able to <span class="underline">adapt to new frauds</span> are needed.<br />
They can either be:<br />
</p>
<ul class="org-ul">
<li><b>Unsupervised learning</b> (or descriptive) analytics techniques<br /></li>
<li><b>Supervised learning</b> (or predictive) analytics techniques<br /></li>
</ul>
</div>

<div id="outline-container-org62e37f2" class="outline-4">
<h4 id="org62e37f2">Unsupervised learning analytics techniques</h4>
<div class="outline-text-4" id="text-org62e37f2">
<p>
They do <b>not require labeled observations</b>. They learn from past observations by <b>detecting anomalies</b>.<br />
They can detect novel fraud patterns.<br />
</p>
</div>

<div id="outline-container-orgd9049bf" class="outline-5">
<h5 id="orgd9049bf">Telecommunication example</h5>
<div class="outline-text-5" id="text-orgd9049bf">
<p>
I can see a fraud is in act if I see <i>multiple short calls</i>, <i>during night hours</i> and <i>with little time between one another</i>.<br />
But note that there can be multiple false negatives.<br />
</p>
</div>
</div>

<div id="outline-container-orgf98c81a" class="outline-5">
<h5 id="orgf98c81a">Limitations</h5>
<div class="outline-text-5" id="text-orgf98c81a">
<p>
Unsupervised learning techniques are <b>prone to deception</b> by camouflage-like fraud strategies.<br />
They need to be complemented by other tools.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga782505" class="outline-4">
<h4 id="orga782505">Supervised learning techniques</h4>
<div class="outline-text-4" id="text-orga782505">
<p>
Learn from <b>labeled</b> historical observations, where the fraud was exposed.<br />
They can find known alarms that fraudsters cannot hide.<br />
</p>
</div>

<div id="outline-container-orga7fde95" class="outline-5">
<h5 id="orga7fde95">Limitations</h5>
<div class="outline-text-5" id="text-orga7fde95">
<ul class="org-ul">
<li>Low detection power against new fraud types<br /></li>
<li>Need a labeled set to learn from<br /></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd7a7377" class="outline-3">
<h3 id="orgd7a7377">Developing a fraud detection system</h3>
<div class="outline-text-3" id="text-orgd7a7377">
<ol class="org-ol">
<li>Start with an Expert-based rule engine<br /></li>
<li>use a unsupervised learning system<br /></li>
<li>use a supervised learning system once you have build your labeled history<br /></li>
</ol>
<p>
The exact order of adoption depends from case to case.<br />
</p>
</div>
</div>

<div id="outline-container-org4bc0281" class="outline-3">
<h3 id="org4bc0281">Social Network Analysis</h3>
<div class="outline-text-3" id="text-org4bc0281">
<p>
Extends the abilities of fraud detection systems by detecting <span class="underline">characteristics of frauds between linked entities</span>.<br />
</p>
</div>
</div>

<div id="outline-container-org40c9a05" class="outline-3">
<h3 id="org40c9a05">Fraud management cycle</h3>
<div class="outline-text-3" id="text-org40c9a05">
<p>
you have to put together the following steps:<br />
</p>
<ol class="org-ol">
<li>fraud <b>detection</b> : applying detection models on new observations<br /></li>
<li>fraud <b>investigation</b> : human expert investigates on a flagged fraud<br /></li>
<li>fraud <b>confirmation</b> : determining the kind (label) of fraud<br /></li>
<li>fraud <b>prevention</b> : preventing frauds to be committed in the future by marking them as frauds faster and faster.<br /></li>
<li>Finally, you need to put an <b>automated detection algorithm</b> to create and update the detection model with the confirmed frauds.<br /></li>
</ol>
</div>

<div id="outline-container-orge0e761f" class="outline-4">
<h4 id="orge0e761f">Regular update of the model</h4>
<div class="outline-text-4" id="text-orge0e761f">
<p>
The <b>frequency</b> of update of your model depends on:<br />
</p>
<ul class="org-ul">
<li>the <span class="underline">volatility</span> of the fraud behavior<br /></li>
<li>the <span class="underline">detection power</span> of the model<br /></li>
<li>amount of <span class="underline">similar confirmed case available</span><br /></li>
<li>the <span class="underline">rate of new cases</span> being confirmed<br /></li>
<li>the <span class="underline">required effort</span> to retain the model<br /></li>
</ul>
</div>

<div id="outline-container-org5d09181" class="outline-5">
<h5 id="org5d09181">Reinforcement learning</h5>
<div class="outline-text-5" id="text-org5d09181">
<p>
Instead of waiting for a window to update the model, continuously update it as soon as new data is available.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgf196f2f" class="outline-4">
<h4 id="orgf196f2f">Example: Credit card fraud</h4>
<div class="outline-text-4" id="text-orgf196f2f">
<p>
<b>Outlier detection</b> is made by analyzing clusters of common transaction based on position and time.<br />
If a transaction happens outside of a group (it&rsquo;s an outlier), they might be a fraud.<br />
</p>

<p>
Users are analyzed in the same way at a system level, based on their age and income.<br />
An outlier might be a fraudster or a victim.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org9c9624a" class="outline-3">
<h3 id="org9c9624a">Fraud analytical process</h3>
<div class="outline-text-3" id="text-org9c9624a">
<p>
How to develop a <b>fraud analysis model</b>.<br />
</p>

<p>
The process is split in three main parts:<br />
</p>
<ul class="org-ul">
<li>preprocessing (the most important and time consuming)<br />
The performance of your model will strictly depend on this step.<br /></li>
<li>analytics<br /></li>
<li>post processing<br /></li>
</ul>
</div>
