Notes.org
*** Preprocessing
- identify the business problem
- identify the data sources
- select the data
- clean the data (gets rid of inconsistencies)
- transform the data (extract additional informations from the data)

*** Analytics
- Analyze the data. Here the *model is built* based on the data preprocessed.

**** Possible analysis outputs
- Find known easy frauds, that ensure the system is working
- Find unknown patterns, that provide added insight and detection power.

In any case, you're going to work on *clusters*, and will be trying to extract knowledge from them.

*** Post processing phase
Validate the model created with experts.

*** Key characteristics of successful fraud analtics models
To understand if your system is working I must monitor:
- statistical accuracy and significance
  Your system must generalize well and _must not be overfitted to the historical data set_.
- Interpretability
  You can put in place the state of art deep learning approach, but if the result of the analysis cannot be interpreted because the model is too complex (it tells us that a particular case might be a fraud, but it won't say why) it is unuseful.
  Such a non interpretable system is called *black-box*, while a system that can be interpreted is a *white-box* system.
- Operational efficiency
  The time and effort that is required to obtain a result and evaluate it is important, expecially on /real time system/.
*** Fraud management as risk management
  Every time we have to deploy a fraud management system, we must consider
  - the value of the asset we want to protect
  - the vulnerabilities
  - the threats
  - the cost of the system (both direct and _indirect_)
    Indirect costs are mainly
    + less usability for the user
    + slower performance
    + less privacy
    + reduced productivity (users are slower)
    Direct costs are the equipment, its management and its operation.

**** Economical cost
Developing and implementing a fraud-detection model involves a significant cost to an organization.

A cost-benefit analysis to understand the returns on investment that you gain with a fraud detection system.

Moreover, now that the fraud-detection model should go under the _privacy regulations_, it's really difficult to put up a dataset big enough.

** Challenges of developing fraud-detection models
- Dynamic nature of frauds
  As previously seen, fraudsters will keep on trying to beat detection and prevention systems by developing new strategies and methods.
  We will need _adaptive_ models for detection and prevention.
- *Accuracy*
  You don't want to miss on too many frauds, but you want to keep a low false alarm rate.
  All in all, the cost of missing a fraudolent case will probably be higher than marking a legit one as fraudolent.
- *Skewness[fn:1]* of the data
  The number of fraudolent cases is small w.r.t. the number of legit ones.
  An analytical technique might have some difficulties in learning an accurate model.
- *Time efficiency*
  The model must be fast enough to reach a decision (fraudolent or not) in the time window before the next batch of transactions arrive.
- *Big data* management
  The model must be able to deal with massive amounts of data.

** Red flags of frauds
What we want to extract from an analysis are the " _patterns_ " for frauds, to be used as the grounding truth for new fraud detection systems.

This means translating the typical anomalies (called "red flags" here) of each kind of fraud into expert rules (after being documented) for rule based engines.

* DONE Machine Learning for Fraud Detection :Carminati:
:PROPERTIES:
:NOTER_DOCUMENT: slides/04. Machine Learning for Fraud Detection.pdf
:NOTER_PAGE: 137
:END:

In the previous section we focused on the fraud analisys and detection management part, where we studied how to counteract frauds.
Let's now focus on how we can apply machine learning techniques in automatic fraud detection. (the more analytical part).
** Notice
:PROPERTIES:
:NOTER_PAGE: 2
:END:
During the years, many techniques have been developed for fraud detection with ML from different disciplines.
The main focus won't be on the technicalities of these techniques but on the fraud detection perspective.
** Data preprocessing
:PROPERTIES:
:NOTER_PAGE: 3
:END:
This part is where the experts lose 70% of their time.

*** Real data problems
:PROPERTIES:
:NOTER_PAGE: 6
:END:
When you're working on the theory, the more data you have the better.
When we move to the real world though, this sentence is not so true anymore.

The main motivation relies on the phrase "garbage in, garbage out".
It means that, if you have _messy data in your inputs, your analysis will yeld a messy model_.

We need to *filter our data accordingly*. Even the slightest mistake can lead to invalid results.

*** Types of sources
:PROPERTIES:
:NOTER_PAGE: 7
:END:
To fulfill an analysis, you need to know what data sources to acquire from.

Data can be either *structured* (fits neatly in fixed fields) or *unstructured* (like data lakes).

The main objective is to *find correlations between data sources*.

**** Transactional Data
:PROPERTIES:
:NOTER_PAGE: 8
:END:
One kind of data source.
It's composed of structured informations capturing the characteristics of a transaction from a customer.

This kind of data is usually summarized to extract the *RFM value* (recency, frequency and monetary factors):
- the Recency factor focuses on the time passed from a transaction to the one before
- the Frequency factor focuses on the number of transactions made in the past
- the Monetary factorfocuses on the amount of each transaction.

These features can be used individually or jointly, and their interaction can be used to detect frauds.

