index.html

<div id="outline-container-org3e93e03" class="outline-4">
<h4 id="org3e93e03">Preprocessing</h4>
<div class="outline-text-4" id="text-org3e93e03">
<ul class="org-ul">
<li>identify the business problem<br /></li>
<li>identify the data sources<br /></li>
<li>select the data<br /></li>
<li>clean the data (gets rid of inconsistencies)<br /></li>
<li>transform the data (extract additional informations from the data)<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgf6aab1d" class="outline-4">
<h4 id="orgf6aab1d">Analytics</h4>
<div class="outline-text-4" id="text-orgf6aab1d">
<ul class="org-ul">
<li>Analyze the data. Here the <b>model is built</b> based on the data preprocessed.<br /></li>
</ul>
</div>

<div id="outline-container-orge225014" class="outline-5">
<h5 id="orge225014">Possible analysis outputs</h5>
<div class="outline-text-5" id="text-orge225014">
<ul class="org-ul">
<li>Find known easy frauds, that ensure the system is working<br /></li>
<li>Find unknown patterns, that provide added insight and detection power.<br /></li>
</ul>

<p>
In any case, you&rsquo;re going to work on <b>clusters</b>, and will be trying to extract knowledge from them.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgf21a0dd" class="outline-4">
<h4 id="orgf21a0dd">Post processing phase</h4>
<div class="outline-text-4" id="text-orgf21a0dd">
<p>
Validate the model created with experts.<br />
</p>
</div>
</div>

<div id="outline-container-org6fe270e" class="outline-4">
<h4 id="org6fe270e">Key characteristics of successful fraud analtics models</h4>
<div class="outline-text-4" id="text-org6fe270e">
<p>
To understand if your system is working I must monitor:<br />
</p>
<ul class="org-ul">
<li>statistical accuracy and significance<br />
Your system must generalize well and <span class="underline">must not be overfitted to the historical data set</span>.<br /></li>
<li>Interpretability<br />
You can put in place the state of art deep learning approach, but if the result of the analysis cannot be interpreted because the model is too complex (it tells us that a particular case might be a fraud, but it won&rsquo;t say why) it is unuseful.<br />
Such a non interpretable system is called <b>black-box</b>, while a system that can be interpreted is a <b>white-box</b> system.<br /></li>
<li>Operational efficiency<br />
The time and effort that is required to obtain a result and evaluate it is important, expecially on <i>real time system</i>.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8b546b" class="outline-4">
<h4 id="orgb8b546b">Fraud management as risk management</h4>
<div class="outline-text-4" id="text-orgb8b546b">
<p>
Every time we have to deploy a fraud management system, we must consider<br />
</p>
<ul class="org-ul">
<li>the value of the asset we want to protect<br /></li>
<li>the vulnerabilities<br /></li>
<li>the threats<br /></li>
<li><p>
the cost of the system (both direct and <span class="underline">indirect</span>)<br />
Indirect costs are mainly<br />
</p>
<ul class="org-ul">
<li>less usability for the user<br /></li>
<li>slower performance<br /></li>
<li>less privacy<br /></li>
<li>reduced productivity (users are slower)<br /></li>
</ul>
<p>
Direct costs are the equipment, its management and its operation.<br />
</p></li>
</ul>
</div>

<div id="outline-container-org058d449" class="outline-5">
<h5 id="org058d449">Economical cost</h5>
<div class="outline-text-5" id="text-org058d449">
<p>
Developing and implementing a fraud-detection model involves a significant cost to an organization.<br />
</p>

<p>
A cost-benefit analysis to understand the returns on investment that you gain with a fraud detection system.<br />
</p>

<p>
Moreover, now that the fraud-detection model should go under the <span class="underline">privacy regulations</span>, it&rsquo;s really difficult to put up a dataset big enough.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd2a9ab" class="outline-3">
<h3 id="orgdd2a9ab">Challenges of developing fraud-detection models</h3>
<div class="outline-text-3" id="text-orgdd2a9ab">
<ul class="org-ul">
<li>Dynamic nature of frauds<br />
As previously seen, fraudsters will keep on trying to beat detection and prevention systems by developing new strategies and methods.<br />
We will need <span class="underline">adaptive</span> models for detection and prevention.<br /></li>
<li><b>Accuracy</b><br />
You don&rsquo;t want to miss on too many frauds, but you want to keep a low false alarm rate.<br />
All in all, the cost of missing a fraudolent case will probably be higher than marking a legit one as fraudolent.<br /></li>
<li><b>Skewness<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></b> of the data<br />
The number of fraudolent cases is small w.r.t. the number of legit ones.<br />
An analytical technique might have some difficulties in learning an accurate model.<br /></li>
<li><b>Time efficiency</b><br />
The model must be fast enough to reach a decision (fraudolent or not) in the time window before the next batch of transactions arrive.<br /></li>
<li><b>Big data</b> management<br />
The model must be able to deal with massive amounts of data.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3fa72b" class="outline-3">
<h3 id="orgb3fa72b">Red flags of frauds</h3>
<div class="outline-text-3" id="text-orgb3fa72b">
<p>
What we want to extract from an analysis are the &ldquo; <span class="underline">patterns</span> &rdquo; for frauds, to be used as the grounding truth for new fraud detection systems.<br />
</p>

<p>
This means translating the typical anomalies (called &ldquo;red flags&rdquo; here) of each kind of fraud into expert rules (after being documented) for rule based engines.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org2375496" class="outline-2">
<h2 id="org2375496">Machine Learning for Fraud Detection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Carminati">Carminati</span></span></h2>
<div class="outline-text-2" id="text-org2375496">
<p>
In the previous section we focused on the fraud analisys and detection management part, where we studied how to counteract frauds.<br />
Let&rsquo;s now focus on how we can apply machine learning techniques in automatic fraud detection. (the more analytical part).<br />
</p>
</div>
<div id="outline-container-org5d14f9d" class="outline-3">
<h3 id="org5d14f9d">Notice</h3>
<div class="outline-text-3" id="text-org5d14f9d">
<p>
During the years, many techniques have been developed for fraud detection with ML from different disciplines.<br />
The main focus won&rsquo;t be on the technicalities of these techniques but on the fraud detection perspective.<br />
</p>
</div>
</div>

<div id="outline-container-org1329d26" class="outline-3">
<h3 id="org1329d26">Data preprocessing</h3>
<div class="outline-text-3" id="text-org1329d26">
<p>
This part is where the experts lose 70% of their time.<br />
</p>
</div>

<div id="outline-container-org40eafe1" class="outline-4">
<h4 id="org40eafe1">Real data problems</h4>
<div class="outline-text-4" id="text-org40eafe1">
<p>
When you&rsquo;re working on the theory, the more data you have the better.<br />
When we move to the real world though, this sentence is not so true anymore.<br />
</p>

<p>
The main motivation relies on the phrase &ldquo;garbage in, garbage out&rdquo;.<br />
It means that, if you have <span class="underline">messy data in your inputs, your analysis will yeld a messy model</span>.<br />
</p>

<p>
We need to <b>filter our data accordingly</b>. Even the slightest mistake can lead to invalid results.<br />
</p>
</div>
</div>

<div id="outline-container-org72cd758" class="outline-4">
<h4 id="org72cd758">Types of sources</h4>
<div class="outline-text-4" id="text-org72cd758">
<p>
To fulfill an analysis, you need to know what data sources to acquire from.<br />
</p>

<p>
Data can be either <b>structured</b> (fits neatly in fixed fields) or <b>unstructured</b> (like data lakes).<br />
</p>

<p>
The main objective is to <b>find correlations between data sources</b>.<br />
</p>
</div>

<div id="outline-container-orgf91f859" class="outline-5">
<h5 id="orgf91f859">Transactional Data</h5>
<div class="outline-text-5" id="text-orgf91f859">
<p>
The most common kind of data source.<br />
It&rsquo;s composed of structured informations capturing the characteristics of a transaction from a customer.<br />
</p>

<p>
This kind of data is usually summarized to extract the <b>RFM value</b> (recency, frequency and monetary factors):<br />
</p>
<ul class="org-ul">
<li>the Recency factor focuses on the time passed from a transaction to the one before<br /></li>
<li>the Frequency factor focuses on the number of transactions made in the past<br /></li>
<li>the Monetary factorfocuses on the amount of each transaction.<br /></li>
</ul>

<p>
These features can be used individually or jointly, and their interaction can be used to detect frauds.<br />
</p>
</div>
</div>
</div>
