Notes.org
*** Types of data elements
:PROPERTIES:
:NOTER_PAGE: 9
:END:
You can either have continuous data or categorical data:
- *Continuous* data
  data elements are defined on an _interval_ (limited or unlimited) (the amount of a transaction or its timestamp is an example)
- *Categorical* data
  + _Nominal_: data elements that are _limited on a set of values_ without ordering (iban; IP; motivation; region)
  + _Ordinal_: data elements _limited on a set_ _with an ordering_
  + _Binary_: data elements that _can only take two values_.

*** Sampling
:PROPERTIES:
:NOTER_PAGE: 10
:END:
Sampling consists in taking a subset of the dataset available to build our data model.
This step is needed because we need to *generalize* and *model the future*, and to do so we need to *focus more on newer data* (by taking more samples from newer time frames). A good sample must be _representative for the future_.

When selecting a sample, you have to select the optimal time window, with a tradeoff between quantity of data and how recent it is.

Your *average period* (the time window you selected) must also be as unbiased as possible, even if it's not straightforward.

**** Bias example
:PROPERTIES:
:NOTER_PAGE: 13
:END:
In holidays, users change their spending pattern.
Not only that, but also the types of goods bought are different.

Each single month might deviate from the average model.

To mitigate this issue, we can
- build different models /for each month/.
  This is a complex and demanding solution, that does not scale well, but you have an updated and precise model of the customer.
- Sample observations over a period covering a full business cycle and build a single model instead.

Sampling has a direct impact on the fraud detection power.

**** Stratified sampling
:PROPERTIES:
:NOTER_PAGE: 18
:END:
To make a /stratified sample/ means to *keep some properties* (found in the data) *valid* in the sample taken.

When doing sampling, you might want to extract samples taking into consideration:
- a target for an indicator (/bank example/: private customer or company have different variability in their destination ibans; we might want to keep this variability intact after our sampling; /general example/: keep the percentage of fraudolent and non fraudolent transactions the same)
- a variable for a predictor

*** Visual data exploration
:PROPERTIES:
:NOTER_PAGE: 19
:END:
First informal step after sampling.
You basically analyze the distribution of data visually (through charts) to find its properties.

*** Exploratory statistical Analysis
:PROPERTIES:
:NOTER_PAGE: 20
:END:
Some *statistical measurements* (average, standard deviation etc.) can be made on the data to extract some properties.

Some fitting of the distribution of the data can help to understand other characteristics about it.

*** Dealing with missing values
:PROPERTIES:
:NOTER_PAGE: 23
:END:
Missing values can either have been omitted (due to information being non applicable or undisclosed) or simply be missing due to an error.

When an observation with missing values is encountered you can:
- _Replace_ the missing value with a default one.
- _Delete_ it, if the number of missing values is too high.
- _Keep_ the missing values, since they might have a relation with frauds.
  + In this case, it should be tested wether the missing info is related to a variable (e.g: two factor authentication) or not.
    If it's not the case, another of the two methods can be applied.

*** Outliers
:PROPERTIES:
:NOTER_PAGE: 26
:END:
Outliers are extreme values that are dissimilar to the rest of the population.
Some of these values might be legitimate (or they might be the result of invalid observations).
The methods to find them will be described in more depth later on (see the sections on [[*Graphical outliers detection][Outliers detection]])

They can be either:
- _Univariate_, if they are outlying on one dimension.
  *Visual data exploration* is able to find out most of this kind of outliers, through different views (histograms, box plots).
  One additional method is looking at *Z-scores*, an index that measure how many standard deviations an observation lies away from the mean.

- _Multivariate_, if they are outlying on multiple dimensions.
  Other methods (namely fitting regression lines and mahalanobis distance) are used to find this kind of outlying values.

**** Outlier treatment
:PROPERTIES:
:NOTER_PAGE: 36
:END:
If an outlier is an invalid observation, you can treat it as a missing value.
For valid observation, you can impose a range of values that do not modify your mean too much and put the outlier at one of the extremes.

*** When invalid data is not outlying
:PROPERTIES:
:NOTER_PAGE: 37
:END:
Sometimes, invalid values are not outliers though.

For example: a customer with birth date 01/01/1980 and classified as a child is not an outlier (there might be many child customers and many customers born the same day), but it is clearly an invalid value.

To remove such inconsistencies, a set of checks is made to find wether your data is _coherent_ or not.

To impose these checks you need the help of experts.

*** Conclusion on outliers and invalid values
:PROPERTIES:
:NOTER_PAGE: 39
:END:
Every single time you have to treat outliers and invalid values you must be really cautious when using the previous techniques, since these methods will impact the performance of your system (by removing the outliers, for example, you could lose some frauds).

*** Standardization
:PROPERTIES:
:NOTER_PAGE: 40
:END:
Standardizatoin consists in *scaling variables to a similar range*. This step is _heavily affected by outliers_.
You must always use common standardization methods.

*** Categorization
:PROPERTIES:
:NOTER_PAGE: 41
:END:
To confront /[[*Types of data elements][categorical values]]/ , they must first be _transformed_ to reduce their number of categories.
For example, IBANs and IPs could be categorized by their frequency (this process would make them comparable).

*** Variable Selection
:PROPERTIES:
:NOTER_PAGE: 42
:END:
A dataset is composed by hundreds of features.
On a detection model, there are usually 10-15 of them.
Which features to select in a model is a challenging task by itself.

