index.html

<div id="outline-container-org1446013" class="outline-4">
<h4 id="org1446013">Types of data elements</h4>
<div class="outline-text-4" id="text-org1446013">
<p>
You can either have continuous data or categorical data:<br />
</p>
<ul class="org-ul">
<li><b>Continuous</b> data<br />
Data elements are defined on an <span class="underline">interval</span> (limited or unlimited) (the amount of a transaction or its timestamp is an example)<br /></li>
<li><b>Categorical</b> data<br />
<ul class="org-ul">
<li><span class="underline">Nominal</span>: data elements that are <span class="underline">discrete on a set of values</span> without ordering (Ibans; IP; Motivation; Region)<br /></li>
<li><span class="underline">Ordinal</span>: data elements <span class="underline">discrete on a set</span> <span class="underline">with an ordering</span><br /></li>
<li><span class="underline">Binary</span>: data elements that <span class="underline">can only take two values</span>.<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfb3960b" class="outline-4">
<h4 id="orgfb3960b">Sampling</h4>
<div class="outline-text-4" id="text-orgfb3960b">
<p>
Sampling consists in taking a subset of the dataset available to build our data model.<br />
This step is needed because we need to <b>generalize</b> and <b>model the future</b>, and to do so we need to <b>focus more on newer data</b> (by taking more samples from newer time frames). A good sample must be <span class="underline">representative for the future</span>.<br />
</p>

<p>
When selecting a sample, you have to select the optimal time window, with a tradeoff between quantity of data and how recent it is.<br />
</p>

<p>
Your <b>average period</b> (the time window you selected) must also be as unbiased as possible, even if it&rsquo;s not straightforward.<br />
</p>
</div>

<div id="outline-container-org539c853" class="outline-5">
<h5 id="org539c853">Bias example</h5>
<div class="outline-text-5" id="text-org539c853">
<p>
In holidays, users change their spending pattern.<br />
Not only that, but also the types of goods bought are different.<br />
</p>

<p>
Each single month might deviate from the average model.<br />
</p>

<p>
To mitigate this issue, we can<br />
</p>
<ul class="org-ul">
<li>build different models <i>for each month</i>.<br />
This is a complex and demanding solution, that does not scale well, but you have an updated and precise model of the customer.<br /></li>
<li>Sample observations over a period covering a full business cycle and build a single model instead.<br /></li>
</ul>

<p>
Sampling has a direct impact on the fraud detection power.<br />
</p>
</div>
</div>

<div id="outline-container-orgefa4944" class="outline-5">
<h5 id="orgefa4944">Stratified sampling</h5>
<div class="outline-text-5" id="text-orgefa4944">
<p>
To make a <i>stratified sample</i> means to <b>keep some properties</b> (found in the data) <b>valid</b> in the sample taken.<br />
</p>

<p>
When doing sampling, you might want to extract samples taking into consideration:<br />
</p>
<ul class="org-ul">
<li>a target for an indicator (<i>bank example</i>: private customer or company have different variability in their destination ibans; we might want to keep this variability intact after our sampling; <i>general example</i>: keep the percentage of fraudolent and non fraudolent transactions the same)<br /></li>
<li>a variable for a predictor<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcaf0066" class="outline-4">
<h4 id="orgcaf0066">Visual data exploration</h4>
<div class="outline-text-4" id="text-orgcaf0066">
<p>
First informal step after sampling.<br />
You basically analyze the distribution of data visually (through charts) to find its properties.<br />
</p>
</div>
</div>

<div id="outline-container-org6edce12" class="outline-4">
<h4 id="org6edce12">Exploratory statistical Analysis</h4>
<div class="outline-text-4" id="text-org6edce12">
<p>
Some <b>statistical measurements</b> (average, standard deviation etc.) can be made on the data to extract some properties.<br />
</p>

<p>
Some fitting of the distribution of the data can help to understand other characteristics about it.<br />
</p>
</div>
</div>

<div id="outline-container-org2a6c323" class="outline-4">
<h4 id="org2a6c323">Dealing with missing values</h4>
<div class="outline-text-4" id="text-org2a6c323">
<p>
Missing values can either have been omitted (due to information being non applicable or undisclosed) or simply be missing due to an error.<br />
</p>

<p>
When an observation with missing values is encountered you can:<br />
</p>
<ul class="org-ul">
<li><span class="underline">Replace</span> the missing value with a default one.<br /></li>
<li><span class="underline">Delete</span> it, if the number of missing values is too high.<br /></li>
<li><span class="underline">Keep</span> the missing values, since they might have a relation with frauds.<br />
<ul class="org-ul">
<li>In this case, it should be tested wether the missing info is related to a variable (e.g: two factor authentication) or not.<br />
If it&rsquo;s not the case, another of the two methods can be applied.<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9c075f4" class="outline-4">
<h4 id="org9c075f4">Outliers</h4>
<div class="outline-text-4" id="text-org9c075f4">
<p>
Outliers are extreme values that are dissimilar to the rest of the population.<br />
Some of these values might be legitimate (or they might be the result of invalid observations).<br />
The methods to find them will be described in more depth later on (see the sections on <a href="#orgebf4de8">Outliers detection</a>)<br />
</p>

<p>
They can be either:<br />
</p>
<ul class="org-ul">
<li><span class="underline">Univariate</span>, if they are outlying on one dimension.<br />
<b>Visual data exploration</b> is able to find out most of this kind of outliers, through different views (histograms, box plots).<br />
One additional method is looking at <b>Z-scores</b>, an index that measure how many standard deviations an observation lies away from the mean.<br /></li>

<li><span class="underline">Multivariate</span>, if they are outlying on multiple dimensions.<br />
Other methods (namely fitting regression lines and mahalanobis distance) are used to find this kind of outlying values.<br /></li>
</ul>
</div>

<div id="outline-container-orgc79e302" class="outline-5">
<h5 id="orgc79e302">Outlier treatment</h5>
<div class="outline-text-5" id="text-orgc79e302">
<p>
If an outlier is an invalid observation, you can treat it as a missing value.<br />
For valid observation, you can impose a range of values that do not modify your mean too much and put the outlier at one of the extremes.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgdf83fbe" class="outline-4">
<h4 id="orgdf83fbe">When invalid data is not outlying</h4>
<div class="outline-text-4" id="text-orgdf83fbe">
<p>
Sometimes, invalid values are not outliers though.<br />
</p>

<p>
For example: a customer with birth date 01/01/1980 and classified as a child is not an outlier (there might be many child customers and many customers born the same day), but it is clearly an invalid value.<br />
</p>

<p>
To remove such inconsistencies, a set of checks is made to find wether your data is <span class="underline">coherent</span> or not.<br />
</p>

<p>
To impose these checks you need the help of experts.<br />
</p>
</div>
</div>

<div id="outline-container-org01270c4" class="outline-4">
<h4 id="org01270c4">Conclusion on outliers and invalid values</h4>
<div class="outline-text-4" id="text-org01270c4">
<p>
Every single time you have to treat outliers and invalid values you must be really cautious when using the previous techniques, since these methods will impact the performance of your system (by removing the outliers, for example, you could lose some frauds).<br />
</p>
</div>
</div>

<div id="outline-container-org8900808" class="outline-4">
<h4 id="org8900808">Standardization</h4>
<div class="outline-text-4" id="text-org8900808">
<p>
Standardizatoin consists in <b>scaling variables to a similar range</b>. This step is <span class="underline">heavily affected by outliers</span>.<br />
You must always use common standardization methods.<br />
</p>
</div>
</div>

<div id="outline-container-org43789e9" class="outline-4">
<h4 id="org43789e9">Categorization</h4>
<div class="outline-text-4" id="text-org43789e9">
<p>
To confront <i><a href="#org1446013">categorical values</a></i> , they must first be <span class="underline">transformed</span> to reduce their number of categories.<br />
For example, IBANs and IPs could be categorized by their frequency (this process would make them comparable).<br />
</p>
</div>
</div>

<div id="outline-container-org716b566" class="outline-4">
<h4 id="org716b566">Variable Selection</h4>
<div class="outline-text-4" id="text-org716b566">
<p>
A dataset is composed by hundreds of features.<br />
On a detection model, there are usually 10-15 of them.<br />
Which features to select in a model is a challenging task by itself.<br />
</p>
</div>
