Notes.org
**** Filters
:PROPERTIES:
:NOTER_PAGE: 43
:END:
Filters are used to _understand the informations each variable gives to the model_.
They are standardized (pearson correlation, fisher score etc.), but they are not meant to be your only analysis step.

Their main limitation is that you usually work variable by variable, without considering possible correlations between them.

**** Wrapper
Instead of having to select my features at the beginning, I only give in input different set of features and see what the more promising sets are.

**** Principal Components Analysis
:PROPERTIES:
:NOTER_PAGE: 45
:END:
Try to reduce the number of variables by computing new variables, called *principal components*, that are _not correlated one another_ and are _linear correlations of the original variables_ .

This transformation is extremely helpful for your analysis because they keep the informations of the variables while reducing the number of features to analyze.
Moreover, even if they do not reduce the number of variables, they can bring out some more interesting features.

PCA can help to make variables more robust.
But the new variables made might be not as interpretable than the original ones.

*** Example :noexport:
:PROPERTIES:
:NOTER_PAGE: 51
:END:

**** Dataset analysis
:PROPERTIES:
:NOTER_PAGE: 52
:END:
Using Visual data exploration, we can see that
- the amount exchanged and number of transactions are aligned with eachother, meaning that the amount per transaction is somewhat constant.
- There's a gap between march and april
  Our dataset was, in fact, corrupted
The peak on july is due to company closing before vacation, and a lot of duplicates were present.

The amount distribution (next page) shows that the users are unbalanced: the majority of them transfer low amounts of money.

The hierachical clustering (next page) shows us that the majority of the users gets clustered together.

The transaction and fraud distributions (next page) can highlight that the second happen mostly at night. Why so? Because it's more difficult to contact the victims.

The transaction amount distribution between fraudolent and legit transactions is different, too.

** Descriptive analytics for fraud detection
:PROPERTIES:
:NOTER_PAGE: 58
:END:
*Unsupervised learning techniques* are used to _find anomalies_ deviating from the norm. The main challenge is defining the norm; To do so, we use *descriptive analytics*.
Two possibilities (with different levels of granularity):
- Behavior of the average customer (global perspective)
- average behavior of a given customer (local perspective)

The *supervised learning technique* (based on /predictive analytics/), on the other hand, assumes you have labels available and can only detect known fraud patterns.
Besides these limitations, they are usually useful to _understand the anomalies you found_ on unsupervised analyses.

*** Relevant environments for Unsupervised learning
:PROPERTIES:
:NOTER_PAGE: 59
:END:
The use of Unsupervised learning techniques is particularly useful:
- In case of organizations _starting_ to do fraud detection, with no data set available.
- When you have a dataset, but it is not labeled yet (the labeling process might take time).
- When fraud patterns change fast and are not reused commonly.

*** Defining the norm
:PROPERTIES:
:NOTER_PAGE: 60
:END:
/The norm/ *depends on the context* you are analyzing.
It is a boundary (a threshold) that, due to the nature of frauds (continuously changing), will have to adapt.
Moreover, the boundary is not a clear cut: some anomalies might be legit transaction, while some apparently normal transactions might be frauds.

Even if you obtain good results on the tests, you must be able to make your system evolve - and the norm will change with it.

*** Graphical outliers detection
:PROPERTIES:
:NOTER_PAGE: 61
:END:
Ideal tools to explore the data and get preliminary insights.

It has some disadvantages though:
- Unformal.
- Not easily automatable.
- Limited to few dimensions.

*** Statistical outliers detection
:PROPERTIES:
:NOTER_PAGE: 63
:END:
Some statistical methods are applied to detect frauds:
- *Z-score*
  Seen before when we talked about [[*Outliers][outliers]].
- *Break point analysis*
  Detects _intra-account_ (in the same account) frauds
- *Peer group analysis*
  Detects _inter account_ frauds
- *Association rule*
  Detects _single transaction_ frauds
  Belongs mainly to the data mining world.

These techniques are differentiated mainly by the granularity with wich you want to make the analysis.

**** Break point analysis
:PROPERTIES:
:NOTER_PAGE: 64
:END:
Detects sudden changes in the account behavior (called *Break point*).
The method is quite simple:
1. define a fixed time window
2. split the parts into "old" and "new"
3. compare them
   This comparation is usually made with /t-score/, a metric that measures how much (and how fast) a value changed in a time window.

**** Peer Group analysis
:PROPERTIES:
:NOTER_PAGE: 68
:END:
The main goal is to define the _peer group_ (group of *similarly behaving accounts*) of an account.

When the behavior of the target deviates from his peer group, an anomaly is detected.

It is _more computational intensive_ than break point analysis.

Peer group analysis *can help with new accounts*, by approximating their spending profile with their peer group.

The update of the patterns is usually done weekly or monthly, due to the fraudolent pattern changing in a couple of months.


***** Identifying, sizing and comparing a peer group
:PROPERTIES:
:NOTER_PAGE: 69
:END:
To identify a peer group we can use 2 methods:
- exploit business knowledge.
- Define a statistical metric to define the peers

How many peers should you consider?
- few peers: more scalable (the performance loss is quadratic to the number of peers), but sensitive to noise.
- many peers: less scalable, but less sensitive to noide (a group too broad can lead to insensitivity to the deviations).

How do you compare the behavior of the target w.r.t. the peers?
- statistical test
- distance metric

***** Example :noexport:
:PROPERTIES:
:NOTER_PAGE: 70
:END:
Each of the y corresponds to the amount spent by a user in an instance of time.

To understand if a particular expense is anomalous, we:
- identify the peers of the target (in this case graphically)
- compare the behavior of the target wrt its peer group

**** Break point analysis vs peer group analysis
:PROPERTIES:
:NOTER_PAGE: 73
:END:
The two are complementary: you must use both at different times.
E.g. for the holidays, break point analysis performs poorly: people spend more, resulting in an anomaly.
With Peer group analysis, instead, all peers will shift to higher amounts, not causing an anomaly.

Both these analyses, though, will _detect only local modifications_ (local to an account/peer group).

