index.html

<div id="outline-container-orgab3d842" class="outline-5">
<h5 id="orgab3d842">Filters</h5>
<div class="outline-text-5" id="text-orgab3d842">
<p>
Filters are used to <span class="underline">understand the informations each variable gives to the model</span>.<br />
They are standardized (pearson correlation, fisher score etc.), but they are not meant to be your only analysis step.<br />
</p>

<p>
Their main limitation is that you usually work variable by variable, without considering possible correlations between them.<br />
</p>
</div>
</div>

<div id="outline-container-orgf301e2a" class="outline-5">
<h5 id="orgf301e2a">Wrapper</h5>
<div class="outline-text-5" id="text-orgf301e2a">
<p>
Instead of having to select my features at the beginning, I only give in input different set of features and see what the more promising sets are.<br />
</p>
</div>
</div>

<div id="outline-container-org99c4828" class="outline-5">
<h5 id="org99c4828">Principal Components Analysis</h5>
<div class="outline-text-5" id="text-org99c4828">
<p>
Try to reduce the number of variables by computing new variables, called <b>principal components</b>, that are <span class="underline">not correlated one another</span> and are <span class="underline">linear correlations of the original variables</span> .<br />
</p>

<p>
This transformation is extremely helpful for your analysis because they keep the informations of the variables while reducing the number of features to analyze.<br />
Moreover, even if they do not reduce the number of variables, they can bring out some more interesting features.<br />
</p>

<p>
PCA can help to make variables more robust.<br />
But the new variables made might be not as interpretable than the original ones.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7901c40" class="outline-3">
<h3 id="org7901c40">Descriptive analytics for fraud detection (Unsupervised learining techniques)</h3>
<div class="outline-text-3" id="text-org7901c40">
<p>
<b>Unsupervised learning techniques</b> are used to <span class="underline">find anomalies</span> deviating from the norm. The main challenge is defining the norm; To do so, we use <b>descriptive analytics</b>.<br />
Two possibilities (with different levels of granularity):<br />
</p>
<ul class="org-ul">
<li>Behavior of the average customer (global perspective)<br /></li>
<li>average behavior of a given customer (local perspective)<br /></li>
</ul>

<p>
The <b>supervised learning technique</b> (based on <i>predictive analytics</i>), on the other hand, assumes you have labels available and can only detect known fraud patterns.<br />
Besides these limitations, they are usually useful to <span class="underline">understand the anomalies you found</span> on unsupervised analyses.<br />
</p>
</div>

<div id="outline-container-org58676c5" class="outline-4">
<h4 id="org58676c5">Relevant environments for Unsupervised learning</h4>
<div class="outline-text-4" id="text-org58676c5">
<p>
The use of Unsupervised learning techniques is particularly useful:<br />
</p>
<ul class="org-ul">
<li>In case of organizations <span class="underline">starting</span> to do fraud detection, with no data set available.<br /></li>
<li>When you have a dataset, but it is not labeled yet (the labeling process might take time).<br /></li>
<li>When fraud patterns change fast and are not reused commonly.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgcaafb6f" class="outline-4">
<h4 id="orgcaafb6f">Defining the norm</h4>
<div class="outline-text-4" id="text-orgcaafb6f">
<p>
<i>The norm</i> <b>depends on the context</b> you are analyzing.<br />
It is a boundary (a threshold) that, due to the nature of frauds (continuously changing), will have to adapt.<br />
Moreover, the boundary is not a clear cut: some anomalies might be legit transaction, while some apparently normal transactions might be frauds.<br />
</p>

<p>
Even if you obtain good results on the tests, you must be able to make your system evolve - and the norm will change with it.<br />
</p>
</div>
</div>

<div id="outline-container-orgebf4de8" class="outline-4">
<h4 id="orgebf4de8">Graphical outliers detection</h4>
<div class="outline-text-4" id="text-orgebf4de8">
<p>
Ideal tools to explore the data and get preliminary insights.<br />
</p>

<p>
It has some disadvantages though:<br />
</p>
<ul class="org-ul">
<li>Unformal.<br /></li>
<li>Not easily automatable.<br /></li>
<li>Limited to few dimensions.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org32549ab" class="outline-4">
<h4 id="org32549ab">Statistical outliers detection</h4>
<div class="outline-text-4" id="text-org32549ab">
<p>
Some statistical methods are applied to detect frauds:<br />
</p>
<ul class="org-ul">
<li><b>Z-score</b><br />
Seen before when we talked about <a href="#org9c075f4">outliers</a>.<br /></li>
<li><b>Break point analysis</b><br />
Detects <span class="underline">intra-account</span> (in the same account) frauds<br /></li>
<li><b>Peer group analysis</b><br />
Detects <span class="underline">inter account</span> frauds<br /></li>
<li><b>Association rule</b><br />
Detects <span class="underline">single transaction</span> frauds<br />
Belongs mainly to the data mining world.<br /></li>
</ul>

<p>
These techniques are differentiated mainly by the granularity with wich you want to make the analysis.<br />
</p>
</div>

<div id="outline-container-org9d2c7ea" class="outline-5">
<h5 id="org9d2c7ea">Break point analysis</h5>
<div class="outline-text-5" id="text-org9d2c7ea">
<p>
Detects sudden changes in the account behavior (called <b>Break point</b>).<br />
The method is quite simple:<br />
</p>
<ol class="org-ol">
<li>define a fixed time window<br /></li>
<li>split the parts into &ldquo;old&rdquo; and &ldquo;new&rdquo;<br /></li>
<li>compare them<br />
This comparation is usually made with <i>t-score</i>, a metric that measures how much (and how fast) a value changed in a time window.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgbd5db0b" class="outline-5">
<h5 id="orgbd5db0b">Peer Group analysis</h5>
<div class="outline-text-5" id="text-orgbd5db0b">
<p>
The main goal is to define the <span class="underline">peer group</span> (group of <b>similarly behaving accounts</b>) of an account.<br />
</p>

<p>
When the behavior of the target deviates from his peer group, an anomaly is detected.<br />
</p>

<p>
It is <span class="underline">more computational intensive</span> than break point analysis.<br />
</p>

<p>
Peer group analysis <b>can help with new accounts</b>, by approximating their spending profile with their peer group.<br />
</p>

<p>
The update of the patterns is usually done weekly or monthly, due to the fraudolent pattern changing in a couple of months.<br />
</p>
</div>


<div id="outline-container-org5713d01" class="outline-6">
<h6 id="org5713d01">Identifying, sizing and comparing a peer group</h6>
<div class="outline-text-6" id="text-org5713d01">
<p>
To identify a peer group we can use 2 methods:<br />
</p>
<ul class="org-ul">
<li>exploit business knowledge.<br /></li>
<li>Define a statistical metric to define the peers<br /></li>
</ul>

<p>
How many peers should you consider?<br />
</p>
<ul class="org-ul">
<li>few peers: more scalable (the performance loss is quadratic to the number of peers), but sensitive to noise.<br /></li>
<li>many peers: less scalable, but less sensitive to noide (a group too broad can lead to insensitivity to the deviations).<br /></li>
</ul>

<p>
How do you compare the behavior of the target w.r.t. the peers?<br />
</p>
<ul class="org-ul">
<li>statistical test<br /></li>
<li>distance metric<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6e96639" class="outline-5">
<h5 id="org6e96639">Break point analysis vs peer group analysis</h5>
<div class="outline-text-5" id="text-org6e96639">
<p>
The two are complementary: you must use both at different times.<br />
E.g. for the holidays, break point analysis performs poorly: people spend more, resulting in an anomaly.<br />
With Peer group analysis, instead, all peers will shift to higher amounts, not causing an anomaly.<br />
</p>

<p>
Both these analyses, though, will <span class="underline">detect only local modifications</span> (local to an account/peer group).<br />
</p>
</div>
</div>
