Notes.org
**** Association rule analysis
:PROPERTIES:
:NOTER_PAGE: 74
:END:
Detects frequent occurring *relationships between items*.
An association rule is an implication X \Rightarrow Y, where both X and Y are subsets of data from the same set with _no common elements_.
X is called /antecedent/ and Y is called /consequent/.

This kind of analysis was initially used for basket market[fn:2] analysis, to understand which items were bough together.
Supermarkets would decide which items to put near each other in an isle this way.

***** Support

The frequency of an item set is measured by means of its *support*, which is the percentage of total transaction in the database that contains the item set.
\begin{equation*}
support(x): \frac{\text{number of transactions that support } x}{\text{total number of transactions}}
\end{equation*}

Based on this function, we can identify the *frequent item set* , which will be then useful to derive the association rules.

***** Confidence
:PROPERTIES:
:NOTER_PAGE: 81
:END:
Measures the _strength of the association_.
It's defined as the probability of the rule consequent given the rule antecedent.
\begin{equation*}
confidence(x \Rightarrow y): \frac{support(x \cup y)}{support (x)}
\end{equation*}
*** Clustering
:PROPERTIES:
:NOTER_PAGE: 84
:END:
The goal of this analysis method is to *group the observations to find the norm*.
These groups should maximize the _homogeneity between elements in the same group_ and maximize the _etherogeneity between different groups_.

The general idea is that the norm will be characterized by big dense clusters, while anomalies will be small clusters far from the normal ones.

**** Kinds of clusters
:PROPERTIES:
:NOTER_PAGE: 87
:END:
Clusters can be either:
- Hierarchical
  + Agglomerative
  + Divisive
- Nonhierarchical
  + k-means
  + Self Organizing Maps

**** Measure the similarity of elements
:PROPERTIES:
:NOTER_PAGE: 88
:END:
To measure the similarity of elements *distance metrics* are used.
There are many of them and it should be used whichever suits the dataset best.

Euclidean distance is used commonly at the beginning for its simplicity.

**** Hierarchical clustering
:PROPERTIES:
:NOTER_PAGE: 94
:END:
In *divisive clustering* techniques, the dataset is initially considered as a _unique cluster_, to be divided later on.
In *agglomerative clustering* techniques, every element is considered as a _single point cluster_, to be aggregated with other clusters later on.

***** Distance between clusters
:PROPERTIES:
:NOTER_PAGE: 96
:END:
There are different ways to compute the *distance between clusters*, too.
- _single linkage_: select the nearest points of two clusters and compute the distance.
- _complete linkage_: select the farthest points of two clusters and compute the distance.
- _average linkage_: average the distance of all the points of the two clusters.
- _centroid linkage_: compute the distance of the centroid of the two clusters.
- _$d_{ward}$ distance_: compare the difference between the similarity of having the two clusters separated and having the two clusters joined.

Depending on this selection, all your results will be different.

***** Select the number of clusters
:PROPERTIES:
:NOTER_PAGE: 97
:END:
The selection of the number of clusters is *made through visualization*. Two techniques are used:
- _dendograms_: temporal timeline of the construction of your clusters. You can cut the tree at the similarity level you want to have to generate your clusters.
- _screen plot_: plot the distance at which clusters are merged and the number of clusters, then find the "elbow" of the curve: that point is where to stop.

***** Advantages and disadvantages
:PROPERTIES:
:NOTER_PAGE: 99
:END:
Advantages:
- the number of clusters does not need to be specified

Disadvantages:
- the interpretation of the clusters must be made with knowledge of the business logic.
- these techniques do not scale really well with large clusters.

**** Nonhierarchical clustering
:PROPERTIES:
:NOTER_PAGE: 106
:END:

***** k-means
:PROPERTIES:
:NOTER_PAGE: 107
:END:
Follow these steps:
- select k random observations ("seeds") as "centroids" of the clusters you are going to create
  + It is already evident a /problem/: how much is k? You have to choose it beforehand.
- assign each observation to the cluster with the closest centroid
- when all observations are assigned, recalculate the centroids of each cluster and repeat the assignment.
- repeat until the centroids are stable or a limit is reached.

This method is sensitive to outliers.

***** Self organizing maps
:PROPERTIES:
:NOTER_PAGE: 116
:END:
Feed forward neural network with two layers (input and output).
Allows to _visualize and cluster high dimensional nets on 2 layer neural networks_.

Each input is connected to every possible output.
When a training vector X is presented, it is compared to each neuron's training vector.
The most similar neuron is the Best Matching Unit; It and its "neighbors" are "adapted".
The neighbors are defined with a function ($h_{ci}$).

You're technically trying to update the network and aggregate the nearest points to the best matching unit.
As always, you continue until your BMU remains stable or for a fixed number of iteration.

They are quite helpful because:
- Once you have selected the output, they are basically automatic
- They allow you to represent the results you have obtained with two techniques:
  + Unified distance Matrix (also called U-Matrix)
    visualizes the distance between a neuron and its neighbors; Large distances (darker colors) can be interpreted a cluster boundaries.
  + Component plane
    visualizes the contribution of each input attribute to each neuron.

**** Semi-Supervised clustering
:PROPERTIES:
:NOTER_PAGE: 127
:END:
Incorporates background knowledge to guide the clustering, by putting some constraints on how the clusters are formed.
These can be put at different levels:
- observation-level constraints: put constraints between single entities (these entities must/mustn't link together)
- Cluster level constraints: impose a certain level of similarity between the clusters
- other constraints

