index.html

<div id="outline-container-org0f4c293" class="outline-5">
<h5 id="org0f4c293">Association rule analysis</h5>
<div class="outline-text-5" id="text-org0f4c293">
<p>
Detects frequent occurring <b>relationships between items</b>.<br />
An association rule is an implication X &rArr; Y, where both X and Y are subsets of data from the same set with <span class="underline">no common elements</span>.<br />
X is called <i>antecedent</i> and Y is called <i>consequent</i>.<br />
</p>

<p>
This kind of analysis was initially used for basket market<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> analysis, to understand which items were bough together.<br />
Supermarkets would decide which items to put near each other in an isle this way.<br />
</p>
</div>

<div id="outline-container-orgfbe44fe" class="outline-6">
<h6 id="orgfbe44fe">Support</h6>
<div class="outline-text-6" id="text-orgfbe44fe">
<p>
The frequency of an item set is measured by means of its <b>support</b>, which is the percentage of total transaction in the database that contains the item set.<br />
</p>
\begin{equation*}
support(x): \frac{\text{number of transactions that support } x}{\text{total number of transactions}}
\end{equation*}

<p>
Based on this function, we can identify the <b>frequent item set</b> , which will be then useful to derive the association rules.<br />
</p>
</div>
</div>

<div id="outline-container-orga92e0f1" class="outline-6">
<h6 id="orga92e0f1">Confidence</h6>
<div class="outline-text-6" id="text-orga92e0f1">
<p>
Measures the <span class="underline">strength of the association</span>.<br />
It&rsquo;s defined as the probability of the rule consequent given the rule antecedent.<br />
</p>
\begin{equation*}
confidence(x \Rightarrow y): \frac{support(x \cup y)}{support (x)}
\end{equation*}
</div>
</div>
</div>
</div>
<div id="outline-container-org4a1e5dd" class="outline-4">
<h4 id="org4a1e5dd">Clustering</h4>
<div class="outline-text-4" id="text-org4a1e5dd">
<p>
The goal of this analysis method is to <b>group the observations to find the norm</b>.<br />
These groups should maximize the <span class="underline">homogeneity between elements in the same group</span> and maximize the <span class="underline">etherogeneity between different groups</span>.<br />
</p>

<p>
The general idea is that the norm will be characterized by big dense clusters, while anomalies will be small clusters far from the normal ones.<br />
</p>
</div>

<div id="outline-container-org7b83c61" class="outline-5">
<h5 id="org7b83c61">Kinds of clusters</h5>
<div class="outline-text-5" id="text-org7b83c61">
<p>
Clusters can be either:<br />
</p>
<ul class="org-ul">
<li>Hierarchical<br />
<ul class="org-ul">
<li>Agglomerative<br /></li>
<li>Divisive<br /></li>
</ul></li>
<li>Nonhierarchical<br />
<ul class="org-ul">
<li>k-means<br /></li>
<li>Self Organizing Maps<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2ff3eae" class="outline-5">
<h5 id="org2ff3eae">Measure the similarity of elements</h5>
<div class="outline-text-5" id="text-org2ff3eae">
<p>
To measure the similarity of elements <b>distance metrics</b> are used.<br />
There are many of them and it should be used whichever suits the dataset best.<br />
</p>

<p>
Euclidean distance is used commonly at the beginning for its simplicity.<br />
</p>
</div>
</div>

<div id="outline-container-org216a356" class="outline-5">
<h5 id="org216a356">Hierarchical clustering</h5>
<div class="outline-text-5" id="text-org216a356">
<p>
In <b>divisive clustering</b> techniques, the dataset is initially considered as a <span class="underline">unique cluster</span>, to be divided later on.<br />
In <b>agglomerative clustering</b> techniques, every element is considered as a <span class="underline">single point cluster</span>, to be aggregated with other clusters later on.<br />
</p>
</div>

<div id="outline-container-org2705087" class="outline-6">
<h6 id="org2705087">Distance between clusters</h6>
<div class="outline-text-6" id="text-org2705087">
<p>
There are different ways to compute the <b>distance between clusters</b>, too.<br />
</p>
<ul class="org-ul">
<li><span class="underline">single linkage</span>: select the nearest points of two clusters and compute the distance.<br /></li>
<li><span class="underline">complete linkage</span>: select the farthest points of two clusters and compute the distance.<br /></li>
<li><span class="underline">average linkage</span>: average the distance of all the points of the two clusters.<br /></li>
<li><span class="underline">centroid linkage</span>: compute the distance of the centroid of the two clusters.<br /></li>
<li><span class="underline">\(d_{ward}\) distance</span>: compare the difference between the similarity of having the two clusters separated and having the two clusters joined.<br /></li>
</ul>

<p>
Depending on this selection, all your results will be different.<br />
</p>
</div>
</div>

<div id="outline-container-orgf37d193" class="outline-6">
<h6 id="orgf37d193">Select the number of clusters</h6>
<div class="outline-text-6" id="text-orgf37d193">
<p>
The selection of the number of clusters is <b>made through visualization</b>. Two techniques are used:<br />
</p>
<ul class="org-ul">
<li><span class="underline">dendograms</span>: temporal timeline of the construction of your clusters. You can cut the tree at the similarity level you want to have to generate your clusters.<br /></li>
<li><span class="underline">screen plot</span>: plot the distance at which clusters are merged and the number of clusters, then find the &ldquo;elbow&rdquo; of the curve: that point is where to stop.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgdfafae9" class="outline-6">
<h6 id="orgdfafae9">Advantages and disadvantages</h6>
<div class="outline-text-6" id="text-orgdfafae9">
<p>
Advantages:<br />
</p>
<ul class="org-ul">
<li>the number of clusters does not need to be specified<br /></li>
</ul>

<p>
Disadvantages:<br />
</p>
<ul class="org-ul">
<li>the interpretation of the clusters must be made with knowledge of the business logic.<br /></li>
<li>these techniques do not scale really well with large clusters.<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7c34817" class="outline-5">
<h5 id="org7c34817">Nonhierarchical clustering</h5>
<div class="outline-text-5" id="text-org7c34817">
</div>

<div id="outline-container-org344eb45" class="outline-6">
<h6 id="org344eb45">k-means</h6>
<div class="outline-text-6" id="text-org344eb45">
<p>
Follow these steps:<br />
</p>
<ul class="org-ul">
<li>select k random observations (&ldquo;seeds&rdquo;) as &ldquo;centroids&rdquo; of the clusters you are going to create<br />
<ul class="org-ul">
<li>It is already evident a <i>problem</i>: how much is k? You have to choose it beforehand.<br /></li>
</ul></li>
<li>assign each observation to the cluster with the closest centroid<br /></li>
<li>when all observations are assigned, recalculate the centroids of each cluster and repeat the assignment.<br /></li>
<li>repeat until the centroids are stable or a limit is reached.<br /></li>
</ul>

<p>
This method is sensitive to outliers.<br />
</p>
</div>
</div>

<div id="outline-container-org9392580" class="outline-6">
<h6 id="org9392580">Self organizing maps</h6>
<div class="outline-text-6" id="text-org9392580">
<p>
Feed forward neural network with two layers (input and output).<br />
Allows to <span class="underline">visualize and cluster high dimensional nets on 2 layer neural networks</span>.<br />
</p>

<p>
Each input is connected to every possible output.<br />
When a training vector X is presented, it is compared to each neuron&rsquo;s training vector.<br />
The most similar neuron is the Best Matching Unit; It and its &ldquo;neighbors&rdquo; are &ldquo;adapted&rdquo;.<br />
The neighbors are defined with a function (\(h_{ci}\)).<br />
</p>

<p>
You&rsquo;re technically trying to update the network and aggregate the nearest points to the best matching unit.<br />
As always, you continue until your BMU remains stable or for a fixed number of iteration.<br />
</p>

<p>
They are quite helpful because:<br />
</p>
<ul class="org-ul">
<li>Once you have selected the output, they are basically automatic<br /></li>
<li>They allow you to represent the results you have obtained with two techniques:<br />
<ul class="org-ul">
<li>Unified distance Matrix (also called U-Matrix)<br />
visualizes the distance between a neuron and its neighbors; Large distances (darker colors) can be interpreted a cluster boundaries.<br /></li>
<li>Component plane<br />
visualizes the contribution of each input attribute to each neuron.<br /></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge642c8c" class="outline-5">
<h5 id="orge642c8c">Semi-Supervised clustering</h5>
<div class="outline-text-5" id="text-orge642c8c">
<p>
Incorporates background knowledge to guide the clustering, by putting some constraints on how the clusters are formed.<br />
These can be put at different levels:<br />
</p>
<ul class="org-ul">
<li>observation-level constraints: put constraints between single entities (these entities must/mustn&rsquo;t link together)<br /></li>
<li>Cluster level constraints: impose a certain level of similarity between the clusters<br /></li>
<li>other constraints<br /></li>
</ul>
</div>
</div>
