Notes.org
**** One-class SVM
:PROPERTIES:
:NOTER_PAGE: 132
:END:
Try to maximize the distance between norm and anomalies: try to separate theme with a linear hyperplane (the anomalies are then the ones near the origin of your graph).

**** Evaluation of clustering solutions
:PROPERTIES:
:NOTER_PAGE: 134
:END:
There's _no universal criterion_ to evaluate which clustering is better, but a commonly used solution is the *sum of Squared Errors*.

Another one is to analyze them graphically and confront them.

Finally, another one is to train a supervised learning method on the basis of the results of the unsupervised learning one.
The unsupervised one will tell you the clustering, the supervised might lead you to the reasons behind those clusters.

** Predictive analytics for fraud detection
:PROPERTIES:
:NOTER_PAGE: 137
:END:
The aim of these analytics is to build a model to *predict a variable of interest* (it will be called _target variable_ from now on).
The real value that the target assumes from our prediction is then used to steer the learning process.

This target variable is usually a fraud indicator (so the resulting model is trained to recognize frauds); This means it is inherently hard to obtain and determine.

Two kinds of predictive analysis can be distinguished depending on the type of variable we want to predict:
- *Regression*: used for _continuous_ variables (with a possibly unlimited set of values).
- *Classification*: used for _categorical_ variables (but with a limited set of values).

*** Linear regression
One of the many kinds of regression.

The target variable is seen as a combination of *explanatory variables*, with a certain weigth $\beta_{i}$ assigned to each of them that measures the impact of the explanatory variable on the target variable.

These parameters $\beta_{i}$ must be estimated through the _minimization of squared error function_, a function that gives you an indication of how wrong your prediction was w.r.t. the actual value of the target variable.

It has some limitation though:
- The target variable is considered to be a continuous variable normally distributed, but it might not be (for example, it might be a boolean variable with a bernoully distribution)
- We might not have enough informations about the variable to move it to a continuous range (in the bernoulli case covered above, we could interpret it as a probability if we had enough informations about it).

*** Logistic regression
:PROPERTIES:
:NOTER_PAGE: 149
:END:
Another kind of regression.

A *logistic regression* is just the _combination of a linear regression and a bounding function_ (a function that limits the prediction values to a smaller interval).

The parameters of a logistic regression model are estimated using a maximum likelihood optimization.

With a logistic regression model we are able to predict boolean variables, such as a variable that represents the question "/is this observation fraudolent?/".

To decide wether a response is positive or not we use an *activation function*, that maps our obtained prediction (already bounded between 0 and 1 thanks to the bunding function) to a positive or a negative answer.

By training our model through logistic regression on a labeled set, we can find the combinatoin of variables that gives us a response to the question accurately enough.

*** Decision trees
:PROPERTIES:
:NOTER_PAGE: 156
:END:
A classification method of training.
We use a *tree like structure* to _label our observations_.
In the leaf nodes you have the assignment of labels (fraud/not fraud).
In each node you have a testing condition to move to lower nodes.

Decision trees are defined by three "decisions" (/sorry for the play on words/):
1. _splitting decision_ (which variable do we split? at which value?)
2. _stopping decision_ (when do we add a leaf node?)
3. _assignment decision_ (which label do you assign to the group in the current leaf?)

**** Splitting decision
First of all, we define *impurity* as the diversity on our dataset.
When our dataset is composed of half/half (of a specific condition), we have maximal impurity.
When out dataset is composed of only one kind, we have minimal impurity.

The variable to do the splitting decision on is chosen by looking at the _highest reduction of impurity_.

**** Stopping decision
:PROPERTIES:
:NOTER_PAGE: 161
:END:
If we split too much, we tend to _overfit_ (consider, other than the data we are interested in, also noise).

To avoid overfitting and find the best spot to stop splitting, our dataset should be divided in:
- training set (on which we make the splitting decisions)
- validation set (a labeled sample to monitor the misclassification error)
- testing set (a independent sample to test our decision tree)

You can then plot the misclassification error on the validation set wrt the number of tree nodes.
Once the misclassification error is at its minimum, we can then say to stop the creation of new nodes at that point and, instead, start the creation of leaves.

**** Advantages
:PROPERTIES:
:NOTER_PAGE: 166
:END:
Decision trees are useful because they are _easy to build_.
Moreover, they are a _white-box method_: you can convert a decision tree into a set of [[*Rule based engines][decision rules]] easily (the ones that fraud detection expert based systems use), since you have the conditions on each node.

**** Disadvantages
:PROPERTIES:
:NOTER_PAGE: 174
:END:
Decision trees tends to overfit the data, but we could use cross validation to reduce this.

*** Regression trees
:PROPERTIES:
:NOTER_PAGE: 169
:END:
You can also predict continuous targets with decision trees (for example, you can give the /probability/ of a transaction being a fraud) and transform them into a _regression method_.

*** Neural Networks
:PROPERTIES:
:NOTER_PAGE: 176
:END:
Generalization of existing statistical models.
The basic element of a Neural network is the *neuron*: it takes an input, multiplies it by a weight and puts it into a /transformation function/ (can be a logistic regression).

