index.html

<div id="outline-container-org2c61451" class="outline-5">
<h5 id="org2c61451">One-class SVM</h5>
<div class="outline-text-5" id="text-org2c61451">
<p>
Try to maximize the distance between norm and anomalies: try to separate them with a linear hyperplane (the anomalies are then the ones near the origin of your graph).<br />
</p>
</div>
</div>

<div id="outline-container-orgf50953e" class="outline-5">
<h5 id="orgf50953e">Evaluation of clustering solutions</h5>
<div class="outline-text-5" id="text-orgf50953e">
<p>
There&rsquo;s <span class="underline">no universal criterion</span> to evaluate which clustering is better, but a commonly used solution is the <b>sum of Squared Errors</b>.<br />
</p>

<p>
Another one is to analyze them graphically and confront them.<br />
</p>

<p>
Finally, another one is to train a supervised learning method on the basis of the results of the unsupervised learning one.<br />
The unsupervised one will tell you the clustering, the supervised might lead you to the reasons behind those clusters.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf61603f" class="outline-3">
<h3 id="orgf61603f">Predictive analytics for fraud detection (Supervised learining techniques)</h3>
<div class="outline-text-3" id="text-orgf61603f">
<p>
The aim of these analytics is to build a model to <b>predict a variable of interest</b> (it will be called <span class="underline">target variable</span> from now on).<br />
The real value that the target assumes from our prediction is then used to steer the learning process.<br />
</p>

<p>
This target variable is usually a fraud indicator (so the resulting model is trained to recognize frauds); This means it is inherently hard to obtain and determine.<br />
</p>

<p>
Two kinds of predictive analysis can be distinguished depending on the type of variable we want to predict:<br />
</p>
<ul class="org-ul">
<li><b>Regression</b>: used for <span class="underline">continuous</span> variables (with a possibly unlimited set of values).<br /></li>
<li><b>Classification</b>: used for <span class="underline">categorical</span> variables (but with a limited set of values).<br /></li>
</ul>
</div>

<div id="outline-container-org9e68967" class="outline-4">
<h4 id="org9e68967">Linear regression</h4>
<div class="outline-text-4" id="text-org9e68967">
<p>
One of the many kinds of regression.<br />
</p>

<p>
The target variable is seen as a combination of <b>explanatory variables</b>, with a certain weigth \(\beta_{i}\) assigned to each of them that measures the impact of the explanatory variable on the target variable.<br />
</p>

<p>
The weights \(\beta_{i}\) must be estimated through the <span class="underline">minimization of squared error function</span>, a function that gives you an indication of how wrong your prediction was w.r.t. the actual value of the target variable.<br />
</p>

<p>
It has some limitation though:<br />
</p>
<ul class="org-ul">
<li>The target variable is considered to be a continuous variable normally distributed, but it might not be (for example, it might be a boolean variable with a bernoully distribution)<br /></li>
<li>We might not have enough informations about the variable to move it to a continuous range (in the bernoulli case covered above, we could interpret it as a probability if we had enough informations about it).<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8c186d7" class="outline-4">
<h4 id="org8c186d7">Logistic regression</h4>
<div class="outline-text-4" id="text-org8c186d7">
<p>
Another kind of regression.<br />
</p>

<p>
A <b>logistic regression</b> is just the <span class="underline">combination of a linear regression and a bounding function</span> (a function that limits the prediction values to a smaller interval).<br />
</p>

<p>
The parameters of a logistic regression model are estimated using a <b>maximum likelihood</b> optimization.<br />
</p>

<p>
With a logistic regression model we are able to predict boolean variables, such as a variable that represents the question &ldquo;<i>is this observation fraudolent?</i>&rdquo;.<br />
</p>

<p>
To decide wether a response is positive or not we use an <b>activation function</b>, that maps our obtained prediction (already bounded between 0 and 1 thanks to the bunding function) to a positive or a negative answer.<br />
</p>

<p>
By training our model through logistic regression on a labeled set, we can find the combinatoin of variables that gives us a response to the question accurately enough.<br />
</p>
</div>
</div>

<div id="outline-container-orgd08d65d" class="outline-4">
<h4 id="orgd08d65d">Decision trees</h4>
<div class="outline-text-4" id="text-orgd08d65d">
<p>
A classification method of training.<br />
We use a <b>tree like structure</b> to <span class="underline">label our observations</span>.<br />
In the leaf nodes you have the assignment of labels (fraud/not fraud).<br />
In each node you have a testing condition to move to lower nodes.<br />
</p>

<p>
Decision trees are defined by three &ldquo;decisions&rdquo; (<i>sorry for the play on words</i>):<br />
</p>
<ol class="org-ol">
<li><span class="underline">splitting decision</span> (which variable do we split? at which value?)<br /></li>
<li><span class="underline">stopping decision</span> (when do we add a leaf node?)<br /></li>
<li><span class="underline">assignment decision</span> (which label do you assign to the group in the current leaf?)<br /></li>
</ol>
</div>

<div id="outline-container-org9e907f5" class="outline-5">
<h5 id="org9e907f5">Splitting decision</h5>
<div class="outline-text-5" id="text-org9e907f5">
<p>
First of all, we define <b>impurity</b> as the diversity on our dataset.<br />
When our dataset is composed of half/half (of a specific condition), we have maximal impurity.<br />
When out dataset is composed of only one kind, we have minimal impurity.<br />
</p>

<p>
The variable to do the splitting decision on is chosen by looking at the <span class="underline">highest reduction of impurity</span>.<br />
</p>
</div>
</div>

<div id="outline-container-orgc20a03f" class="outline-5">
<h5 id="orgc20a03f">Stopping decision</h5>
<div class="outline-text-5" id="text-orgc20a03f">
<p>
If we split too much, we tend to <span class="underline">overfit</span> (consider, other than the data we are interested in, also noise).<br />
</p>

<p>
To avoid overfitting and find the best spot to stop splitting, our dataset should be divided in:<br />
</p>
<ul class="org-ul">
<li>training set (on which we make the splitting decisions)<br /></li>
<li>validation set (a labeled sample to monitor the misclassification error)<br /></li>
<li>testing set (a independent sample to test our decision tree)<br /></li>
</ul>

<p>
You can then plot the misclassification error on the validation set wrt the number of tree nodes.<br />
Once the misclassification error is at its minimum, we can then say to stop the creation of new nodes at that point and, instead, start the creation of leaves.<br />
</p>
</div>
</div>

<div id="outline-container-org1c15769" class="outline-5">
<h5 id="org1c15769">Advantages</h5>
<div class="outline-text-5" id="text-org1c15769">
<p>
Decision trees are useful because they are <span class="underline">easy to build</span>.<br />
Moreover, they are a <span class="underline">white-box method</span>: you can convert a decision tree into a set of <a href="#org6f60473">decision rules</a> easily (the ones that fraud detection expert based systems use), since you have the conditions on each node.<br />
</p>
</div>
</div>

<div id="outline-container-orga34fd88" class="outline-5">
<h5 id="orga34fd88">Disadvantages</h5>
<div class="outline-text-5" id="text-orga34fd88">
<p>
Decision trees tends to overfit the data, but we could use cross validation to reduce this.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgc836c57" class="outline-4">
<h4 id="orgc836c57">Regression trees</h4>
<div class="outline-text-4" id="text-orgc836c57">
<p>
You can also predict continuous targets with decision trees (for example, you can give the <i>probability</i> of a transaction being a fraud) and transform them into a <span class="underline">regression method</span>.<br />
</p>
</div>
</div>

<div id="outline-container-orgcd0af33" class="outline-4">
<h4 id="orgcd0af33">Neural Networks</h4>
<div class="outline-text-4" id="text-orgcd0af33">
<p>
Generalization of existing statistical models.<br />
The basic element of a Neural network is the <b>neuron</b>: it takes an input, multiplies it by a weight and puts it into a <i>transformation function</i> (can be a logistic regression).<br />
</p>
</div>
