Notes.org
**** Layers
:PROPERTIES:
:NOTER_PAGE: 179
:END:
The neural networks presented during lesson are composed of 3 layers:
- _Input layer_
- _Hidden layer_, which combines the inputs into features.
- _Output layer_, which linearly transforms the features given by the hidden layer.

Usually, each layer has _its own transformation function_ (common to all the nodes in the layer).
Neural networks can be used both as a _regression analysis_ method and a _classification analysis_ method, depending on the transformation function used in the output layer.

**** Weigth learning
:PROPERTIES:
:NOTER_PAGE: 184
:END:
To optimize a neural network, we use an iterative algorithm that optimizes a *cost function* to find the best assignments to the weights of each neuron.

The cost function used might have _multiple minimas_, that could get you stuck on a result that is not optimal.
To avoid this, we usually do the optimization with _multiple initial random set of weigths_ and select only the one with the global minimum after some steps.

**** How many hidden neurons?
:PROPERTIES:
:NOTER_PAGE: 186
:END:
The number of hidden neurons to use depends on the non linearity of the dataset.
The more complex are the patterns we need to model, the more neurons we will need.

The procedure to select the number of neurons is basically the same seen to select the number of nodes in Decision trees (called, in that context, the [[*Stopping decision][stopping decision]]):
1. Split the data into _training_, _validation_ and _test_ set
2. train multiple neural networks on the training set with different numbers of neurons.
3. measure the performance of each network on the validation set.
4. choose the most performant neural network
5. measure its actual performance on the independent test set.

**** The overfitting problem
:PROPERTIES:
:NOTER_PAGE: 187
:END:
To avoid overfitting, we can use two techniques
- _Weigth regularization_: we put an upper bound on the weigths of the neural net.
- The usual method: we estimate the weigth and use independent data sets of the same pool to decide when to stop training to avoid overfitting.

**** Neural Networks lack interpretability
:PROPERTIES:
:NOTER_PAGE: 188
:END:
It is extremely difficult to find out why a certain output is given from certain inputs, which makes the _extraction of rules complex_.

They are, though, generally more performant than the other methods seen.

***** Variable selection in Neural Networks
:PROPERTIES:
:NOTER_PAGE: 189
:END:
To find out which variables contribute actively to the outputs of the neural network, we must visualize the interaction between the inputs (our variables, like "the age of the customer" and "the amount claimed by the insurance company") and the rest of the network.

To do so, we use _Hinton Diagrams_, where we visualize the weigths between inputs and hidden neurons as squares and interpret them.

Another way is _Backward variable selection_:
We build a neural network with all the variables in input, then we recreate the network with one variable less to see how much the performance is impacted (those variables that don't hinder the performance of the network can be removed, since they add complexity).

***** Extracting rules from Neural Networks
:PROPERTIES:
:NOTER_PAGE: 195
:END:
To extract the rules to be fed to a rule based engine, we can use two techniques:
- _Decompositional rule extraction_, where we find the activation values of the hidden neurons (with clustering, for example) and join them in a single boolean rule.
- Pedagogical rule extraction: use the labels produced by the Neural Network as the training set for a white box method (like decision trees), where the rules are simpler to extract.

**** Two stage model setup
:PROPERTIES:
:NOTER_PAGE: 200
:END:
Instead of directly using a Neural network, we can estimate a simpler model with a more interpretable method (like linear/logistic regression) and, then, use a neural network to predict the errors made by the model and adjust the parameters of the linear model.

*** Support Vector Machines
:PROPERTIES:
:NOTER_PAGE: 202
:END:
Based on linear programming[fn:3] (define an objective function and put some constraints on it).
It's a _classification method_, but it can also be applied as a regression method.

**** Benefits
:PROPERTIES:
:NOTER_PAGE: 205
:END:
In linear programming, it's _easy to introduce business knowledge_ (simply add constraints).
**** Problem
:PROPERTIES:
:NOTER_PAGE: 206
:END:
1. It can estimate _multiple optimal decision boundaries_ for a linear separable case.
   We can avoid this problem by selecting the boundary that is maximally distant from the two classes.

2. The system might be *non-separable* (we might not be able to find a linear boundary between two classes).
   In this case, we can introduce a _misclassification error_, which allows for wrong classification labels to happen.

**** Rule extraction and Variable selection
:PROPERTIES:
:NOTER_PAGE: 215
:END:
To extract variables and rules from SVMs, we can use the same approaches seen for Neural Networks:
- for _variable selection_ , the [[*Variable selection in Neural Networks][backward variable selection]] procedure can be used to reduce the input variables.
- for _rule extraction_ , the SVM can be interpreted as a neural network and the [[*Extracting rules from Neural Networks][same methods]] can be applied.

*** Ensemble methods
:PROPERTIES:
:NOTER_PAGE: 219
:END:
Ensembe methods aim at estimating *multiple analytical models* instead of only one; The models created can then be used to cover different parts of the data input.

**** Bagging
:PROPERTIES:
:NOTER_PAGE: 220
:END:
The Baggin method is an ensemble method. It consists of two steps:
1. Take N samples from your dataset.
2. Build a model (also called _classifier_ ) for each of these samples.

A _classification_ model is then built by letting the classifiers "vote" on the label to give.
A _regression_ model is built by averaging the outcome of the N models.

