index.html

<div id="outline-container-org46236b6" class="outline-5">
<h5 id="org46236b6">Layers</h5>
<div class="outline-text-5" id="text-org46236b6">
<p>
The neural networks presented during lesson are composed of 3 layers:<br />
</p>
<ul class="org-ul">
<li><span class="underline">Input layer</span><br /></li>
<li><span class="underline">Hidden layer</span>, which combines the inputs into features.<br /></li>
<li><span class="underline">Output layer</span>, which linearly transforms the features given by the hidden layer.<br /></li>
</ul>

<p>
Usually, each layer has <span class="underline">its own transformation function</span> (common to all the nodes in the layer).<br />
Neural networks can be used both as a <span class="underline">regression analysis</span> method and a <span class="underline">classification analysis</span> method, depending on the transformation function used in the output layer.<br />
</p>
</div>
</div>

<div id="outline-container-org2b13918" class="outline-5">
<h5 id="org2b13918">Weigth learning</h5>
<div class="outline-text-5" id="text-org2b13918">
<p>
To optimize a neural network, we use an iterative algorithm that optimizes a <b>cost function</b> to find the best assignments to the weights of each neuron.<br />
</p>

<p>
The cost function used might have <span class="underline">multiple minimas</span>, that could get you stuck on a result that is not optimal.<br />
To avoid this, we usually do the optimization with <span class="underline">multiple initial random set of weigths</span> and select only the one with the global minimum after some steps.<br />
</p>
</div>
</div>

<div id="outline-container-org81b6183" class="outline-5">
<h5 id="org81b6183">How many hidden neurons?</h5>
<div class="outline-text-5" id="text-org81b6183">
<p>
The number of hidden neurons to use depends on the non linearity of the dataset.<br />
The more complex are the patterns we need to model, the more neurons we will need.<br />
</p>

<p>
The procedure to select the number of neurons is basically the same seen to select the number of nodes in Decision trees (called, in that context, the <a href="#orgc20a03f">stopping decision</a>):<br />
</p>
<ol class="org-ol">
<li>Split the data into <span class="underline">training</span>, <span class="underline">validation</span> and <span class="underline">test</span> set<br /></li>
<li>train multiple neural networks on the training set with different numbers of neurons.<br /></li>
<li>measure the performance of each network on the validation set.<br /></li>
<li>choose the most performant neural network<br /></li>
<li>measure its actual performance on the independent test set.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org76554b5" class="outline-5">
<h5 id="org76554b5">The overfitting problem</h5>
<div class="outline-text-5" id="text-org76554b5">
<p>
To avoid overfitting, we can use two techniques<br />
</p>
<ul class="org-ul">
<li><span class="underline">Weigth regularization</span>: we put an upper bound on the weigths of the neural net.<br /></li>
<li>The usual method: we estimate the weigth and use independent data sets of the same pool to decide when to stop training to avoid overfitting.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4c1d079" class="outline-5">
<h5 id="org4c1d079">Neural Networks lack interpretability</h5>
<div class="outline-text-5" id="text-org4c1d079">
<p>
It is extremely difficult to find out why a certain output is given from certain inputs, which makes the <span class="underline">extraction of rules complex</span>.<br />
</p>

<p>
They are, though, generally more performant than the other methods seen.<br />
</p>
</div>

<div id="outline-container-orgb0359d9" class="outline-6">
<h6 id="orgb0359d9">Variable selection in Neural Networks</h6>
<div class="outline-text-6" id="text-orgb0359d9">
<p>
To find out which variables contribute actively to the outputs of the neural network, we must visualize the interaction between the inputs (our variables, like &ldquo;the age of the customer&rdquo; and &ldquo;the amount claimed by the insurance company&rdquo;) and the rest of the network.<br />
</p>

<p>
To do so, we use <span class="underline">Hinton Diagrams</span>, where we visualize the weigths between inputs and hidden neurons as squares and interpret them.<br />
</p>

<p>
Another way is <span class="underline">Backward variable selection</span>:<br />
We build a neural network with all the variables in input, then we recreate the network with one variable less to see how much the performance is impacted (those variables that don&rsquo;t hinder the performance of the network can be removed, since they add complexity).<br />
</p>
</div>
</div>

<div id="outline-container-org1106ec7" class="outline-6">
<h6 id="org1106ec7">Extracting rules from Neural Networks</h6>
<div class="outline-text-6" id="text-org1106ec7">
<p>
To extract the rules to be fed to a rule based engine, we can use two techniques:<br />
</p>
<ul class="org-ul">
<li><span class="underline">Decompositional rule extraction</span>, where we find the activation values of the hidden neurons (with clustering, for example) and join them in a single boolean rule.<br /></li>
<li>Pedagogical rule extraction: use the labels produced by the Neural Network as the training set for a white box method (like decision trees), where the rules are simpler to extract.<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org09073c9" class="outline-5">
<h5 id="org09073c9">Two stage model setup</h5>
<div class="outline-text-5" id="text-org09073c9">
<p>
Instead of directly using a Neural network, we can estimate a simpler model with a more interpretable method (like linear/logistic regression) and, then, use a neural network to predict the errors made by the model and adjust the parameters of the linear model.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org97bbad1" class="outline-4">
<h4 id="org97bbad1">Support Vector Machines</h4>
<div class="outline-text-4" id="text-org97bbad1">
<p>
Based on linear programming<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup> (define an objective function and put some constraints on it).<br />
It&rsquo;s a <span class="underline">classification method</span>, but it can also be applied as a regression method.<br />
</p>
</div>

<div id="outline-container-org54f1e4d" class="outline-5">
<h5 id="org54f1e4d">Benefits</h5>
<div class="outline-text-5" id="text-org54f1e4d">
<p>
In linear programming, it&rsquo;s <span class="underline">easy to introduce business knowledge</span> (simply add constraints).<br />
</p>
</div>
</div>
<div id="outline-container-org41de880" class="outline-5">
<h5 id="org41de880">Problem</h5>
<div class="outline-text-5" id="text-org41de880">
<ol class="org-ol">
<li>It can estimate <span class="underline">multiple optimal decision boundaries</span> for a linear separable case.<br />
We can avoid this problem by selecting the boundary that is maximally distant from the two classes.<br /></li>

<li>The system might be <b>non-separable</b> (we might not be able to find a linear boundary between two classes).<br />
In this case, we can introduce a <span class="underline">misclassification error</span>, which allows for wrong classification labels to happen.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgb8f1c68" class="outline-5">
<h5 id="orgb8f1c68">Rule extraction and Variable selection</h5>
<div class="outline-text-5" id="text-orgb8f1c68">
<p>
To extract variables and rules from SVMs, we can use the same approaches seen for Neural Networks:<br />
</p>
<ul class="org-ul">
<li>To <span class="underline">reduce the variables to work on</span> , the <a href="#orgb0359d9">backward variable selection</a> procedure can be used.<br /></li>
<li>for <span class="underline">rule extraction</span> , the SVM can be interpreted as a neural network and the <a href="#org1106ec7">same methods</a> can be applied.<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfa60321" class="outline-4">
<h4 id="orgfa60321">Ensemble methods</h4>
<div class="outline-text-4" id="text-orgfa60321">
<p>
Ensembe methods aim at estimating <b>multiple analytical models</b> instead of only one; The models created can then be used to cover different parts of the data input.<br />
</p>
</div>

<div id="outline-container-orgdbcf1a6" class="outline-5">
<h5 id="orgdbcf1a6">Bagging</h5>
<div class="outline-text-5" id="text-orgdbcf1a6">
<p>
The Baggin method is an ensemble method. It consists of two steps:<br />
</p>
<ol class="org-ol">
<li>Take N samples from your dataset.<br /></li>
<li>Build a model (also called <span class="underline">classifier</span> ) for each of these samples.<br /></li>
</ol>

<p>
A <span class="underline">classification</span> model is then built by letting the classifiers &ldquo;vote&rdquo; on the label to give.<br />
A <span class="underline">regression</span> model is built by averaging the outcome of the N models.<br />
</p>
</div>
</div>
