Notes.org
**** Boosting
:PROPERTIES:
:NOTER_PAGE: 222
:END:
The Boosting method is an ensemble method. It estimates multiple models using a _weighted data sample_.

The weights applied on the data change according to the classification errors made by the models, to allow difficult observations to get more attention.
But this calls for a *drawback*: the models might become overfitted on the difficult observations.

The final model used is a combination of all the individual models.

**** Random Forest :missing_informations:
:PROPERTIES:
:NOTER_PAGE: 225
:END:
We create a "forest" of decision trees, with random splitting decision variables for each tree.

It's not clear how the final model is built from the set of decision trees.

*** Evaluating a fraud detection model
:PROPERTIES:
:NOTER_PAGE: 230
:END:
Two key decisions determine the effectiveness of the predictive models shown above:
- how to split the data set
- how we choose our performance metrics.

**** Splitting the data set
:PROPERTIES:
:NOTER_PAGE: 233
:END:
The training data set and the test dataset must be completely separated.
The decision on how we split the set *depends on the size* of the dataset itself.

When present, the validation sample (seen for [[*Stopping decision][decision trees]] and [[*How many hidden neurons?][neural networks]]) should be separated, too, but the requirement is less strict.

Sometimes, having the _same percentage of fraudsters_ in each set can be useful; Such split-up is called a *stratified split-up*.

***** Small data sets
When the data set is not big enough, two methods can be adopted to make the split:
- *Cross-validation*:
  The data is split in K groups, then the model is trained on K-1 groups and tested on the remaining group.
  The process is then repeated for every possible validation group, resulting in K _performance estimates_ (/aren't they also different models?/).
- *Leave-one-out cross validation*:
  Every observation is left out in turn and a model is made from the remaining ones.

The selection of the model can then be performed in different ways:
- randomly (common for leave-one-out cross validation, since every model changes by only an observation)
- a final model on all observation is built (taking into consideration the performances coming out of the cross validation process)
- an ensemble model is built with a voting procedure (similarly to what we have seen for [[*Bagging][bagging ensemble models]])

**** Performance metrics
:PROPERTIES:
:NOTER_PAGE: 242
:END:
The main performance metrics used to evaluate our analytical model are:
- *classification accuracy* : $\frac{\text{true positive } + \text{ true negative}}{\text{true positive }+\text{ false positive }+\text{ false negative }+\text{ true negative}}$, or the percentage of correctly classified observations.
- *classification error* : $\frac{\text{false positive } + \text{ false negative}}{\text{true positive }+\text{ false positive }+\text{ false negative }+\text{ true negative}}$, or the percentage of wrongly classified observations.
- *sensitivity* (also called recall or hit rate) : $\frac{\text{true positive}}{\text{true positive }+\text{ false negative}}$, or the percentage of fraudsters correctly labeled.
- *specificity* : $\frac{\text{true negative}}{\text{false positive }+\text{ true negative}}$, or the percentage of non-fraudsters correctly labeled.
- *precision* : $\frac{\text{true positive}}{\text{false positive }+\text{ true positive}}$, or the percentage of labeled fraudsters that are actually fraudsters.


**** Managing skewed datasets
:PROPERTIES:
:NOTER_PAGE: 251
:END:
With a skewed[fn:1] dataset it might become difficult to make a valid model due to the missing observations labeled as frauds.
Two transformations can be made to the dataset to make it less skewed:
- *Oversampling* : replicate frauds to make the distribution less skewed.
- *Undersampling* : remove some observations that aren't frauds.

The two can also be combined, but usually undersampling yelds better results (since we don't put in the set forged observations).

In general, it's suggested to *stay as close as possible to the original distribution* to avoid unnecessary bias.

* DONE Mobile Forensics :guest_lecture:
Mobile devices use has increased between people and, in turn, mobile forensics investigation has gained importance.

Mobile forensics is a branch of digital forensics, related to the recovery of digital evidence from a mobile device under *forensically sound conditions*.

** Forensical soundness
Forensically sound is a term used to justify the use of particular forensic technology or methodology.

It doesn't have a specific definition ("/it depends/"), but we can say that a method is forensically sound when it _doesn't alter or destroy the evidence_ and has been shown to be _consistently reliable_.

For example, in computer forensics we use various ways to avoid altering the data on the system:
On computers you are typically able to remove the hard drive, and if this option is not available you usually have a way to boot a live distribution to mount the hard drive on a read-only way (from a phisical perspective, we are able to have a 100% forensically sound approach).

On mobile devices, this is extremely difficult to do, mostly because we are _limited in the use of our phone_ (unless we are root, which is usually not the case) and because most elements (like memory) is soldered.
Moreover, the memory in the phone is most of the time encrypted on some key stored on the motherboard or another chipset (see iOS devices and their enclave).

When the acquisition of data is not possible without changing the configuration of the device (even booting the phone might change some things), the _procedure must be documented_ and the _changes must be tested beforehand_.

*** Example :noexport:unuseful:
We have to find interaction between two people that has happened on an instant messaging application.
We can extract those data without having impact on *that* data (but having an impact in other parts of the OS).

If we, instead, have to check what has happened to the phone in the last X days, we have to be really careful to ensure the data is not altered in any way (or as little as possible).

*** Low Level Exploits
In some phones, it's possible to obtain the best acquisition (full, unaltered) with *low level exploits*, which allow us to _obtain root privileges before the phone boots_; Such acquisitions are the nearest to forensically sound in mobile forensics.
It's more common on Android devices.

*** Documentation is key
The key to forensic soundness is *documentation*. The acquisition process should change the original evidence as little as possible and any changes should be documented and assessed.

