index.html

<div id="outline-container-org9d61d92" class="outline-5">
<h5 id="org9d61d92">Boosting</h5>
<div class="outline-text-5" id="text-org9d61d92">
<p>
The Boosting method is an ensemble method. It estimates multiple models using a <span class="underline">weighted data sample</span>.<br />
</p>

<p>
The weights applied on the data change according to the classification errors made by the models, to allow difficult observations to get more attention.<br />
But this calls for a <b>drawback</b>: the models might become overfitted on the difficult observations.<br />
</p>

<p>
The final model used is a combination of all the individual models.<br />
</p>
</div>
</div>

<div id="outline-container-org9622580" class="outline-5">
<h5 id="org9622580">Random Forest&#xa0;&#xa0;&#xa0;<span class="tag"><span class="missing_informations">missing_informations</span></span></h5>
<div class="outline-text-5" id="text-org9622580">
<p>
We create a &ldquo;forest&rdquo; of decision trees, with random splitting decision variables for each tree.<br />
</p>

<p>
It&rsquo;s not clear how the final model is built from the set of decision trees.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgf483e05" class="outline-4">
<h4 id="orgf483e05">Evaluating a fraud detection model</h4>
<div class="outline-text-4" id="text-orgf483e05">
<p>
Two key decisions determine the effectiveness of the predictive models shown above:<br />
</p>
<ul class="org-ul">
<li>how to split the data set<br /></li>
<li>how we choose our performance metrics.<br /></li>
</ul>
</div>

<div id="outline-container-org6fb6c29" class="outline-5">
<h5 id="org6fb6c29">Splitting the data set</h5>
<div class="outline-text-5" id="text-org6fb6c29">
<p>
The training data set and the test dataset must be completely separated.<br />
The decision on how we split the set <b>depends on the size</b> of the dataset itself.<br />
</p>

<p>
When present, the validation sample (seen for <a href="#orgc20a03f">decision trees</a> and <a href="#org81b6183">neural networks</a>) should be separated, too, but the requirement is less strict.<br />
</p>

<p>
Sometimes, having the <span class="underline">same percentage of fraudsters</span> in each set can be useful; Such split-up is called a <b>stratified split-up</b>.<br />
</p>
</div>

<div id="outline-container-org1980474" class="outline-6">
<h6 id="org1980474">Small data sets</h6>
<div class="outline-text-6" id="text-org1980474">
<p>
When the data set is not big enough, two methods can be adopted to make the split:<br />
</p>
<ul class="org-ul">
<li><b>Cross-validation</b>:<br />
The data is split in K groups, then the model is trained on K-1 groups and tested on the remaining group.<br />
The process is then repeated for every possible validation group, resulting in K <span class="underline">performance estimates</span> (<i>aren&rsquo;t they also different models?</i>).<br /></li>
<li><b>Leave-one-out cross validation</b>:<br />
Every observation is left out in turn and a model is made from the remaining ones.<br /></li>
</ul>

<p>
The selection of the model can then be performed in different ways:<br />
</p>
<ul class="org-ul">
<li>randomly (common for leave-one-out cross validation, since every model changes by only an observation)<br /></li>
<li>a final model on all observation is built (taking into consideration the performances coming out of the cross validation process)<br /></li>
<li>an ensemble model is built with a voting procedure (similarly to what we have seen for <a href="#orgdbcf1a6">bagging ensemble models</a>)<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e15954" class="outline-5">
<h5 id="org3e15954">Performance metrics</h5>
<div class="outline-text-5" id="text-org3e15954">
<p>
The main performance metrics used to evaluate our analytical model are:<br />
</p>
<ul class="org-ul">
<li><b>classification accuracy</b> : \(\frac{\text{true positive } + \text{ true negative}}{\text{true positive }+\text{ false positive }+\text{ false negative }+\text{ true negative}}\), or the percentage of correctly classified observations.<br /></li>
<li><b>classification error</b> : \(\frac{\text{false positive } + \text{ false negative}}{\text{true positive }+\text{ false positive }+\text{ false negative }+\text{ true negative}}\), or the percentage of wrongly classified observations.<br /></li>
<li><b>sensitivity</b> (also called recall or hit rate) : \(\frac{\text{true positive}}{\text{true positive }+\text{ false negative}}\), or the percentage of fraudsters correctly labeled.<br /></li>
<li><b>specificity</b> : \(\frac{\text{true negative}}{\text{false positive }+\text{ true negative}}\), or the percentage of non-fraudsters correctly labeled.<br /></li>
<li><b>precision</b> : \(\frac{\text{true positive}}{\text{false positive }+\text{ true positive}}\), or the percentage of labeled fraudsters that are actually fraudsters.<br /></li>
</ul>
</div>
</div>


<div id="outline-container-org95fdaa5" class="outline-5">
<h5 id="org95fdaa5">Managing skewed datasets</h5>
<div class="outline-text-5" id="text-org95fdaa5">
<p>
With a skewed<sup><a id="fnr.4.100" class="footref" href="#fn.4">4</a></sup> dataset it might become difficult to make a valid model due to the missing observations labeled as frauds.<br />
Two transformations can be made to the dataset to make it less skewed:<br />
</p>
<ul class="org-ul">
<li><b>Oversampling</b> : replicate frauds to make the distribution less skewed.<br /></li>
<li><b>Undersampling</b> : remove some observations that aren&rsquo;t frauds.<br /></li>
</ul>

<p>
The two can also be combined, but usually undersampling yelds better results (since we don&rsquo;t put in the set forged observations).<br />
</p>

<p>
In general, it&rsquo;s suggested to <b>stay as close as possible to the original distribution</b> to avoid unnecessary bias.<br />
</p>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff9c42e" class="outline-2">
<h2 id="orgff9c42e">Mobile Forensics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="guest_lecture">guest_lecture</span></span></h2>
<div class="outline-text-2" id="text-orgff9c42e">
<p>
Mobile devices use has increased between people and, in turn, mobile forensics investigation has gained importance.<br />
</p>

<p>
Mobile forensics is a branch of digital forensics, related to the recovery of digital evidence from a mobile device under <b>forensically sound conditions</b>.<br />
</p>
</div>

<div id="outline-container-org7c15100" class="outline-3">
<h3 id="org7c15100">Forensical soundness</h3>
<div class="outline-text-3" id="text-org7c15100">
<p>
Forensically sound is a term used to justify the use of particular forensic technology or methodology.<br />
</p>

<p>
It doesn&rsquo;t have a specific definition (&ldquo;<i>it depends</i>&rdquo;), but we can say that a method is forensically sound when it <span class="underline">doesn&rsquo;t alter or destroy the evidence</span> and has been shown to be <span class="underline">consistently reliable</span>.<br />
</p>

<p>
For example, in computer forensics we use various ways to avoid altering the data on the system:<br />
On computers you are typically able to remove the hard drive, and if this option is not available you usually have a way to boot a live distribution to mount the hard drive on a read-only way (from a phisical perspective, we are able to have a 100% forensically sound approach).<br />
</p>

<p>
On mobile devices, this is extremely difficult to do, mostly because we are <span class="underline">limited in the use of our phone</span> (unless we are root, which is usually not the case) and because most elements (like memory) is soldered.<br />
Moreover, the memory in the phone is most of the time encrypted on some key stored on the motherboard or another chipset (see iOS devices and their enclave).<br />
</p>

<p>
When the acquisition of data is not possible without changing the configuration of the device (even booting the phone might change some things), the <span class="underline">procedure must be documented</span> and the <span class="underline">changes must be tested beforehand</span>.<br />
</p>
</div>

<div id="outline-container-org53c1559" class="outline-4">
<h4 id="org53c1559">Low Level Exploits</h4>
<div class="outline-text-4" id="text-org53c1559">
<p>
In some phones, it&rsquo;s possible to obtain the best acquisition (full, unaltered) with <b>low level exploits</b>, which allow us to <span class="underline">obtain root privileges before the phone boots</span>; Such acquisitions are the nearest to forensically sound in mobile forensics.<br />
It&rsquo;s more common on Android devices.<br />
</p>
</div>
</div>

<div id="outline-container-orgf7014a4" class="outline-4">
<h4 id="orgf7014a4">Documentation is key</h4>
<div class="outline-text-4" id="text-orgf7014a4">
<p>
The key to forensic soundness is <b>documentation</b>. The acquisition process should change the original evidence as little as possible and any changes should be documented and assessed.<br />
</p>
</div>
</div>
</div>
