Notes.org
** Challenges of mobile forensics
In the mobile world we have a *big market fragmentation*, with new devices added daily.

Each and every device uses some kind of chipset (qualcomm, exynos, kirin etc.), and most exploits are available at the chipset level (sometimes also on software level, but rarely), which means we have to *undestand exactly the carachteristics of the device* in front of us.

Digital forensic analysts must also *overcome difficult security measures* (e.g: limited tries pin codes) brought up by the phone manufacturers, sometimes without the help of the incrimined person (s/he might be dead or unwilling to help).

Moreover, the *data of interest* for forensic analysts has *expanded to multiple applications* (where previously it was mostly sms and, sometimes, images).
The *amount of memory* to analyze in a smartphone has increased a lot (up to 500 gigs as of now) which implies the need for new analysis methodologies (e.g: AI recognition).

Finally, for some apps the data is stored not only on the phone but on the *cloud*, too, and to analyze those data you need access to the cloud account of the person, which:
1) is difficult to do
2) you must first get permission to do it

** Operating system diversity
In mobile, the most used OSes nowadays are _Android_ and _iOS_, with the only additional (still being developed) OS being _KaiOS_.
In Italy we use mostly Android, while in America iOS is dominant.
As you can understand, most of the commercial companies are US based.

*** Android versions diversity
Android has multiple versions still being used by a wide audience, with the security patches providing an additional layer of diversification.

When it comes to software level exploits, having knowledge of the version and which security patch is applied on the phone is the key point to choose your extraction methodology.

*** iOS versions diversity
Since iOS forces the updates on the phones, there's not the same diversity that you can find in the android market share.

** Guidelines to follow
There are various guidelines documented online to follow.
The one we will analyze is [[https://drive.google.com/file/d/1sVko_Uo7o6iootWwn9IoLJ3mrMVXqTDg/view][one from SWGDE]].

It's organized in sections:

*** Evidence collection and preservation
Tipically done by law enforcement.

**** Preparation
You need to have the proper tools to do and document the steps you will take, and you need to have proper legal authority to collect the evidence

**** Documentation
Take notes of the collection location and the device state and characteristics at the time of collection.
You have different things to identify and take as evidence, such as cables, phone boxes etc.

**** What to do first
Based on the state of the phone and its type, you have two options for the *preservation process* (what to do to preserve the integrity of the evidence and to work in a _forensically sound_ way):
- If on:
  + Keep it on. Making it turn off will almost certainly encrypt the phone
  + If the phone is on and the passcode was not inserted since boot, the phone won't have unencrypted its data and won't have used its ram (true mostly for iOS).
  + If we can access the settings, engage airplane mode, disable wifi, disable bluetooth and extend the display auto-lock.
  + If the system cannot be accessed, put it in a faraday bag to _avoid outside connections_ from happening.
- If off:
  + Don't turn it on
  + Remove the battery if possible
- In both cases, collect the device identifiers.

**** Check periferals
Check for any paired or linked devices, which might lead to backups or additional informations.

*** Evidence Handling
The steps to extract the data from your device without loss of digital or physical data (e.g: fingerprints).

**** Access devices
Frequently, phones can be unlocked if you have access to a safe place of the owner or another smart tool (a smartwatch) or the body of the person itself.
Be careful: don't try to guess the password, which might call procedures of the phone to provide additional security measures (like formatting the data partition of the phone).

**** Devices powered on and unlocked
Document as much as possible the content of the phone (also by taking pictures) without locking it accidentally.

If the phone is an organization's device, an MDM (mobile device management) system might be in place which would require to seek help from the system administrator of the organization to extract data.

**** Encryption
Most of the devices nowadays use some form of encryption.
iOS devices (mostly, but not only) have backup passwords.
There are ways to bypass and reset these kind of passwords but this modifies the content of the phone, and as such must be documented and extensively tested.

**** Network Isolation
Any kind of connection can be dangerous for the phone.

*** Evidence acquisition

**** Preparation
Prepare all the software applications, cables etc. to perform the acquisition.

There are various tools (and there is a [[https://www.nist.gov/itl/ssd/software-quality-group/computer-forensics-tool-testing-program-cftt/cftt-technical/mobile][website]]) to test and review various type of forensics tools.
The number of tool vendors available is limited nowadays, and there's no single tool perfect for all scopes: we have to _use different tools for different devices_, and sometimes manual investigation is mandatory.

Sometimes, exploit are not available at the time of the analysis, but they might become available later on (for example, Epifani told us about a time when the exploit was made available during a trial and they were able to analyze the phone at that point).

***** Tools for law enforcement and acquisition services
Some of these tools are only *meant for law enforcement*.
Most of the times though, police analysts use unlocking and decryption mechanisms *provided as a service*, where you send the phone to a lab and they unlock it through zero-days exploit that are not yet available to the public (and not yet tested).

This methods must be carefully reviewed by a court of law, since the methods used are not reliable.

