index.html

<div id="outline-container-orgf19eabe" class="outline-3">
<h3 id="orgf19eabe">Challenges of mobile forensics</h3>
<div class="outline-text-3" id="text-orgf19eabe">
<p>
In the mobile world we have a <b>big market fragmentation</b>, with new devices added daily.<br />
</p>

<p>
Each and every device uses some kind of chipset (qualcomm, exynos, kirin etc.), and most exploits are available at the chipset level (sometimes also on software level, but rarely), which means we have to <b>undestand exactly the carachteristics of the device</b> in front of us.<br />
</p>

<p>
Digital forensic analysts must also <b>overcome difficult security measures</b> (e.g: limited tries pin codes) brought up by the phone manufacturers, sometimes without the help of the incrimined person (s/he might be dead or unwilling to help).<br />
</p>

<p>
Moreover, the <b>data of interest</b> for forensic analysts has <b>expanded to multiple applications</b> (where previously it was mostly sms and, sometimes, images).<br />
The <b>amount of memory</b> to analyze in a smartphone has increased a lot (up to 500 gigs as of now) which implies the need for new analysis methodologies (e.g: AI recognition).<br />
</p>

<p>
Finally, for some apps the data is stored not only on the phone but on the <b>cloud</b>, too, and to analyze those data you need access to the cloud account of the person, which:<br />
</p>
<ol class="org-ol">
<li>is difficult to do<br /></li>
<li>you must first get permission to do it<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org8aaf1a5" class="outline-3">
<h3 id="org8aaf1a5">Operating system diversity</h3>
<div class="outline-text-3" id="text-org8aaf1a5">
<p>
In mobile, the most used OSes nowadays are <span class="underline">Android</span> and <span class="underline">iOS</span>, with the only additional (still being developed) OS being <span class="underline">KaiOS</span>.<br />
In Italy we use mostly Android, while in America iOS is dominant.<br />
As you can understand, most of the commercial companies are US based.<br />
</p>
</div>

<div id="outline-container-org45d13bb" class="outline-4">
<h4 id="org45d13bb">Android versions diversity</h4>
<div class="outline-text-4" id="text-org45d13bb">
<p>
Android has multiple versions still being used by a wide audience, with the security patches providing an additional layer of diversification.<br />
</p>

<p>
When it comes to software level exploits, having knowledge of the version and which security patch is applied on the phone is the key point to choose your extraction methodology.<br />
</p>
</div>
</div>

<div id="outline-container-org2392a4a" class="outline-4">
<h4 id="org2392a4a">iOS versions diversity</h4>
<div class="outline-text-4" id="text-org2392a4a">
<p>
Since iOS forces the updates on the phones, there&rsquo;s not the same diversity that you can find in the android market share.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org9234f7e" class="outline-3">
<h3 id="org9234f7e">Guidelines to follow</h3>
<div class="outline-text-3" id="text-org9234f7e">
<p>
There are various guidelines documented online to follow.<br />
The one we will analyze is <a href="https://drive.google.com/file/d/1sVko_Uo7o6iootWwn9IoLJ3mrMVXqTDg/view">one from SWGDE</a>.<br />
</p>

<p>
It&rsquo;s organized in sections:<br />
</p>
</div>

<div id="outline-container-org3c3d6f9" class="outline-4">
<h4 id="org3c3d6f9">Evidence collection and preservation</h4>
<div class="outline-text-4" id="text-org3c3d6f9">
<p>
Tipically done by law enforcement.<br />
</p>
</div>

<div id="outline-container-orgfe328d0" class="outline-5">
<h5 id="orgfe328d0">Preparation</h5>
<div class="outline-text-5" id="text-orgfe328d0">
<p>
You need to have the proper tools to do and document the steps you will take, and you need to have proper legal authority to collect the evidence<br />
</p>
</div>
</div>

<div id="outline-container-orgf898712" class="outline-5">
<h5 id="orgf898712">Documentation</h5>
<div class="outline-text-5" id="text-orgf898712">
<p>
Take notes of the collection location and the device state and characteristics at the time of collection.<br />
You have different things to identify and take as evidence, such as cables, phone boxes etc.<br />
</p>
</div>
</div>

<div id="outline-container-orgd48f84a" class="outline-5">
<h5 id="orgd48f84a">What to do first</h5>
<div class="outline-text-5" id="text-orgd48f84a">
<p>
Based on the state of the phone and its type, you have two options for the <b>preservation process</b> (what to do to preserve the integrity of the evidence and to work in a <span class="underline">forensically sound</span> way):<br />
</p>
<ul class="org-ul">
<li>If on:<br />
<ul class="org-ul">
<li>Keep it on. Making it turn off will almost certainly encrypt the phone<br /></li>
<li>If the phone is on and the passcode was not inserted since boot, the phone won&rsquo;t have unencrypted its data and won&rsquo;t have used its ram (true mostly for iOS).<br /></li>
<li>If we can access the settings, engage airplane mode, disable wifi, disable bluetooth and extend the display auto-lock.<br /></li>
<li>If the system cannot be accessed, put it in a faraday bag to <span class="underline">avoid outside connections</span> from happening.<br /></li>
</ul></li>
<li>If off:<br />
<ul class="org-ul">
<li>Don&rsquo;t turn it on<br /></li>
<li>Remove the battery if possible<br /></li>
</ul></li>
<li>In both cases, collect the device identifiers.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org5720d92" class="outline-5">
<h5 id="org5720d92">Check periferals</h5>
<div class="outline-text-5" id="text-org5720d92">
<p>
Check for any paired or linked devices, which might lead to backups or additional informations.<br />
</p>
</div>
</div>

<div id="outline-container-orgb883932" class="outline-5">
<h5 id="orgb883932">Check access devices</h5>
<div class="outline-text-5" id="text-orgb883932">
<p>
Frequently, phones can be unlocked if you have access to a safe place of the owner or another smart tool (a smartwatch) or the body of the person itself.<br />
Be careful: don&rsquo;t try to guess the password, which might call procedures of the phone to provide additional security measures (like formatting the data partition of the phone).<br />
</p>
</div>
</div>

<div id="outline-container-org20ad30d" class="outline-5">
<h5 id="org20ad30d">Organization phones</h5>
<div class="outline-text-5" id="text-org20ad30d">
<p>
If the phone is an organization&rsquo;s device, an MDM (mobile device management) system might be in place which would require to seek help from the system administrator of the organization to extract data.<br />
</p>
</div>
</div>

<div id="outline-container-orgbd8d787" class="outline-5">
<h5 id="orgbd8d787">Encryption</h5>
<div class="outline-text-5" id="text-orgbd8d787">
<p>
Most of the devices nowadays use some form of encryption.<br />
iOS devices (mostly, but not only) have backup passwords.<br />
There are ways to bypass and reset these kind of passwords but this modifies the content of the phone, and as such must be documented and extensively tested.<br />
</p>
</div>
</div>

<div id="outline-container-orgcda71a6" class="outline-5">
<h5 id="orgcda71a6">Network Isolation</h5>
<div class="outline-text-5" id="text-orgcda71a6">
<p>
Any kind of connection can be dangerous for the phone.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga237555" class="outline-4">
<h4 id="orga237555">Evidence acquisition</h4>
<div class="outline-text-4" id="text-orga237555">
</div>
<div id="outline-container-org4911a6d" class="outline-5">
<h5 id="org4911a6d">Preparation</h5>
<div class="outline-text-5" id="text-org4911a6d">
<p>
Prepare all the software applications, cables etc. to perform the acquisition.<br />
</p>

<p>
There are various tools (and there is a <a href="https://www.nist.gov/itl/ssd/software-quality-group/computer-forensics-tool-testing-program-cftt/cftt-technical/mobile">website</a>) to test and review various type of forensics tools.<br />
The number of tool vendors available is limited nowadays, and there&rsquo;s no single tool perfect for all scopes: we have to <span class="underline">use different tools for different devices</span>, and sometimes manual investigation is mandatory.<br />
</p>

<p>
Sometimes, exploit are not available at the time of the analysis, but they might become available later on (for example, Epifani told us about a time when the exploit was made available during a trial and they were able to analyze the phone at that point).<br />
</p>
</div>

<div id="outline-container-org9eae36c" class="outline-6">
<h6 id="org9eae36c">Tools for law enforcement and acquisition services</h6>
<div class="outline-text-6" id="text-org9eae36c">
<p>
Some of these tools are only <b>meant for law enforcement</b>.<br />
Most of the times though, police analysts use unlocking and decryption mechanisms <b>provided as a service</b>, where you send the phone to a lab and they unlock it through zero-days exploits that are not yet available to the public (and not yet tested).<br />
</p>

<p>
This methods must be carefully reviewed by a court of law, since the methods used are not reliable.<br />
</p>
</div>
</div>
</div>
