Notes.org
**** Device identification
To identify a device, you can use:
- its *IMEI*, a number to univocally identify it worldwide
- the model number
- the serial number

Sometimes, the IMEI is written on the back of the phone, sometimes it is written in the simcard tray, sometimes on the packaging box of the phone, but it should always be accessible (on an unlocked and functioning device) by dialing =*#06#=.

Once the IMEI is identified, you need to search and understand what characteristics the phone has based on it. You can use [[https://imei.info][this website]] to find informations about it.
Most importantly, the chipset must be known to understand which tool/technique to use to extract data from the phone.

Another option is to _check the coverage of the warranty_ of the phone (mainly for apple devices) through the serial number. This way you can undestrand wether the phone was recently purchased and, based on the informations acquired, you can ask apple (as a public prosecutor) to provide you informations about that phone.

**** Extraction methods
As a general rule, you can obtain different level of extraction based on the kind of devices and the patches applied.

***** Physical acquisition
Our goal is generally to obtain a physical, non invasive acquisition, which means we would use an exploit to obtain an image of the entire phone without phisically handling the phone (except for the insertion of a cable).

On most Samsung, encryption is done using full disk encryption (and not file based encryption). In this cases, we can change the boot loader (the part of the OS responsible of starting the OS) to and "engineering bootloader" to be able to access the trusted zone of the phone and obtain the encryption keys.

These engeneering bootloader must be signed by Samsung and be valid for the phone.

***** Logical acquisition

When a physical acquisition is not possible we rely on smaller acquisitions or, sometimes, simple logical acquisitions (which means that we only take what is available to us as non-root users).

Whit a logical aquisition we can tipically obtain native applications data but not third parti applications data (whatsapp, facebook etc.)

***** Partial filesystem aquisition
Since we are mostly interested on third party applications, sometimes we might try some (software) invasive method to get those data, for example to downgrade the application to have a viable exploit to make.
Take note that *this method is invasive*, since you are changing the state of the phone to do it.

***** Invasive acquisition
You can remove the chip from the device and try to analyze it, but most of the times nowadays you will get encrypted data.
This is still a _great option for IoT devices_.

On some android devices you can also simply remove external memories (sd cards and sim cards), even though sim cards don't contain much infos except for carrier informations.

**** Data extraction :noexport:unuseful:
You must try to have as little impact as possible during your data extraction.

** Tool analysis: Autopsy
Autopsy is an open source tool to analyze machines (calls itself the "premium forensic platform").
For mobile forensics, it will need an image to analyze.
It is centralized (in the organization, not globally), so its users users can share content.

*** Android analysis on Autopsy
Once you unzip the android file, you get two files:
- a 30gb file containing the dump of the rom memory of the file. That's a full _filesystem_ image, with the partitioning schema included.
- another 4mb file

Let's analyze the image by, first, creating a /case/ and adding our image to it. The type of source should be DiskImage (not LogicalFiles, since we have available a filesystem with partitions).

Then you select the timezone (UTC, we guess) and the tools to run on the image.
The tools we are going to use are:
- File Type identification
- Extension mismatch detector
- Embedded files extractor (allows to check if there is a file containing other files, like zip files, documents with images etc.)
- Picture analyzer (checks internal metadata for pictures)
- Android analyzer

The tool will start adding the data source to your case.

**** Image extraction

The extraction of the image must usually be done with commercial tools, like UFED for PC (from Cellebrite).
The same company makes a commercial analyzer (like autopsy, but a bit more advanced).

Image extraction on a locked phone is based on an exploit, and as usual this is risky.
That's why you should know what are the risks of each image extraction method (there are multiple, that can extract different kinds of informations)

**** Image Analysis
After having loaded the image, you can look at its contents through Autopsy.
You can see, by looking at the data sources, the huge number of partitions in an android device.
The most important ones are:
- The *system partition*, where the stock OS resides.
  + The app folder in the system partition contains pre-installed apps, in particular the apk files to run them.
  + This partition should not contain user data (unless the phone is rooted)
  + The =build.prop= file in the root of the file system contains the the properties of this build of android (like versions).
- The userdata partition.
  + Contains user data, settings, applications installed via the play store etc
  + You have an app folder here too, containing the apk files of the  applications installed by the user.
  + Under the data folder, we have a folder for each package (com.whatsapp, for example) and this folder is the only one to which the application can write data to.
    The data organization in this folder is highly dependant on the application.
- The misc folder.
  + Contains mainly network configurations, which can tell us more on the locations the target visited.

The results of the analysis are in the "Extracted Content" submenu.
We can see:
- Call logs, organized as databases, with cellular calls, facebook calls etc.
  To extract its contents we need to understand how its data is organized.
- Messages, organized in databases too, with SMS, whatsapp messages etc.
  These might not be all the messages saved on the phone! These are just the ones the tool was able to extract.
- Pictures, which can also be cached pictures.
- The list of installed applications

