index.html

<div id="outline-container-org991207a" class="outline-5">
<h5 id="org991207a">Device identification</h5>
<div class="outline-text-5" id="text-org991207a">
<p>
To identify a device, you can use:<br />
</p>
<ul class="org-ul">
<li>its <b>IMEI</b>, a number to univocally identify it worldwide<br /></li>
<li>the model number<br /></li>
<li>the serial number<br /></li>
</ul>

<p>
Sometimes, the IMEI is written on the back of the phone, sometimes it is written in the simcard tray, sometimes on the packaging box of the phone, but it should always be accessible (on an unlocked and functioning device) by dialing <code>*#06#</code>.<br />
</p>

<p>
Once the IMEI is identified, you need to search and understand what characteristics the phone has based on it. You can use <a href="https://imei.info">this website</a> to find informations about it.<br />
Most importantly, the chipset must be known to understand which tool/technique to use to extract data from the phone.<br />
</p>

<p>
Another option is to <span class="underline">check the coverage of the warranty</span> of the phone (mainly for apple devices) through the serial number. This way you can undestrand wether the phone was recently purchased and, based on the informations acquired, you can ask apple (as a public prosecutor) to provide you informations about that phone.<br />
</p>
</div>
</div>

<div id="outline-container-orge5469a2" class="outline-5">
<h5 id="orge5469a2">Extraction methods</h5>
<div class="outline-text-5" id="text-orge5469a2">
<p>
As a general rule, you can obtain different level of extraction based on the kind of devices and the patches applied.<br />
</p>
</div>

<div id="outline-container-org047031f" class="outline-6">
<h6 id="org047031f">Physical acquisition</h6>
<div class="outline-text-6" id="text-org047031f">
<p>
Our goal is generally to obtain a physical, non invasive acquisition, which means we would use an exploit to obtain an image of the entire phone without phisically handling the phone (except for the insertion of a cable).<br />
</p>

<p>
On most Samsung, encryption is done using full disk encryption (and not file based encryption). In this cases, we can change the boot loader (the part of the OS responsible of starting the OS) to and &ldquo;engineering bootloader&rdquo; to be able to access the trusted zone of the phone and obtain the encryption keys.<br />
</p>

<p>
These engeneering bootloader must be signed by Samsung and be valid for the phone.<br />
</p>
</div>
</div>

<div id="outline-container-orgca0daa4" class="outline-6">
<h6 id="orgca0daa4">Logical acquisition</h6>
<div class="outline-text-6" id="text-orgca0daa4">
<p>
When a physical acquisition is not possible we rely on smaller acquisitions or, sometimes, simple logical acquisitions (which means that we only take what is available to us as non-root users).<br />
</p>

<p>
Whit a logical aquisition we can tipically obtain native applications data but not third party applications data (whatsapp, facebook etc.)<br />
</p>
</div>
</div>

<div id="outline-container-org0fce0d9" class="outline-6">
<h6 id="org0fce0d9">Partial filesystem aquisition</h6>
<div class="outline-text-6" id="text-org0fce0d9">
<p>
Since we are mostly interested on third party applications, sometimes we might try some (software) invasive method to get those data, for example to downgrade the application to have a viable exploit to make.<br />
Take note that <b>this method is invasive</b>, since you are changing the state of the phone to do it.<br />
</p>
</div>
</div>

<div id="outline-container-orgb3fdd5f" class="outline-6">
<h6 id="orgb3fdd5f">Invasive acquisition</h6>
<div class="outline-text-6" id="text-orgb3fdd5f">
<p>
You can remove the chip from the device and try to analyze it, but most of the times nowadays you will get encrypted data.<br />
This is still a <span class="underline">great option for IoT devices</span>.<br />
</p>

<p>
On some android devices you can also simply remove external memories (sd cards and sim cards), even though sim cards don&rsquo;t contain much infos except for carrier informations.<br />
</p>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5ceb3c0" class="outline-3">
<h3 id="org5ceb3c0">Tool analysis: Autopsy</h3>
<div class="outline-text-3" id="text-org5ceb3c0">
<p>
Autopsy is an open source tool to analyze machines (calls itself the &ldquo;premium forensic platform&rdquo;).<br />
For mobile forensics, it will need an image to analyze.<br />
It is centralized (in the organization, not globally), so its users users can share content.<br />
</p>
</div>

<div id="outline-container-org583675a" class="outline-4">
<h4 id="org583675a">Android analysis on Autopsy</h4>
<div class="outline-text-4" id="text-org583675a">
<p>
Once you unzip the android file, you get two files:<br />
</p>
<ul class="org-ul">
<li>a 30gb file containing the dump of the rom memory of the file. That&rsquo;s a full <span class="underline">filesystem</span> image, with the partitioning schema included.<br /></li>
<li>another 4mb file<br /></li>
</ul>

<p>
Let&rsquo;s analyze the image by, first, creating a <i>case</i> and adding our image to it. The type of source should be DiskImage (not LogicalFiles, since we have available a filesystem with partitions).<br />
</p>

<p>
Then you select the timezone (UTC, we guess) and the tools to run on the image.<br />
The tools we are going to use are:<br />
</p>
<ul class="org-ul">
<li>File Type identification<br /></li>
<li>Extension mismatch detector<br /></li>
<li>Embedded files extractor (allows to check if there is a file containing other files, like zip files, documents with images etc.)<br /></li>
<li>Picture analyzer (checks internal metadata for pictures)<br /></li>
<li>Android analyzer<br /></li>
</ul>

<p>
The tool will start adding the data source to your case.<br />
</p>
</div>

<div id="outline-container-org356dd3f" class="outline-5">
<h5 id="org356dd3f">Image extraction</h5>
<div class="outline-text-5" id="text-org356dd3f">
<p>
The extraction of the image must usually be done with commercial tools, like UFED for PC (from Cellebrite).<br />
The same company makes a commercial analyzer (like autopsy, but a bit more advanced).<br />
</p>

<p>
Image extraction on a locked phone is based on an exploit, and as usual this is risky.<br />
That&rsquo;s why you should know what are the risks of each image extraction method (there are multiple, that can extract different kinds of informations)<br />
</p>
</div>
</div>

<div id="outline-container-org7c7f308" class="outline-5">
<h5 id="org7c7f308">Image Analysis</h5>
<div class="outline-text-5" id="text-org7c7f308">
<p>
After having loaded the image, you can look at its contents through Autopsy.<br />
You can see, by looking at the data sources, the huge number of partitions in an android device.<br />
The most important ones are:<br />
</p>
<ul class="org-ul">
<li>The <b>system partition</b>, where the stock OS resides.<br />
<ul class="org-ul">
<li>The app folder in the system partition contains pre-installed apps, in particular the apk files to run them.<br /></li>
<li>This partition should not contain user data (unless the phone is rooted)<br /></li>
<li>The <code>build.prop</code> file in the root of the file system contains the the properties of this build of android (like versions).<br /></li>
</ul></li>
<li>The userdata partition.<br />
<ul class="org-ul">
<li>Contains user data, settings, applications installed via the play store etc<br /></li>
<li>You have an app folder here too, containing the apk files of the  applications installed by the user.<br /></li>
<li>Under the data folder, we have a folder for each package (com.whatsapp, for example) and this folder is the only one to which the application can write data to.<br />
The data organization in this folder is highly dependant on the application.<br /></li>
</ul></li>
<li>The misc folder.<br />
<ul class="org-ul">
<li>Contains mainly network configurations, which can tell us more on the locations the target visited.<br /></li>
</ul></li>
</ul>

<p>
The results of the analysis are in the &ldquo;Extracted Content&rdquo; submenu.<br />
We can see:<br />
</p>
<ul class="org-ul">
<li>Call logs, organized as databases, with cellular calls, facebook calls etc.<br />
To extract its contents we need to understand how its data is organized.<br /></li>
<li>Messages, organized in databases too, with SMS, whatsapp messages etc.<br />
These might not be all the messages saved on the phone! These are just the ones the tool was able to extract.<br /></li>
<li>Pictures, which can also be cached pictures.<br /></li>
<li>The list of installed applications<br /></li>
</ul>
</div>
</div>
</div>
</div>
