Notes.org
** Android analysis with Physical analyzer (commercial tool)
Built for mobile only.

The unpacking of the image is done through layers: you start with the filesystem layer, then go to the volume layer, then to the file layer

The difference with Autopsy is the number of applications data layouts recognized.
For example, if we go to look at the call logs, they are many more than the ones we found in Autopsy, because it was able to fetch calls from more applications.
You can also see the file where the information was extracted from, and the specific point of extraction.

When you see a red number next to an entry you know that number of items where deleted by the user and recovered by the tool.

Through the timeline, you can see every item with the timestamp of the last access/creation, with a graph showing the usage of the phone based on them.

Moreover, you can also see the account tokens used in the phone (potentially having access to the account).

*** How to have a forensically resilient phone :in_class_question:
To have a forensically resilient phone, the producer must limit the costumers on their use and set restrictions on the things they can do with the phone.

* NO Guest_lecture_glorioso :noexport:
:PROPERTIES:
:NOTER_DOCUMENT: slides/Guest_lecture_glorioso.pdf
:NOTER_PAGE: 27
:END:
We are assisting to a true "fourth revolution".

** Cyber space
:PROPERTIES:
:NOTER_PAGE: 4
:END:
We have many categories of illegal activities in this sphere.
These are very different and different are the the ways to combat them.

*** Definition of cyber space
:PROPERTIES:
:NOTER_PAGE: 6
:END:
"Schizophrenic interconnection of data" by Gibson.
Another version from the Pentagon.

*** Example of Cyber warfare
:PROPERTIES:
:NOTER_PAGE: 7
:END:
In Estonia, banks were disabled for a certain amount of time.

Cyber attacks are often connected to their political contexts (example: Stuxnet).

*** UNGGE
:PROPERTIES:
:NOTER_PAGE: 11
:END:
A group of governamental experts to study the field of information and telecommunications.
It created the International law (the "charter of the UN").

*** Legal framework of Cyber Operations
:PROPERTIES:
:NOTER_PAGE: 14
:END:

*** Nato position on cyber attacks
:PROPERTIES:
:NOTER_PAGE: 15
:END:
The attacked country has the possibility to react with firearms.
Only once it was used, against Afghanistan.

Two important exercises are made yearly by the NATO to test their offensive/defensive capabilities.

*** Cyber warfare in the scope of the conflict law
If a cyber attack is made to a bank system, is it considered an armed attack/ and attack that requires a reaction?
You can considering the attack "kinetic" when it has victims or injuried.
*** Qualification of a cyber attack
:PROPERTIES:
:NOTER_PAGE: 21
:END:
*** Ethics on cyber conflict
:PROPERTIES:
:NOTER_PAGE: 22
:END:
A workshop was organized with technical experts to define what is not defined yet in this context.
*** The cyber coalition
:PROPERTIES:
:NOTER_PAGE: 25
:END:
Huge execise on Nato cyber defence.
** The problem now
We don't have a state practice. But in case of an attack we will probably use article 5 to promote a kinetic answer.
* DONE Malware Analysis :missing_informations:guest_lecture:
There are two kinds of analysis (we will use both in the demo):
- static:
  The code is not executed; Avoids malicious behaviors, but might be slow.
- dynamic:
  Usually made through a debugger: You run the program and check its runtime behavior.
  _Can_ be much faster than static analysis (but the malware might recognize it's being dynamically analyzed, or be dormiant)

The *best strategy is doing both*.

On windows, register entries are used by malwares to get persistency and stay hidden.

* TODO Cloud forensics
Digital forensics meets a plethora of problems when confronted with cloud infrastructures.
In the following, the focus will mainly be on public clouds, since they are the ones affected by these problems.

** Acquisition issues
In general, no control is given to the user on hw and storage space.
Investigators cannot really access the metal[fn:5], at most they can have dumps of the vm hosting the client's storage.

All our concepts about [[*Data Recovery][data remnants recovery]] are unuseful in this context, since the stuff you deallocate is lost on a virtual drive.

Depending on the service, we have different levels of access:
- SaaS:
  The cloud service provider has logs for application and network. This data can only be seized with a plenaria[fn:6] from the judge, but it may not be available (maybe the provider doesn't keep them).
- PaaS
- IaaS

*** Data existence
In the cloud world, it is _not always true that data exists_.
Most data exists only in the scope of a transaction; For example, the comments to a deleted video on youtube might be unfeasible to check.
This is a very difficult concept to explain to a court.

**** Experience
The court once asked an internet giant to retrieve the contents of a deleted page.
The giant responded that it was "too costly", and it was in fact true, but the answer was rejected.
It's difficult for non technical people to understand the complexity of a system that allows billions of people to see the same thing simultaneously.

Another example of lack of data is when we try to get the number of people that interacted with a page/an element.

*** Acquisition problems
How do you acquire a web page?

Problems:
- Dynamic contents
  How can you be sure that is what the victim was seeing? Everything the user see might be based on something he has done.
- Due to encryption, we cannot use the old method of using a packet sniffer to capture the data.
- Visualization is different from data. What is the status of things that are imported from the outside?
- Who is the couprit of an offensive advertisement?
- The attribution problem
  The structure of the internet changes daily, and you want to retrieve the data at the time of the victim's visit. This data consists in:
  + Whois data
  + DNS resolution
  + Connectivity and provider identification
  + geolocation of hoster (in particular, this is the most uncertain since is given by the provider).

** Analysis issues
The _retrieval of deleted data_ (the most expected work by forensics experts) is basically *impossible on cloud environments*.

If you are trying to investigate any compromise that extends to the hypervisor, it will be almost impossible to investigate, unless the cloud provider wants to demonstrate such compromise with you (quite unusual, since then they'll have to admit the security breach).

** Attrubution issue
In cyberspace, attribution is diffcult: IPs can be taken, but linking them to a real person is the real deal.

In cloud forensics, the problem is even worse: Anyone can pay with someone else's payment card the cloud instance fee.

** Legal issues
The geographic location of the IP address changes drastically the law system aroud the case.

The location of data in cloud services may be difficult to prove or the data might be on multiple locations altogether.
What happens if the data centers storing each part of the data are on different jurisdiction with different laws?

*** Clouds of clouds of clouds
Some cloud systems use other cloud providers to store their data.
This add other layers of indirection that would complicate even more the matter.

** Forensically enabled clouds :noexport:missing_informations:
Some clouds supports investigation (are used by investigators):
- Data location (to allow companies to have their data stay in a certain location, other than the reasons seen above)
- Proof of past data possession
[...]

*** Dual considerations
- Pros
  + data storage size is constantly increasing
  + analysis of large amounts of data might be unfeasible on local hardware
- Cons
  + Repeatability of the act is limited
  + loss of control on evidence
  + chain of custody must be preserved

* Should companies be more helpful to companies to support justice :noexport:

** Shooting of San Bernardino
FBI asked Apple to write some code to avoid having the phone wiped after too many wrong code attempts

Apple declined, mostly for a moral principle: the first amendement forbits the government to mandate speech

** Charged question
Justice is a very broad term, and the questions seems charged: is justice always represented by the government?

The right decision is the one that follows the decision that we, as a society, ha   d.

* Exam informations :noexport:
The exam is going to be a written one, except:
- If you are abroad (there's a checkbox to be flagged on subscription)
- All requests to make the exam online are going to be accepted, but be considerate of the number of people.
  Remember to enroll to the exam any way, since you must be enrolled to have your exam evaluated.

For this course specifically, you have received a link to make an oral exam. That oral exam is going to be remote, you won't have to give justifications.
The exam is going to be basically the same, there's going to be 3/4 questions.
Keep looking at the registration since the class or the time of the day will probably change, also look on the day of the exam itself (valid for both the written and the oral exam).

All the answers can be given in italian, too.

The time for the exam will be aroud 1 and a half hour (depending on the number of questions in exam)

** Topics
- all the topics Stefano taught
- all the topics Carminati taught
- all the topics Epifani taught
- About Bellante's classes, we won't be asked about details, but some things might be asked:
  - what malware analysis can achieve
  - what kinds of analysis can be made

All the other lectures aren't going to be on exam (but, if cited, they will be accepted).

* Footnotes

[fn:6] a plenaria is the definitive approvation of an action.

[fn:5] "metal" in this context means the effective machine on which the cloud instance is running.

[fn:4] litigation can be translated in italian with "fatto in esame".

[fn:3] If you have followed the course "Foundations of Operation Research", you are already familiar with this concept.

[fn:2] Basket market can be translated with "vendita al dettaglio" in Italian.

[fn:1] Skewness, in this context, can be read as *asymmetry*
