index.html

<div id="outline-container-org0dab065" class="outline-3">
<h3 id="org0dab065">Android analysis with Physical analyzer (commercial tool)</h3>
<div class="outline-text-3" id="text-org0dab065">
<p>
Built for mobile only.<br />
</p>

<p>
The unpacking of the image is done through layers: you start with the filesystem layer, then go to the volume layer, then to the file layer<br />
</p>

<p>
The difference with Autopsy is the number of applications data layouts recognized.<br />
For example, if we go to look at the call logs, they are many more than the ones we found in Autopsy, because it was able to fetch calls from more applications.<br />
You can also see the file where the information was extracted from, and the specific point of extraction.<br />
</p>

<p>
When you see a red number next to an entry you know that number of items where deleted by the user and recovered by the tool.<br />
</p>

<p>
Through the timeline, you can see every item with the timestamp of the last access/creation, with a graph showing the usage of the phone based on them.<br />
</p>

<p>
Moreover, you can also see the account tokens used in the phone (potentially having access to the account).<br />
</p>
</div>

<div id="outline-container-orgf2c7805" class="outline-4">
<h4 id="orgf2c7805">How to have a forensically resilient phone&#xa0;&#xa0;&#xa0;<span class="tag"><span class="in_class_question">in_class_question</span></span></h4>
<div class="outline-text-4" id="text-orgf2c7805">
<p>
To have a forensically resilient phone, the producer must limit the costumers on their use and set restrictions on the things they can do with the phone.<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orga8b0f43" class="outline-2">
<h2 id="orga8b0f43">Malware Analysis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="missing_informations">missing_informations</span>&#xa0;<span class="guest_lecture">guest_lecture</span></span></h2>
<div class="outline-text-2" id="text-orga8b0f43">
<p>
There are two kinds of analysis (we will use both in the demo):<br />
</p>
<ul class="org-ul">
<li>static:<br />
The code is not executed; Avoids malicious behaviors, but might be slow.<br /></li>
<li>dynamic:<br />
Usually made through a debugger: You run the program and check its runtime behavior.<br />
<span class="underline">Can</span> be much faster than static analysis (but the malware might recognize it&rsquo;s being dynamically analyzed, or be dormiant)<br /></li>
</ul>

<p>
The <b>best strategy is doing both</b>.<br />
</p>

<p>
On windows, register entries are used by malwares to get persistency and stay hidden.<br />
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
litigation can be translated in italian with &ldquo;fatto in esame&rdquo;.<br />
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
&ldquo;metal&rdquo; in this context means the effective machine on which the cloud instance is running.<br />
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
a plenaria is the definitive approvation of an action.<br />
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Skewness, in this context, can be read as <b>asymmetry</b><br />
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Basket market can be translated with &ldquo;vendita al dettaglio&rdquo; in Italian.<br />
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
If you have followed the course &ldquo;Foundations of Operation Research&rdquo;, you are already familiar with this concept.<br />
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Tancredi Covioli</p>
<p class="date">Created: 2021-06-13 dom 01:28</p>
</div>
</body>
</html>
